{
  "chapter_title": "Chapter 2 - Employment Authorization for Certain H-4, E, and L Nonimmigrant Dependent Spouses",
  "content": [
    {
      "section_title": "Employment Authorization for Certain H-4, E, and L Nonimmigrant Dependent Spouses",
      "description": "As of November 12, 2021, USCIS considers certain E-1, E-2, E-3 and L-2 nonimmigrant dependent spouses employment authorized incident to status.",
      "details": [
        {
          "paragraph": "To obtain an Employment Authorization Document (EAD or Form I-766) evidencing both identity and employment authorization, such dependent spouses may file an Application for Employment Authorization (Form I-765)."
        },
        {
          "paragraph": "E and L spouses are issued an Arrival-Departure Record (Form I-94) by USCIS or U.S. Customs and Border Protection (CBP). As of January 30, 2022, USCIS and CBP began issuing Forms I-94 with the following new Class of Admission (COA) codes for certain E and L spouses: E-1S, E-2S, E-3S, and L-2S. The application of these new COA codes distinguishes dependent spouses from dependent children, who are not employment authorized incident to status. An unexpired Form I-94 notated with E-1S, E-2S, E-3S, or L-2S nonimmigrant status is acceptable as evidence of employment authorization under List C of Form I-9."
        },
        {
          "paragraph": "USCIS generally provides notices to E and L spouses with a Form I-94 issued by USCIS before January 30, 2022 that was notated with E-1, E-2, E-3, E-3D, E-3R, or L-2 nonimmigrant status that state they were identified as an employment authorized spouse and may use the notice, in combination with their Form I-94 issued by USCIS as evidence of employment authorization. Such notice, together with an unexpired Form I-94 reflecting E-1, E-2, E-3, E-3D, E-3R, or L-2 nonimmigrant status, is acceptable as evidence of employment authorization under List C of Form I-9."
        },
        {
          "paragraph": "Notwithstanding this change, E and L spouses may continue to apply for an EAD to obtain evidence of identity and employment authorization by properly filing Form I-765, with the appropriate fee, if applicable."
        }
      ]
    },
    {
      "section_title": "Validity Period",
      "description": "USCIS has discretion to establish a specific validity period for employment authorization, though not to exceed certain amounts of time in some circumstances.",
      "details": [
        {
          "paragraph": "USCIS generally grants the EAD with a validity period that aligns with the applicant’s Form I-94 expiration date, not to exceed 2 years for E and L dependent spouses, or 3 years for H-4 dependent spouses."
        }
      ]
    },
    {
      "section_title": "Applications to Renew Employment Authorization, EADs, and Automatic Extensions",
      "details": [
        {
          "paragraph": "Beginning November 12, 2021, the EAD of an E and L dependent spouse, and employment authorization and EAD of an H-4 dependent spouse, will be automatically extended for a period of up to 180 days if:"
        },
        {
          "conditions": [
            "The dependent spouse properly filed an Application for Employment Authorization (Form I-765) for a renewal of their E, L, or H-4 dependent spouse-based EAD before the current EAD expired.",
            "The dependent spouse has an unexpired Form I-94 indicating valid E, L, or H-4 derivative status."
          ]
        },
        {
          "paragraph": "Any such automatic extension will terminate automatically on the earlier of:"
        },
        {
          "termination_conditions": [
            "The end of the validity period of the nonimmigrant status, as shown on the Form I-94;",
            "The approval or denial of the application to renew the previous EAD using Form I-765; or",
            "180 days from the date of the expiration of the previous EAD."
          ]
        },
        {
          "paragraph": "The following combination of documents evidence the automatic extension of the previous EAD:"
        },
        {
          "document_combination": [
            "The facially expired previous EAD stating Category A17, A18, or C26, as applicable;",
            "A Notice of Action (Form I-797C) for Form I-765 with Class requested in the same category as the expired EAD (either “(a)(17),” “(a)(18),” or “(c)(26),” as applicable), and showing that the renewal application was filed before the EAD expired;",
            "An unexpired Arrival-Departure Record (Form I-94) reflecting H-4, E, or L derivative status, as applicable."
          ]
        },
        {
          "paragraph": "With this document combination, the expired EAD is considered unexpired and acceptable as evidence of identity and employment authorization for completion of Employment Eligibility Verification (Form I-9). Reverification of employment authorization is required at the end of the automatic extension period."
        }
      ]
    }
  ],
  "footnotes": [
    {
      "note": "This policy does not apply to dependents (including spouses) of Employees of the Taipei Economic and Cultural Representative Office (TECRO) and Taipei Economic and Cultural Offices (TECO), who continue to be required to apply for employment authorization per 8 CFR 274a.12(c)(2). Further, this policy does not apply to spouses of Long-Term Investors in the Commonwealth of the Northern Mariana Islands (E-2 CNMI Investors) who are also required to apply for employment authorization per 8 CFR 274a.12(c)(12). Additionally, as noted in 8 CFR 214.2(e)(23)(x)(B), spouses of E-2 CNMI investors who obtained such status based upon a Foreign Retiree Investment Certificate are not eligible for work authorization."
    },
    {
      "note": "For additional information on Form I-94, see CBP’s I-94 Website: Travel Records for U.S. Visitors."
    },
    {
      "note": "This process of USCIS sending a supplemental notice is not available for Forms I-94 issued by CBP because USCIS cannot issue documents on behalf of CBP."
    },
    {
      "note": "See 8 CFR 274a.12."
    },
    {
      "note": "The renewal application and the current EAD should reflect the same “Class requested,” either “(a)(17),” “(a)(18),” or “(c)(26).”"
    }
  ]
}
