{
    "content": [
        "",
        "",
        "OMB Control No.: 1205-0310  ",
        "Expiration Date:  10/31/2021 ",
        "Labor Condition Application for H-1B, H-1B1 and E-3 Nonimmigrant Workers ",
        "Form ETA-9035CP –General Instructions for the 9035 & 9035E ",
        "U.S. Department of Labor",
        " ",
        "Page 1   of 13 ",
        "IMT:  Please read these instructions carefully before completing the Form ETA-9035 or 9035E – Labor Condition ",
        "Application (LCA) for Nonimmigrant Workers.  These instructions contain full explanations of the questions and attestations that ",
        "make up the LCA,  Form ETA-9035 and 9035E, with further information about the employer’s obligations provided in 20 CFR 655 ",
        "Subpart H.  If the employer plans to file non-electronically, which is allowed only for certain reasons set out below, ALL required ",
        "fields and   items containing an asterisk (*) must be completed as well as any fields and items where a response is conditioned on ",
        "the response to another required section/field or item as indicated by the s ection (§) symbol. ",
        "PORTAN",
        "In accordance with 20 CFR 655.740, once an LCA has been received from an employer, a determination will be made by the ",
        "Department of Labor’s (Department) Employment and Training Administration (ETA) Certifying Officer whether to certify the LCA ",
        "or return it to the employer not certified.  Where all items on the Form ETA-9035 or 9035E are complete and do not contain ",
        "obvious inaccuracies, the ETA Certifying Officer will certify the LCA within 7 working days of the date the LCA is received and ",
        "date-stamped by the Department.  If the LCA is not certified pursuant to 20 CFR 655.740(a)(2)(i) or (ii), the ETA Certifying ",
        "Officer will return it to the employer, or the employer’s authorized agent or representative, explaining the reason(s) for such ",
        "return without certification.  Except in the case of a disqualification issued by the Wage Hour Administrator, the employer may ",
        "submit a corrected LCA to the Department for review, which shall be treated as a new LCA and processed on a “first come, first ",
        "served” basis.   ",
        "Anyone who knowingly and willingly furnishes false information in the preparation of the Form ETA-9035 or 9035E and any ",
        "supplement thereto, or aids, abets, or counsels another to do so is committing a Federal offense under 18 U.S.C. 1001 or other ",
        "provisions of law. ",
        "OMB Notice:  These reporting instructions have been approved under the Paperwork Reduction Act of 1995.  Persons are not ",
        "required to respond to this collection of information unless it displays a currently valid OMB control number.  Obligations to reply ",
        "are mandatory (Immigration and Nationality Act (INA), Section 212(n) and (t) and 214(c)).   Public reporting burden for this ",
        "collection of information, which is to assist with program management and to meet Congressional and statutory requirements is ",
        "estimated to average 75 minutes per response, including the time to review instructions, search existing data sources, gather ",
        "and maintain the data needed, and complete and review the collection of information.  ",
        "Send comments regarding this burden estimate or any other aspect of this collection of information, including suggestions for ",
        "reducing this burden, to the U.S. Department of Labor, Employment and Training Administration, Office of Foreign Labor ",
        "Certification, 200 Constitution Ave., NW, Box PPII 12-200, Washington, DC, 20210.  (Paperwork Reduction Project OMB 1205-",
        "0310).",
        "  Do NOT send the completed application to this address. ",
        "   ",
        "HOW TO FILE ",
        "A.Who May File:",
        "A United States (U.S.) employer who desires to apply for an LCA on behalf of a nonimmigrant worker(s) must file the Form ETA-",
        "9035 (paper) or Form ETA-9035E (electronic).",
        "B.How to File and Retention of Records",
        "1.Online filing of the Form ETA-9035E is required through the iCERT Visa Portal System (iCERT System), which is",
        "accessible at http://icert.doleta.gov",
        ", unless an employer has a disability or lacks Internet access.  Employers with a",
        "disability   that prevents   them from filing electronic applications or employers without Internet access can file the LCA by",
        "U.S. mail.  Employers without Internet access MUST obtain prior permission to file their application by U.S. mail by",
        "submitting a written request to the following address:",
        "Attention:  Administrator ",
        "Of   f",
        "ice of Foreign Labor Certification ",
        "Employment & Training Administration ",
        "U.S. Department of Labor ",
        "200 Constitution Avenue, NW,  Box PPII 12-200 ",
        "Washington, DC 20210 ",
        "E",
        "mploy",
        "ers filing non-electronically due to disability must notify the Office of Foreign Labor Certification of the reason for the non-",
        "electronic filing at the time of submitting the application. ",
        "",
        "OMB Control No.: 1205-0310  ",
        "Expiration Date:  10/31/2021  ",
        "Labor Condition Application for H-1B, H-1B1 and E-3 Nonimmigrant Workers ",
        "Form ETA-9035CP –General Instructions for the 9035 & 9035E ",
        "U.S. Department of Labor",
        " ",
        "Page 2   of 13 ",
        "2.In accordance with 20 CFR part 655, Subpart H, either at the employer's principal place of business in the U.S. or at the place",
        "of employment, the employer must retain copies of the records required by Subpart H for a period of one (1) year beyond the",
        "last date on which any nonimmigrant worker is employed under the LCA or, if no nonimmigrant workers were employed under",
        "the LCA, one (1) year from the date the LCA expired or was withdrawn.  Required payroll records for the nonimmigrant",
        "workers and other workers in the occupational classification, including the names and wage rates of such workers and the",
        "information on benefits offered, as required by 20 CFR 655.760(a)(6), shall be retained at the employer's principal place of",
        "business in the U.S. or at the place of employment for a period of three (3) years from the date(s) of the creation of the",
        "record(s), except that if an enforcement action is commenced, all payroll records shall be retained until the enforcement",
        "proceeding is completed through the procedures set forth in 20 CFR part 655, Subpart I.  For a complete list of documents that",
        "must be retained and/or made available for public access,  see 20 CFR 655.760.",
        "Section A ",
        "Employment -Based Nonimmigrant Visa Information ",
        "1.Enter one of the following classification symbols to indicate the type of visa supported by this application:  “H-1B,” “H-1B1",
        "Chile,” “H-1B1 Singapore,” or “E-3 Australia.”   Select only one visa classification for all nonimmigrant workers employed",
        "pursuant to the LCA.  When filing this application electronically, the iCERT System will provide a dropdown of the",
        "acceptable visa classification symbols.",
        "The H",
        "-1B visa allows an employer to temporarily employ foreign professional workers   in the U.S. on a nonimmigrant basis",
        "in a specialty occupation or as a fashion model of distinguished merit and ability.  Under 20 CFR 655.715, a specialty",
        "occupation requires the theoretical and practical application of a body of specialized knowledge and a bachelor's degree",
        "or the equivalent in the specific specialty (e.g., sciences, medicine and health care, education, biotechnology, business",
        "specialties, etc.).",
        "The H",
        "-1B1-Chile visa allows an employer to temporarily employ business professionals who are nationals of Chile under the",
        "Chile Free Trade Agreement.",
        "The H",
        "-1B1-Singapore visa allows an employer to temporarily employ business professionals who are nationals of Singapore",
        "under the Singapore Free Trade Agreement.",
        "The E-3",
        " Australia visa allows an employer to temporarily employ business professionals who are nationals of Australia",
        "under Title V of the REAL ID Act of 2005 (Division B) in the Emergency Supplemental Appropriations Act for Defense, the",
        "Global War on Terror, and Tsunami Relief, 2005.",
        "Section B ",
        "Temporary Need Information ",
        "1.Ent",
        "er the title of the job opportunity for which the LCA is being sought.  The employer’s internal job title should be entered",
        "in this field.",
        "Note:  The job title must be the same for all nonimmigrant workers working on a single LCA.  The employer may file",
        "additional LCAs as needed.",
        "2.Enter the six-digit Standard Occupational Classification (SOC)/Occupational Network (O*NET) code for the occupation,",
        "which most clearly describes the work to be performed.  For example, the six-digit SOC code for a Computer Systems",
        "Analyst is 15-1121.",
        "Note:  More information on SOC codes can be found at http://www.bls.gov/soc/",
        ".",
        "3.Enter the occupational title associated with the SOC/O*NET code.  For example, the occupational title associated with",
        "SOC/O*NET code 15-1121 is Computer Systems Analyst.",
        "",
        "OMB Control No.: 1205-0310  ",
        "Expiration Date:  10/31/2021 ",
        "Labor Condition Application for H-1B, H-1B1 and E-3 Nonimmigrant Workers ",
        "Form ETA-9035CP –General Instructions for the 9035 & 9035E ",
        "U.S. Department of Labor",
        " ",
        "Page 3   of 13 ",
        "4.Indicate whether the position is full-time by marking “Yes” or “No.”  Although there is no regulatory definition for full-time",
        "employment for the H-1B, H-1B1,  and E-3 programs, the Department generally considers 35 hours per week or more to",
        "be full-time.",
        "Note:  If the position is part-time (less than 35 hours per week), the foreign worker(s) supported by the LCA must not",
        "regularly work more than the number of hours indicated (which may be a range of hours) on the United States Citizenship",
        "and Immigration Services (USCIS) Form(s) I-129 filed for the nonimmigrant(s).",
        "All foreign worker(s) under the LCA must be part-time if   Item B.4 is marked “No”; all nonimmigrant worker(s) must be full-",
        "time if Item B.4 is marked “Yes.”  If the employer has both full-time and part-time nonimmigrant worker(s), then separate",
        "LCAs must be filed.",
        "5.Enter the beginning date of the nonimmigrant worker’s (workers’) period of employment.  The beginning date of",
        "employment cannot be more than 6 months from the date the LCA is submitted to the Department for processing.  The",
        "beginning date of employment also cannot be prior to the date the LCA is submitted for processing.  Use a month/day/full",
        "year (MM/DD/YYYY) format.",
        "6.Enter the end date for the nonimmigrant worker’s  (workers’) period of employment.  The end date of employment cannot",
        "be more than three (3) years after the start date for H-1B LCAs and initial H-1B1 LCAs.  The end date employment for E-3",
        "LCAs and H-1B1 extensions cannot be more than two (2) years after the start date.  Use a month/day/full year",
        "(MM/DD/YYYY) format.",
        "7.Th",
        "is    collection item contains two parts.",
        "F",
        "irst, enter the total unique number of worker positions being requested for certification.  This    total cannot be “0” (zero).",
        "For this total, count each worker once.",
        "Second, use collection Items B.7(a) through (f) to enter the number of foreign workers in each applicable USCIS-defined",
        "category under which the employer plans   to file various Form I-129s for the foreign workers.  The total worker positions",
        "requested for certification must be less than or equal to the sum total of the numbers entered in collection Items (a)",
        "through (f).  Every box MUST be filled and a single worker may fit into multiple boxes, as appropriate.",
        "Note:  If the employer does not plan to request nonimmigrant worker(s) in a particular category in Items (a) through (f),",
        "please enter “0” (zero), as appropriate.  If an individual nonimmigrant worker fits into more than one category, indicate that",
        "in Items (a) through (f).",
        "Section C ",
        "Employer Information ",
        "1.E",
        "nter th",
        "e full legal name of the business, person, association, firm, corporation, or organization, i.e., the employer filing",
        "this application.  The employer’s full legal name is the exact name of the individual, corporation, LLC, partnership, or other",
        "organization that is reported to the Internal Revenue Service (IRS).",
        "2.E",
        "nter the full trade name or “Doing Business As” (DBA) name, if applicable, of the business, person, association, firm,",
        "corporation, or organization, i.e., the employer filing this application.",
        "3.E",
        "nter the street address of the employer’s principal place of business.",
        "4.I",
        "f additional space is needed for the street address, use this line to complete the employer’s street address.",
        "5.Enter the city of the employer’s principal place of business.  If the city and country are the same, the name must still be",
        "entered in both fields.",
        "6.Enter the State of the employer’s principal place of business.",
        "7.Enter the postal (zip) code of the employer’s principal place of business.",
        "",
        "OMB Control No.: 1205-0310  ",
        "Expiration Date:  10/31/2021 ",
        "Labor Condition Application for H-1B, H-1B1 and E-3 Nonimmigrant Workers ",
        "Form ETA-9035CP –General Instructions for the 9035 & 9035E ",
        "U.S. Department of Labor",
        " ",
        "Page 4   of 13 ",
        "8.Enter the country of the employer’s principal place of business.  If the city and country are the same, the name must still",
        "be entered in both fields.",
        "Note:  This entry is for a country, not a county.",
        "9.Enter the employer’s province, if applicable.",
        "10.E",
        "nter the area code and telephone number for the employer’s principal place of business.  Include country code, if",
        "applicable.",
        "11.Enter the extension of the telephone number for the employer’s principal place of business, if applicable.",
        "12.Enter the nine-digit Federal Employer Identification Number (FEIN) as assigned by the IRS.  Do not enter a social",
        "security number.",
        "Note :   All employers, including private households, MUST obtain an FEIN from the IRS before completing this application.",
        "Information on obtaining an FEIN can be found at www.IRS.gov.",
        "13.Enter the four to six-digit North American Industry Classification System (NAICS) code that best describes the employer’s",
        "business, not the nonimmigrant worker’s job.  A listing of NAICS codes can be found at",
        "http://www.census.gov/epcd/www/naics.html",
        ".",
        "Se",
        "ction D ",
        "Employer Point of Contact Information ",
        "A",
        "n employer point of contact is an employee of the employer whose position authorizes the employee to provide information and ",
        "supporting documentation concerning this LCA for nonimmigrant workers and to communicate with the Department on behalf of the ",
        "employer.  The employer point of contact should be the individual most familiar with the content of this application and circumstances ",
        "of the nonimmigrant worker’s ( workers’) employment. ",
        "Note:  The employer point of contact information in this Section, specifically the name, telephone number, and email address, must ",
        "be different from the attorney/agent information listed in Section E, unless the attorney is an employee of the employer.   ",
        "1.Enter the last (family) name of the employer point of contact.",
        "2.Enter the first (given) name of the employer point of contact.",
        "3.Enter the middle name of the employer point of contact. In the absence of a middle name, enter N/A.",
        "4.E",
        "nter the job title of the employer’s point of contact.",
        "5.Enter the business street address of the employer point of contact.",
        "6.If additional space is needed for the street address, use this line to complete the street address.",
        "7.Ente",
        "r the city of the employer point of contact.  If the city and country are the same, the name must still be entered in both",
        "fields.",
        "8.Enter the state of the employer point of contact.",
        "9.Enter t",
        "he postal (zip) code of the employer point of contact.",
        "10.Enter the country of the employer point of contact.  If the city and country are the same, the name must still be entered in",
        "both fields.",
        "11.Enter the province of the employer point of contact, if applicable.",
        "",
        "OMB Control No.: 1205-0310  ",
        "Expiration Date:  10/31/2021  ",
        "Labor Condition Application for H-1B, H-1B1 and E-3 Nonimmigrant Workers ",
        "Form ETA-9035CP –General Instructions for the 9035 & 9035E ",
        "U.S. Department of Labor",
        " ",
        "Page 5   of 13 ",
        "12.Enter the area code and business telephone number of the employer point of contact.  Include country code, if applicable.",
        "13.E",
        "nter the extension of the telephone number of the employer point of contact, if applicable.",
        "14.Enter the bu",
        " format.",
        "siness   e-mail address of the employer point of contact.  Use a name@emailaddress.top-leveldomain",
        "Section E ",
        "Attorney or Agent Information (if applicable) ",
        "Note:  The information provided in this Section, specifically the name, telephone number, and e-mail address, must be different from the ",
        "employer’s point of contact information in Section D, unless the attorney is an employee of the employer.  The employer authorizes the ",
        "att",
        "orney or agent identified in this section to act on its behalf in connection with the filing of this application. ",
        "1.Identify whether the employer is represented by an attorney or agent in the process of filing this application.  Only mark",
        "one box.  If “Yes” complete the remainder of Section E.  If “No” in question 1, skip 2 through 19 and continue to Section F.",
        "2.Enter the last (family) name of the attorney/agent.",
        "3.Enter the first (given) name of the attorney/agent.",
        "4.Enter the middle name of the attorney/agent, if a middle name exists.",
        "5.Enter the street address of the attorney/agent.",
        "6.If additional space is needed for the street address, use this line to complete the attorney/agent’s street address.",
        "7.Enter the city of the attorney/agent.  If the city and country are the same, the name must still be entered in both fields.",
        "8.Enter the state of the attorney/agent.",
        "9.Enter the postal (zip) code of the attorney/agent.",
        "10.Enter the country of the attorney/agent.  If the city and country are the same, the name must still be entered in both fields.",
        "11.E",
        "nter the province of the attorney/agent, if applicable.",
        "12.E",
        "nter the area code and telephone number of the attorney/agent.  Include country code, if applicable.",
        "13.Enter the extension of the telephone number of the attorney/agent, if applicable.",
        "14.Enter the business e-  mail address of the attorney/agent.  Use a name@emailaddress.top-leveldomain",
        " format.",
        "15.Enter the attorney/agent’s law firm or business name.",
        "16.Enter the attorney/agent's law firm or business nine-digit FEIN as assigned by the IRS.  Do not enter a social security",
        "number.",
        "17.E",
        "nter the attorney's State Bar number.  If the attorney is licensed in more than one State, enter only one State Bar",
        "number.  If the attorney is licensed in a state which does not issue State Bar numbers, enter “N/A”.",
        "Note:  The answers to questions 18 and 19 below should correspond to the same state for which a Bar number was",
        "provided in question 17, if any.",
        "18.E",
        "nter the State of the highest court where the attorney is in good standing.",
        "19.E",
        "nter the name of the highest State court where attorney is in good standing.",
        "",
        "OMB Control No.: 1205-0310  ",
        "Expiration Date:  10/31/2021  ",
        "Labor Condition Application for H-1B, H-1B1 and E-3 Nonimmigrant Workers ",
        "Form ETA-9035CP –General Instructions for the 9035 & 9035E ",
        "U.S. Department of Labor",
        " ",
        "Page 6   of 13 ",
        "Section F  ",
        "Employment and Wage Information ",
        "Note:  In accordance with 20 CFR 655.730(c)(4), the employer must specify, among other requirements, the gross wage rate to be ",
        "paid to each nonimmigrant, the prevailing wage for the occupation in the area of intended employment and the specific source relied ",
        "upon to determine the prevailing wage, and the intended place(s) of employment.  The employer must define the intended place(s) of ",
        "employment with as much geographic specificity as possible.  Each place of employment listed below must be the worksite or ",
        "physical location where the work will actually be performed and cannot be a P.O. Box.   ",
        "In accordance with 20 CFR 655.730(c)(5), the employer must identify all intended places of employment on the LCA, including ",
        "intended places of employment which qualify as short-term placements under 20 CFR 655.735.  A place of employment means the ",
        "worksite or physical location where the work actually is performed by the H-1B, H-1B1, or E-3 nonimmigrant.  See 20 CFR 655.715.  ",
        "A worksite location must be identified as an “intended place of employment” if the employer knows at the time of filing the LCA that it ",
        "will place workers at the worksite, or should reasonably expect that it will place workers at the worksite based on: (1) an existing ",
        "contract with a secondary employer or client, (2) past business experience, or (3) future business plans.  The Department’s electronic ",
        "filing system will accept up to ten (10) physical locations with wage information and additional LCAs must be filed for any additional ",
        "intended places of employment.  If the employer is filing non-electronically and the employer intends that the work will be performed ",
        "in more than one location, an attachment must be submitted in order to complete this section.  If the employer has more than ten (10) ",
        "intended places of employment at the time of filing this application, the employer must file as many additional Form ETA-9035 forms ",
        "as are necessary to sufficiently list all intended places of employment.   ",
        "a. P",
        "lace of Employment Information 1",
        "See the definition of “place of employment” in 20 CFR 655.715. ",
        "1.From t",
        "he overall total worker positions entered in Item B.7, enter the estimated number of workers   that will perform work at this",
        "place of employment.",
        "2.F",
        "or this intended place of employment, indicate whether the employer is placing the nonimmigrant worker(s) with a secondary",
        "entity.  A secondary entity is another entity at which or with which LCA workers will be placed during the period of certification.",
        "3.If “Yes” to Item F.2, provide the legal business name of the secondary entity (e.g.,  another entity) at which or with which the",
        "nonimmigrant worker(s) will be placed.",
        "Note: The entry must include the legal business name of the secondary entity.  Any trade name or DBA name should also be",
        "entered, as space permits.",
        "4.Enter the street address of the intended place of employment.",
        "5.If additional space is needed for the street address, use this line.",
        "6.Enter the city of the intended place of employment.",
        "7.Enter the county of the intended place of employment.  If there is no county designation or it is not known, please enter",
        "“N/A”.  Note:  In the absence of a county, enter the appropriate parish or borough in this field.  Do not enter a country in",
        "this field.",
        "8.E",
        "nter the State/district/territory of intended employment.",
        "9.Enter the postal (zip) code of the intended place of employment.",
        "Wage Rate ",
        "10.Enter the wage to be paid to the nonimmigrant worker(s).  If the wage offer is expressed as a range, enter the bottom of the",
        "wage range to be paid.",
        "E",
        "nter the top of the wage range to be paid to the nonimmigrant worker(s) in the section indicating “To” (required only for",
        "employers paying a wage range).",
        "",
        "OMB Control No.: 1205-0310  ",
        "Expiration Date:  10/31/2021  ",
        "Labor Condition Application for H-1B, H-1B1 and E-3 Nonimmigrant Workers ",
        "Form ETA-9035CP –General Instructions for the 9035 & 9035E ",
        "U.S. Department of Labor",
        " ",
        "Page 7   of 13 ",
        "10a. Indicate whether the rate of pay unit is per hour, week, bi-week (every two weeks), month,  or year.  ",
        "Prevailing Wage ",
        "11.Enter the prevailing wage for the job opportunity.",
        "11a. Indicate whether prevailing wage unit is per hour, week, bi-week (every two weeks), month,  or year.  ",
        "Prevailing Wage Source ",
        "NPWC PWD ",
        "For the prevailing wage source, if the employer is using a Prevailing Wage Determination (PWD) obtained from the ",
        "Department of Labor’s National Prevailing Wage Center (NPWC) for this LCA, provide the PWD tracking number in ",
        "Item12a.  Enter the tracking number in the following format using the appropriate numerical digits from the issued ",
        "PWD:  P-xxx",
        "-xxxxx-xxxxxx. ",
        "12a. E",
        "nter the NPWC PWD tracking number.  ",
        "An",
        " Occupational Employment Statistics (OES) Prevailing Wage ",
        "Fo",
        "r the prevailing wage source, if the employer is using a Bureau of Labor Statistics OES wage obtained from the  ",
        "iCERT S",
        "ystem at http://icert.doleta.gov",
        " or the Foreign Labor Certification Online Data Center at www.flcdatacenter.com ",
        "for this LCA, complete Items 13a and 13b.    ",
        "13a. E",
        "nter OES wage level for the OES prevailing wage. ",
        "13b. Enter the year of the OES prevailing wage.  ",
        "Ex",
        "ample (For Instructional Purposes Only):   ",
        "13. ",
        "A PW obtained independently from the Occupational Employment Statistics (OES) Program ",
        "a. Wage Level §",
        "IIIIIIIVN/A",
        "b.Source Year  §",
        "2017 ",
        "Another Legitimate Source (Other than OES) or an   Independent Authoritative Source ",
        "For the prevailing wage source entry in this section, if the employer has a Collective Bargaining Agreement (CBA), Davis Bacon ",
        "Act (DBA) wage, or McNamara O’Hara Service Contract Act (SCA) wage for this LCA, complete Items 14a and 14b.    ",
        "For the prevailing wage source entry in this section, if the employer has another legitimate source or an independent ",
        "authoritative source survey for this LCA, complete Item 14a by selecting “Other/  PW Survey” and complete Items14b, 14c,  and ",
        "14d.  In accordance with 20 CFR 655.731(a)(2)(ii)(C), another legitimate source is a source which:  (1) Reflects the weighted ",
        "average wage paid to workers similarly employed in the area of intended employment; (2) Reflects the median wage of ",
        "workers similarly employed in the area of intended employment if the survey provides such a median and does not provide a ",
        "weighted average wage of workers similarly employed in the area of intended employment; (3) Is based on the most recent ",
        "and accurate information available; and (4) Is reasonable and consistent with recognized standards and principles in ",
        "producing a prevailing wage. ",
        "In accordance with 20 CFR 655.715, an independent authoritative source survey means a survey of wages conducted by an ",
        "independent authoritative source and published in a book, newspaper, periodical, loose-leaf service, newsletter, or other ",
        "similar medium, within the 24-month period immediately preceding the filing of the employer's application.  Such survey shall: ",
        "(1) Reflect the average wage paid to workers similarly employed in the area of intended employment; (2) Be based upon",
        "recently collected data—e.g., within the 24-month period immediately preceding the date of publication of the survey; and (3)",
        "Represent the latest published prevailing wage finding by the authoritative source for the occupation in the area of intended",
        "employment.  An independent authoritative source means a professional, business, trade, educational or governmental",
        "",
        "OMB Control No.: 1205-0310  ",
        "Expiration Date:  10/31/2021  ",
        "Labor Condition Application for H-1B, H-1B1 and E-3 Nonimmigrant Workers ",
        "Form ETA-9035CP –General Instructions for the 9035 & 9035E ",
        "U.S. Department of Labor",
        " ",
        "Page 8   of 13 ",
        "association, organization, or other similar entity, not owned or controlled by the employer, which has recognized expertise in ",
        "an occupational field. ",
        "14a. Indicate the prevailing wage source type. ",
        "14b. Enter the year of the prevailing wage source.  For unpublished surveys issued to or produced for the employer, enter the ",
        "year.  ",
        "14c. For a prevailing wage survey, enter the survey producer or publisher (e.g.,  survey company name).   ",
        "14d. For a prevailing wage survey, enter the title or source of the prevailing wage survey (e.g.,  name of the survey instrument). ",
        "14 ",
        "A PW obtained using another legitimate source (other than OES) or an independent authoritative source ",
        "a. Source Type (check one): §",
        "CBADBASCA       Other PW Survey",
        "b.Source Year §",
        "2017 ",
        "c.  If responded “Other/PW Survey” in question 14.a, enter the name of the survey producer or publisher §",
        "XYZ Survey Publisher ",
        "d.  If responded \"Other PW Survey\" in question 14.a, enter the title or source of the PW survey §",
        "Survey of Computer Systems Analysts ",
        "Section G ",
        "Employer Labor Condition Statements ",
        "The employer must read and agree to statements (1) through (4) below and demonstrate that agreement by marking “Yes” ",
        "to Item 1 in Section G of the Form ETA-9035/9035E and by signing the application.  The employer agrees to develop and ",
        "maintain documentation supporting labor condition statements (1) through (4) as specified in 20 CFR 655.731 through ",
        "655.734, and to make this documentation available to Department of Labor officials upon request.  The employer is required ",
        "to make available for public examination a copy of the LCA and necessary supporting documentation as specified in 20 ",
        "CFR 655.760 within one (1) working day after the date on which the application has been filed with the Department of Labor.  ",
        "This documentation must be retained for public examination at the place of employment or the employer’s principal place of ",
        "business as specified in Section I of this form. ",
        "(1)Wages:  The employer attests that H-1B, H-1B1, or E-3 nonimmigrant workers will be paid wages which are at least the higher of",
        "the actual wage level paid by the employer to all other individuals with similar experience and qualifications for the specific",
        "employment in question or the prevailing wage level for occupational classification in the area of intended employment.  By",
        "marking “Yes” to Item 1 of Section G, the employer also attests that it will pay these nonimmigrant workers the required wage for",
        "time in nonproductive status due to a decision of the employer or due to the nonimmigrant worker’s lack of a permit or license.",
        "The employer further attests that these nonimmigrant workers will be offered benefits and eligibility for benefits on the same",
        "basis, and in accordance with the same criteria, as offered to U.S. workers.  The employer shall not make deductions to recoup a",
        "business expense(s) of the employer,  including attorney fees and other costs connected to the performance of H-1B, H-1B1, or",
        "E-3 program functions, which are required to be performed by the employer.  This includes expenses related to the preparation",
        "and filing of this LCA and related visa petition information. See 20 CFR 655.731.",
        "(2)Working Conditions:  The employer attests that the employment of H-1B, H-1B1 or E-3 nonimmigrant workers in the named",
        "occupation will not adversely affect the working conditions of similarly employed U.S. workers.  The employer further attests that",
        "nonimmigrant workers will be afforded working conditions on the same basis,  and in accordance with the same criteria, as",
        "offered to U.S. workers.  See 20 CFR 655.732.",
        "(3)St",
        "rike, Lockout, or Work Stoppage:  The employer attests that on the date the application is signed and submitted, there is not",
        "a strike, lockout, or work stoppage in the course of a labor dispute in the occupational classification in the area of intended",
        "employment and that, if such a strike, lockout, or work stoppage occurs after the application is submitted, the employer will notify",
        "the Employment & Training Administration (ETA) within three (3) days of such occurrence; in that event, the application will not",
        "",
        "OMB Control No.: 1205-0310  ",
        "Expiration Date:  10/31/2021  ",
        "Labor Condition Application for H-1B, H-1B1 and E-3 Nonimmigrant Workers ",
        "Form ETA-9035CP –General Instructions for the 9035 & 9035E ",
        "U.S. Department of Labor",
        " ",
        "Page 9   of 13 ",
        "be used in support of a petition filing with the USCIS for H-1B, H-1B1, or E-3 nonimmigrant workers to work in the same ",
        "occupation at the place of the employment until ETA determines the strike lockout or work stoppage has ceased.  See 20 CFR ",
        "655.733. ",
        "(4)Notice:  The employer attests that notice of the LCA filing was provided no more than 30 days before filing of this LCA or will",
        "be provided on",
        " the day this LCA is filed to workers employed in t",
        "he occupational classification.  Notice of the application shall",
        "be provided to workers through the bargaining representative, or where there is no such bargaining representative, notice of",
        "the filing shall be provided either through physical posting in conspicuous locations where H-1B, H-1B1, or E-3 nonimmigrant",
        "workers will be employed, or through electronic notification to employees in the occupational classification for which",
        "nonimmigrant workers are sought.  Notice shall be provided no more than 30 days before the date the LCA is filed and no later",
        "than the day the LCA is filed and remain posted for 10 days, except that if employees are provided individual, direct notice by",
        "e-mail, notification need only be given once.  Notice documentation shall be maintained in the employer’s records.",
        "Notice shall be made in accordance with the requirements of 20 CFR 655.734 and contain the following statement:",
        "“Complaints alleging misrepresentation of material facts in the labor condition application and/or failure to comply with the",
        "terms of the labor condition application may be filed with any office of the Wage and Hour Division of the United States",
        "Department of Labor.”  The WH-4 complaint form and a listing of Wage and Hour Division offices can be obtained at",
        "www.dol.gov/whd.  In addition,  if the employer is an H-1B dependent employer or a willful violator, and the LCA is not being",
        "used only for exempt H-1B n",
        "onimmigrant workers, the notice shall be made in accordance with the requirements of 20 CFR",
        "655.734 and shall contain the following statement:  “Complaints alleging failure to offer employment to an equally or better",
        "qualified U.S. applicant or an employer’s misrepresentation regarding such offers of employment may be filed with U.S.",
        "Department of Justice, Civil Rights Division, Immigrant and Employee Rights Section, 950 Pennsylvania Avenue, NW # IER,",
        "NYA 9000, Washington, DC, 20530, Telephone: 1(800) 255-8155 (employers); 1(800) 255-7688 (employees); Internet",
        "address: http://www.justice.gov .”  See 20 CFR 655.734 and 655.760.",
        "The employer further attests that each nonimmigrant worker employed pursuant to the application will be provided with a copy",
        "(or original, as appropriate) of the certified Form ETA-9035E, or Form ETA-9035 (if a",
        "pplicable).  As stated above for H-1B,",
        "H-1B1, or E-3 nonimmigrant workers, the employer must provide the certified LCA to the nonimmigrant worker, who must",
        "follow the H-1B, H-1B1, or E-3 procedures of USCIS and the Department of State.  The notification shall be provided no later",
        "than the date the nonimmigrant reports to work at the place of employment.  See 20 CFR 655.734.",
        "1.Indicate whether the employer has read and agrees to the labor condition statements (1) through (4) above, regarding wages,",
        "working ",
        "conditions, strike, lockout or work stoppage, and notice.  The employer must agree to all four labor condition statements",
        "listed as (1) to (4).  Please note that marking “Yes” indicates that the employer has read and agrees to the a",
        "bove-listed",
        "labor condition statements.",
        "I- ",
        "Section H",
        "Additional Employer Labor Condition Statements – This section is to be completed by H-1B Employers ONLY ",
        "All H-1B employer",
        "s are required to complete Section H in order for an LCA to be processed.  See 20 CFR 655.736 for more detailed ",
        "guidance as to what constitutes an “H-1B dependent employer” or a “willful violator.” ",
        "a. Subsec",
        "tion 1",
        "Note:   The determi",
        "nation of whether an employer is H-1B dependent is based on the ratio between the employer’s total workforce",
        "employed in the U.S., as measured according to full-time equivalent employees, and the employer’s H-1B nonimmigrant employees",
        "including both full-time and part-time H-1B employees.  See 20 CFR 655.736.  The following table can be used to determine whether",
        "the employer is an H-1B dependent employer:",
        "TOTAL WORKFORCE EMPLOYED IN THE U.S. ",
        "(FULL-TIME EQUIVALENT EMPLOYEES) ",
        "TOTAL H-1B NONIMMIGRANT ",
        "EMPLOYEES ",
        "1 to 25 8 or more ",
        "26 to 50 13 or more ",
        "51 or more ",
        "15% or more of the employer’s total ",
        "workforce employed in the U.S. ",
        "",
        "OMB Control No.: 1205-0310  ",
        "Expiration Date:  10/31/2021  ",
        "Labor Condition Application for H-1B, H-1B1 and E-3 Nonimmigrant Workers ",
        "Form ETA-9035CP –General Instructions for the 9035 & 9035E ",
        "U.S. Department of Labor",
        " ",
        "Page 10 of 13 ",
        "1.Indicate whether the employer is H-1B dependent at the time of filing. The employer is H-1B dependent if  the number of",
        "H-1B nonimmigrant workers employed by the employer as a proportion of the total number of full-time equivalent",
        "employees employed in the United States matches the chart above.",
        "If an employer marks “No” and is or becomes H-1B dependent, the submitted LCA must not be used in support ",
        "of a new petition or extension of a petition for an H-1B nonimmigrant worker.  By marking “No,” the employer ",
        "also acknowledges that if it uses this application to support a new petition or extension of a petition despite its ",
        "invalidity, it is required to comply with the Additional Employer Labor Condition Statements in Subsection 2 of ",
        "Section H. ",
        "2.Indicate whether the employer is a willful violator at the time of filing.  The employer is a willful violator if the employer has",
        "been found during the five (5) years preceding the date of the application (and after October 20, 1998) to have committed",
        "a willful violation or a misrepresentation of a material fact.",
        "If an employer marks “No” and is found, prior to the date of filing, to have committed a willful violation or a",
        "misrepresentation, the submitted LCA must not be used in support of a new petition or extension of a petition for an H-",
        "1B nonimmigrant worker.  By marking “No,” the employer also acknowledges that if it uses this application to support a",
        "new petition or extension of a petition despite its invalidity, it is required to comply with the Additional Employer Labor",
        "Condition Statements in Subsection 2 of Section H.",
        "3.If Yes",
        " to Item H.1 and/or Item H.2, indicate whether the employer intends to use this application ONLY to",
        "support H-1B petitions or extensions of status for H-1B nonimmigrant workers who are exempt, i.e., receive",
        "wages at a rate equal to at least $60,000 per year, or have attained a Master’s degree (or equivalent or higher degree) in",
        "a specialty related to the employment.  The employer also agrees to maintain documentation required by 20 CFR",
        "655.737.  If an employer marks “Yes,” the employer acknowledges that if it uses this application in support of a",
        "petition or extension of a petition of an H-1B nonimmigrant who is not exempt, it is required to comply with the",
        "Additional Employer Labor Condition Statements in Subsection 2 of Section H    with respect to all H-1B",
        "nonimmigrant workers supported by this application.",
        "4.If the emp",
        "loyer responded “Yes” to an exemption in Item H.3, indicate the basis (or bases) of the exemption.  Check a box for",
        "either $60,000 or higher annual wage, or Master’s Degree or higher in related specialty, or the box for “Both” if both exemptions",
        "are applicable.  All workers subject to the LCA must meet the exemption(s) claimed.",
        "5.I",
        "f the employer marked “Master’s Degree or higher in related specialty” in Item H.4, indicate by marking “Yes or No” whether the",
        "employer has completed and attached Appendix A to this LCA.  Instructions for completing Appendix A can be found at the end",
        "of this document.",
        "If",
        " the employer is seeking an exemption solely based on the H-1B nonimmigrant worker(s) receiving wages at an annual rate",
        "equal to at least $60,000 or higher, then mark “N/A”.",
        "b.",
        "Subsection 2",
        "Al",
        "l employers that are (1) H-1B dependent (as defined above) and/or (2) have been found to have committed a willful violation or a ",
        "misrepresentation of a material fact during the five (5) year period preceding the date of this application, must read and agree to ",
        "statements (A) through (C) and demonstrate that agreement by marking “Yes” in Subsection 2 of Section H of this ",
        "application.  The employer agrees to develop and maintain documentation supporting labor condition statements (A) through (C) as ",
        "specified in 20 CFR 655.738 and 655.739, and to make this document available to Department officials upon request.  The employer ",
        "is required to make available for public examination a copy of the LCA and necessary supporting documentation as specified in 20 ",
        "CFR 655.760 within one (1) working day after the date on which the application has been filed with the Department.  This ",
        "documentation must be retained for public examination at the place of employment in the U.S. and/or the employer’s principal place ",
        "of business in the U.S. as specified in Section I of this form.  The employer agrees: ",
        "A.  Di",
        "splacement:  The employer will not displace any similarly employed U.S. worker in an essentially equivalent job in",
        "its own workforce within the period beginning 90 days before and ending 90 days after the date of filing a petition for",
        "an H-1B nonimmigrant worker supported by this application.",
        "",
        "OMB Control No.: 1205-0310  ",
        "Expiration Date:  10/31/2021  ",
        "Labor Condition Application for H-1B, H-1B1 and E-3 Nonimmigrant Workers ",
        "Form ETA-9035CP –General Instructions for the 9035 & 9035E ",
        "U.S. Department of Labor",
        " ",
        "Page 11 of 13 ",
        "B.Secondary Displacement:  The employer will not place any H-1B nonimmigrant worker employed pursuant to this",
        "application at another employer’s worksite where there are indicia of an employment relationship between the",
        "nonimmigrant(s) and that other/secondary employer UNLESS the employer applicant first makes an inquiry as to ",
        "whether the other employer has displaced or intends to displace a similarly employed U.S. worker in an essentially ",
        "equivalent job  within the period beginning 90 days before and ending 90 days after the placement, and the employer ",
        "applicant has no contrary knowledge.  ",
        "If  the other employer displaces a similarly employed U.S. worker during such period, the displacement will ",
        "constitute a failure to comply with the terms of the LCA and the employer applicant may be subject to civil ",
        "money penalties and debarment.  See 20 CFR 655.738. ",
        "C.Recruitment and Hiring:  Prior to filing any petition for an H-1B nonimmigrant worker pursuant to this application, the",
        "employer took or will take good faith steps meeting industry-wide standards to recruit U.S. workers for the job for",
        "which the nonimmigrant is sought, offering compensation at least as great as required to be offered to the H-1B ",
        "nonimmigrant.  The employer will (has) offer(ed) the job to any U.S. worker who (has) applied and is equally or better ",
        "qualified than the H-1B nonimmigrant worker. ",
        "Under the Immigration and Nationality Act (INA) Section 212 (n)(1)(G)(ii), 8 U.S.C. 1182, the “recruitment and hiring” ",
        "labor condition statement does not apply to the employment of an H-1B nonimmigrant worker who is a \"priority ",
        "worker\" (defined as a person with extraordinary ability, or outstanding professors or researchers, or certain multi-",
        "national executives or managers) within the meaning of Section 203 (b)(1)(A), (B), or (C) of the INA, 8 U.S.C. 1153. ",
        "6.Indicate whether the employer has read and agrees to the additional employer labor conditions statements in Subsection 2(A)",
        "through (C).  The employer must agree to all three labor condition statements of Section H, subsection 2.  Answer this question",
        "only if the employer  marked “Yes” to either or both questions in Item H.1   or  Item H.2  (indicating that the employer is either an",
        "H-1B  dependent employer or a willful violator,  or both) and, also, the employer marked “No” to the question in Item H.3 (“No” to",
        "exempt H-1B nonimmigrant workers).",
        "Sec",
        "tion I ",
        "Public Disclosure Information ",
        "1.Indicate whether the employer’s required public disclosure information will be located at the employer’s principal place of",
        "business in the U.S. AND/OR the place of employment in the U.S.  The employer may select more than one box.",
        "If",
        " the employer elects to store the public access file electronically, the employer must make the file available and accessible for ",
        "government or public inspection upon request, at the particular location(s) provided in Section I of the Form ETA-9035/9035E.  ",
        "Section J ",
        "Notice of Obligations ",
        "Note: If the employer is submitting this form non-electronically, the employer must sign and date the application prior to submission. ",
        "If submitting this form electronically, the employer must sign and date the application immediately upon receipt of the certified ",
        "application and before submission to USCIS.     ",
        "Item",
        "s   J.    (A) through (C).  Read this Section. ",
        "1.Enter the last (family) name of the person with authority to sign as the employer.",
        "2.Enter the first (given) name of the person with authority to sign as the employer.",
        "3.  Enter the middle name of the person with authority to sign as the employer, if applicable.",
        "4.Enter the job title of the person with authority to sign as the employer.",
        "5.T",
        "he person with authority to sign as the employer must sign the application.  Read the entire application and verify all",
        "contained information prior to signing.",
        "",
        "OMB Control No.: 1205-0310  ",
        "Expiration Date:  10/31/2021  ",
        "Labor Condition Application for H-1B, H-1B1 and E-3 Nonimmigrant Workers ",
        "Form ETA-9035CP –General Instructions for the 9035 & 9035E ",
        "U.S. Department of Labor",
        " ",
        "Page 12 of 13 ",
        "For paper filings, the application should be signed prior to submission to the Department.  For electronic ",
        "submissions, the employer will sign and date the LCA after receiving certification from the Department.  ",
        "6.The person with authority to sign as the employer must date the application.  Use a month/day/full year (MM/DD/YYYY) format.",
        "Section K ",
        "LCA Preparer ",
        "Thi",
        "s section must be completed if the preparer of this LCA is a person other than the one identified in either Section D (employer ",
        "point of contact) or E (attorney or agent) of this application.  For example, an employee of the attorney (e.g., paralegal) would ",
        "complete the LCA preparer s ection.  If the employer or attorney/agent contact listed in section D or section E was the person ",
        "preparing and submitting the LCA, then this section will be left blank.   ",
        "1.Enter the last (family) name of the person preparing this LCA by or on behalf of the employer.",
        "2.Enter the first (given) name of the person preparing this LCA by or on behalf of the employer.",
        "3.Enter",
        " the middle name of the person preparing this LCA by or on behalf of the employer, if a middle name exists.",
        "4.Enter the Firm/Business name of the person preparing this LCA by or on behalf of the employer.",
        "5.Enter the e-mail address of the person preparing this LCA by or on behalf of the employer.   The entry must be in the format",
        "name@emailaddress.top-level",
        " domain.",
        "Section L ",
        "U.S. Government Agency User ONLY ",
        "Read this section.  No entries required. ",
        "Section M ",
        "Signature Notification and Complaints ",
        "Read this section.  No entries required.   ",
        "Section N ",
        "OMB Paperwork Reduction Act (1205-0310) ",
        "Read this section.  No entries required. ",
        "Form ETA-9035/9035E Appendix A ",
        "H.5. Attainment of Educational Degree for “Exempt” H-1B Nonimmigrants",
        "H-1",
        "B Dependent Employers or Willful Violator Employers ONLY - For Master’s or Higher Degree Exemptions ONLY",
        "For the LCA that you are filing, all workers subject to the LCA must meet the same exemption(s) claimed in Section H.  ",
        "You must complete and attach Appendix A with documentation for any H-1B nonimmigrant worker subject to the application if ",
        "the statutory exemption for that worker:   ",
        "•Will be based only on the Master’s or higher degree exemption.",
        "Do NOT complete and attach Appendix A with documentation for an H-1B nonimmigrant worker subject to the ",
        "application if the statutory exemption for that worker:   ",
        "•Will ",
        "be based on the $60,000 annual wage exemption; or",
        "",
        "OMB Control No.: 1205-0310  ",
        "Expiration Date:  10/31/2021  ",
        "Labor Condition Application for H-1B, H-1B1 and E-3 Nonimmigrant Workers ",
        "Form ETA-9035CP –General Instructions for the 9035 & 9035E ",
        "U.S. Department of Labor",
        " ",
        "Page 13 of 13 ",
        "•Will be based on both exemptions (i.e. both the Master’s or higher degree and the $60,000 annual wage).",
        "Pursuant to 20 CFR 655.738 and 655.739, an employer that is H-1B dependent or a willful violator is generally subject to the ",
        "attestation obligations regarding displacement and recruitment of U.S. workers.  However, these additional statutory obligations do ",
        "not apply to an employer where the LCA is used only for the employment of “exempt” H-1B nonimmigrant worker(s), as described in ",
        "20 CFR 655.737, who either (1) receives wages (including cash bonuses and similar compensation) at an annual rate equal to at ",
        "least $60,000; or (2) attains   a master’s or higher degree (or its equivalent) in a specialty related to the intended employment. ",
        "For purposes of claiming the exemption, “ master's or higher degree (or its equivalent)” means a foreign academic degree from an ",
        "institution which is accredited or recognized under the law of the country where the degree was obtained, and which is equivalent to a ",
        "master's or higher degree issued by a U.S. academic institution. The equivalence to a U.S. academic degree cannot be established ",
        "through experience or through demonstration of expertise in the academic specialty (i.e., no “time equivalency” or “performance ",
        "equivalency” will be recognized as substituting for a degree issued by an academic institution). 20 CFR 655.737(d)(1). ",
        "A “specialty related to the intended employment” means that the academic degree is in a specialty which is generally accepted in the ",
        "industry or occupation as an appropriate or necessary credential or skill for the person who undertakes the employment in question. ",
        "A “specialty” which is not generally accepted as appropriate or necessary to the employment would not be considered to be ",
        "sufficiently “related” to afford the H-1B nonimmigrant status as an “exempt” H-1B nonimmigrant.  20 CFR 655.737(d)(2). ",
        "Where the employer has designated that the LCA will be used to support H-1B petition(s) and/or request(s) for extension of status for ",
        "“exempt” H-1B nonimmigrant workers based on attainment of a master’s or higher degree (or its equivalent) in a specialty related to ",
        "the intended employment, the employer must fully complete and submit the Form ETA-9035, Appendix A.  The employer must ",
        "disclose the educational attainment information for all “exempt” H-1B nonimmigrant workers who will be employed under the LCA for ",
        "which the employer is claiming the exemption because the worker has a “master's or higher degree (or its equivalent).”  Where ",
        "multiple H-1B nonimmigrant workers attained the same degree in the same field of study from the same institution on the same date, ",
        "the employer is only required to disclose the educational attainment information once on the Form ETA-9035, Appendix A.  Because ",
        "each of the initial five (5) educational attainment information sections is identical, the instructions for completing the collection ",
        "elements are only described one time below.  Each field within the educational attainment information section must be completed. ",
        "NOTE:   If the employer will claim the exemption for workers with a “master’s or higher degree or higher (or its equivalent)” for more ",
        "than five (5) workers with different educational attainment information, the employer must report as many additional sections of ",
        "educational attainment information as are necessary to cover all “exempt” H-1B nonimmigrant workers who will be employed under ",
        "the LCA. ",
        "a.Educational Attainment Information 1",
        "1.Enter the number of H-1B nonimmigrant workers that the H-1B dependent or willful violator employer will seek exemption",
        "status based on attainment of a master’s or higher degree (or its equivalent) in a specialty related to the intended",
        "employment who attended the same institution with the same field of study and date of degree.  The total number of H-1B",
        "nonimmigrant workers entered in this field must not be greater than the entry for “Total Worker Positions Being Requested",
        "for Certification” provided in Item B.7, Form ETA-9035.  Where multiple sections of educational attainment information are",
        "entered, the sum of the number of H-1B nonimmigrant workers entered in this field in each section must not be greater than",
        "the entry for “Total Worker Positions Being Requested for Certification” provided in Item B.7, Form ETA-9035.",
        "2.Ent",
        "er the full name of the accredited or recognized institution (e.g., college or university) that awarded the degree to the H-",
        "1B nonimmigrant worker(s).",
        "3.Enter the field of study in which the degree was awarded to the H-1B nonimmigrant worker(s).",
        "4.Enter the date on which the degree was awarded to the H-1B nonimmigrant worker(s) using MM/DD/YYYY format (e.g.,",
        "06/01/2017).",
        "NOTE:  The employer is required to provide documentation at the time of filing which substantiates the academic ",
        "in",
        "formation provided. The documentation is limited to the following:  a copy of the degree, a transcript, or an official letter ",
        "from the academic institution which granted the degree.  All documentation must be provided at the time of the ",
        "application’s filing for consideration with the application.  Any document in a foreign language must be accompanied by a ",
        "full and complete English language translation. "
    ]
}