{
    "content": [
        "",
        "",
        "Instructions for Petition for Nonimmigrant Worker",
        "Department of Homeland Security",
        "U.S. Citizenship and Immigration Services",
        "Form I-129 Instructions   04/01/24 Page 1 of 30",
        "USCIS",
        "Form I-129",
        "OMB No. 1615-0009",
        "Expires 02/28/2027",
        "Table of Contents  Page",
        "Instructions for Form I-129",
        "General Information",
        "The Purpose of Form I-129 .............................................................................................................................................2",
        "Who May File Form I-129?",
        " ............................................................................................................................................3",
        "General Filing Instructions",
        " ..............................................................................................................................................3",
        "Classification-Initial Evidence",
        " ........................................................................................................................................7",
        "Reduced Fees For Small Employers and Non-Profits......................................................................................................7",
        "Part 1.  Petition Always Required",
        "E-2 CNMI Classification .................................................................................................................................................8",
        "H Classifications",
        " ..............................................................................................................................................................8",
        "H-1B Data Collection",
        " ....................................................................................................................................................10",
        "L Classification",
        " ..............................................................................................................................................................17",
        "O and P Classifications",
        " ..................................................................................................................................................18",
        "Q-1 Classification",
        " ..........................................................................................................................................................22",
        "R-1 Classification",
        " ..........................................................................................................................................................23",
        "Part 2.  Petition Only Required for a Nonimmigrant in the United States to Change Status or Extend Stay",
        "E Classifications (not including E-2 CNMI) .................................................................................................................24",
        "Free Trade Nonimmigrant Classifications (H-1B1 and TNs)",
        " ........................................................................................25",
        "Filing Requirements",
        "Written Consultation for O and P Nonimmigrants ........................................................................................................27",
        "Liability for Return Transportation................................................................................................................................27",
        "When To File?",
        " ...............................................................................................................................................................27",
        "Where To File?",
        " ..............................................................................................................................................................27",
        "Additional Information",
        "Address Change.............................................................................................................................................................28",
        "Processing Information",
        " .................................................................................................................................................28",
        "USCIS Forms and Information",
        " .....................................................................................................................................28",
        "Penalties........................................................................................................................................................................ 29",
        "USCIS Compliance Review and Monitoring",
        " ................................................................................................................29",
        "DHS Privacy Act",
        " ...........................................................................................................................................................29",
        "Paperwork Reduction Act",
        " .............................................................................................................................................30",
        "Supplements to Form I-129",
        "E-1/E-2 Classification Supplement .................................................................................................................................9",
        "Trade Agreement Supplement",
        " .......................................................................................................................................11",
        "H Classification Supplement",
        " .........................................................................................................................................13",
        "H-1B and H-1B1 Data Collection and Filing Fee Exemption Supplement",
        " ..................................................................19",
        "L Classification Supplement",
        " ..........................................................................................................................................22",
        "O and P Classifications Supplement",
        " ..............................................................................................................................26",
        "Q-1 Classification Supplement",
        " ......................................................................................................................................29",
        "",
        "Form I-129 Instructions   04/01/24 Page 2 of 30",
        "R-1 Classification Supplement ......................................................................................................................................30",
        "Attachment - 1 (Used when more than one beneficiary is included on the form).........................................................35",
        "The Purpose of Form I-129",
        "This form is used by an employer to petition U.S. Citizenship and Immigration Services (USCIS) for a beneficiary to ",
        "come temporarily to the United States as a nonimmigrant to perform services or labor, or to receive training.",
        "Form I-129 consists of the: ",
        "1. Basic petition;",
        "2. Individual supplements relating to specific classifications; and",
        "3. H-1B Data Collection and Filing Fee Exemption Supplement (required for H-1B and H-1B1 classifications only).",
        "These instructions are divided into two parts: ",
        "Part 1:  Classifications that always require a petition.",
        "E-2 CNMI -- treaty investor exclusively in the Commonwealth of the Northern Mariana Islands (CNMI).",
        "H-1B -- specialty occupation worker; a beneficiary coming to perform services of an exceptional nature that relate to a  ",
        "U.S. Department of Defense-administered project; or a fashion model of distinguished merit and ability.",
        "H-2A -- temporary agricultural worker.",
        "H-2B -- temporary nonagricultural worker.",
        "H-3 -- trainee.",
        "L-1 -- intracompany transferee.",
        "O-1 -- beneficiary of extraordinary ability in arts, science, education, business, or athletics.",
        "O-2 -- accompanying beneficiary who is coming to the United States to assist in the artistic or athletic performance of ",
        "an O-1 artist or athlete.",
        "P-1 -- major league sports.",
        "P-1 -- internationally recognized athlete/entertainment group.",
        "P-1S -- essential support personnel for a P-1.",
        "P-2 -- artist/entertainer in reciprocal exchange program.",
        "P-2S -- essential support personnel for a P-2.",
        "P-3 -- artist/entertainer coming to the United States to perform, teach, or coach under a program that is culturally ",
        "unique.",
        "P-3S -- essential support personnel for a P-3.",
        "Q-1 -- international cultural exchange program participant.",
        "R-1 -- religious worker.",
        "Part 2:  Classifications that require a petition only if the beneficiary is already in the United States and requesting an ",
        "extension of stay or a change of status:",
        "E-1 -- treaty trader.",
        "E-2 -- treaty investor (not including E-2 CNMI treaty investors).",
        "E-3 -- Free Trade Agreement professionals from Australia.",
        "Free Trade Nonimmigrants -- H-1B1 specialty occupation workers from Chile or Singapore and TN professionals ",
        "from Canada or Mexico.",
        "",
        "Form I-129 Instructions   04/01/24 Page 3 of 30",
        "Who May File Form I-129?",
        "General.  A U.S. employer may file this form and applicable supplements to classify a beneficiary in any nonimmigrant ",
        "classification listed in Part 1. or Part 2. of these instructions.  A foreign employer, U.S. agent, or association of U.S. ",
        "agricultural employers may file for certain classifications as indicated in the specific instructions.",
        "Agents.   A U.S. individual or company in business as an agent may file a petition for workers who are traditionally ",
        "self-employed or workers who use agents to arrange short-term employment on their behalf with numerous employers, ",
        "and in cases where a foreign employer authorizes the agent to act on its behalf.  A petition filed by an agent must include ",
        "a complete itinerary of services or engagements, including dates, names, and addresses of the actual employers, and the ",
        "locations where the services will be performed.  A petition filed by a U.S. agent must guarantee the wages and other terms ",
        "and conditions of employment by contractual agreement with the beneficiary or beneficiaries of the petition.  The agent/",
        "employer must also provide an itinerary of definite employment and information on any other services planned for the ",
        "period of time requested.",
        "Including more than one beneficiary in a petition.  You may include on the same petition multiple beneficiaries who ",
        "seek admission in the H-2A, H-2B, H-3, P-1, P-2, P-3, P-1S, P-2S, P-3S, O-2, or Q-1 classifications if the conditions listed ",
        "below are met.  However, H-2A, H-2B, H-3, O-2, P-1, P-2, P-3, and P essential support petitions are limited to 25 named ",
        "beneficiaries per petition.",
        "All beneficiaries must:",
        "1. Be employed for the same period of time; and",
        "2. Perform the same services, receive the same training, or participate in the same international cultural exchange ",
        "program.",
        "NOTE:  Employers must file a separate Form I-129 to petition for O and P essential support personnel apart from any ",
        "petition they file for O or P principal nonimmigrants or P group or team.  All essential-support beneficiaries listed on this ",
        "petition must establish prior essentiality to the principal O or P nonimmigrants.",
        "Exception:  It is recommended that H-2A and H-2B petitions for workers from countries not listed on the respective ",
        "“Eligible Countries List” be filed separately.  See www.uscis.gov for the list of H-2A and H-2B participating countries.",
        "Multiple locations.  A petition for beneficiaries to perform services or labor or receive training in more than one location ",
        "must include an itinerary with the dates and locations where the services or training will take place.",
        "Naming beneficiaries.  All beneficiaries in a petition must be named except for an H-2A agricultural worker or an H-2B ",
        "temporary nonagricultural worker.  You may not request both named and unnamed workers on the same H-2A or H-2B ",
        "petition.",
        "Exceptions for H-2A/H-2B temporary workers:  You must provide the name, date of birth, country of birth, and country ",
        "of nationality of all H-2A and H-2B workers when (1) the petition is filed for a worker who is a national of a country ",
        "not designated by the Secretary of Homeland Security as eligible to participate in the H-2A or H-2B program; or (2) the ",
        "beneficiary is in the United States.  In addition, USCIS may require the petitioner to name H-2B beneficiaries where the ",
        "name is needed to establish eligibility for H-2B nonimmigrant status.",
        "General Filing Instructions",
        "We provide free forms through the USCIS website.  To view, print, or complete our forms, you should use the latest ",
        "version of Adobe Reader, which you can download for free at http://get.adobe.com/reader/.  If you do not have internet ",
        "access, you may call the USCIS Contact Center and ask that we mail a form to you.",
        "Each petition must be accompanied by the appropriate filing fees.",
        "Signature.  You (or your signing authority) must properly complete your petition.  USCIS will not accept a stamped or ",
        "typewritten name in place of any signature on this petition.  If you are under 14 years of age, your parent or legal guardian ",
        "may sign the petition on your behalf.  A legal guardian may also sign for a mentally incompetent person.  If your petition ",
        "is not signed, or if the signature is not valid, we will reject your petition.  See 8 CFR 103.2(a)(7)(ii)(A).  If USCIS accepts ",
        "a request for adjudication and determines that it has a deficient signature, USCIS may deny the request.",
        "",
        "Form I-129 Instructions   04/01/24 Page 4 of 30",
        "Validity of Signatures.  USCIS will consider a photocopied, faxed, or scanned copy of an original handwritten signature ",
        "as valid for filing purposes.  The photocopy, fax, or scan must be of the original document containing the handwritten ink ",
        "signature. ",
        "Evidence.  When you file your petition, you must submit all evidence and supporting documents.",
        "Biometrics Services Appointment for Certain Beneficiaries Who Will be Working in the CNMI.  After receiving your ",
        "petition and ensuring completeness, USCIS will inform you in writing when the beneficiary needs to go to his/her local ",
        "USCIS Application Support Center (ASC) for his/her biometrics services appointment.  Failure to attend the biometrics ",
        "services appointment may result in denial of your petition.",
        "Form I-94, Arrival/Departure Record.  If U.S. Customs and Border Protection (CBP) or USCIS issued the beneficiary ",
        "a Form I-94, Arrival/Departure Record, provide his/her Form I-94 number and date that his/her authorized period of stay ",
        "expires or expired (as shown on the Form I-94).  The Form I-94 number also is known as the Departure Number on some ",
        "versions of Form I-94.",
        "NOTE:  If CBP admitted the beneficiary into the United States at an airport or seaport after April 30, 2013, they may have ",
        "been issued an electronic Form I-94 instead of a paper Form I-94.  He/she may visit the CBP website at www.cbp.gov/",
        "i94 to obtain a paper version of his/her electronic Form I-94.  CBP does not charge a fee for this service.  Some travelers ",
        "may also be able to obtain a replacement Form I-94 from the CBP website for free if they were admitted to the United ",
        "States at a land border, airport, or seaport after April 30, 2013, with a passport or travel document and received a paper ",
        "Form I-94 from CBP.  If you cannot obtain your Form I-94 from the CBP website, you may obtain it by filing Form I-102, ",
        "Application for Replacement/Initial Nonimmigrant Arrival-Departure Record, with USCIS.  USCIS does charge a fee for ",
        "Form I-102.  See Form G-1055, available at www.uscis.gov/forms, for specific information about the fees applicable to ",
        "this form.",
        "Passport and Travel Document Numbers.  If you used a passport or travel document to travel to the United States, ",
        "enter the passport or travel document information in the appropriate space on the petition, even if the passport or travel ",
        "document is currently expired.",
        "Copies.  You should submit legible photocopies of requested documents unless the Instructions specifically instruct you to ",
        "submit an original document.  USCIS may request an original document at any time during our process.  If we request an ",
        "original document from you, we will return it to you after USCIS determines it no longer needs the original. ",
        "NOTE:  If you submit original documents when they are not required or requested, USCIS may destroy them after we ",
        "receive them.",
        "Translations.  If you submit a document with information in a foreign language, you must also submit a full English ",
        "translation.  The translator must sign a certification that the English language translation is complete and accurate, and that ",
        "they are competent to translate from the foreign language into English.  The certification must also include their signature, ",
        "printed name, the signature date, and their contact information.",
        "USCIS Contact Center.  For additional information on the petition and Instructions about where to file, change of ",
        "address, and other questions, visit the USCIS Contact Center at www.uscis.gov/contactcenter or call 800-375-5283 (TTY ",
        "800-767-1833).  The USCIS Contact Center provides information in English and Spanish.",
        "Disability Accommodations/Modifications.  To request a disability accommodation/modification, follow the instructions ",
        "on your appointment notice or at www.uscis.gov/accommodationsinfo.",
        "How To Complete Form I-129",
        "1. Type or print legibly in black ink.",
        "2. Complete the basic form and any relating supplements.",
        "3. If you need extra space to complete any item within this petition, use the space provided in Part 9. Additional ",
        "Information About Your Petition for Nonimmigrant Worker or attach a separate sheet of paper.  Type or print the ",
        "Alien Registration Number (A-Number) (if any) at the top of each sheet; indicate the Page Number, Part Number, ",
        "and Item Number to which your answer refers; and sign and date each sheet.",
        "",
        "Form I-129 Instructions   04/01/24 Page 5 of 30",
        "4. Answer all questions fully and accurately.  If a question does not apply to you (for example, if you have never been ",
        "married and the question asks, “Provide the name of your current spouse”), type or print “N/A” unless otherwise ",
        "directed.  If your answer to a question which requires a numeric response is zero or none (for example, “How many ",
        "children do you have” or “How many times have you departed the United States”), type or print “None” unless ",
        "otherwise directed.",
        "Petitioner Information",
        "Complete the “Legal Name of Petitioner” field (if the petitioner is an individual person or a company or organization).   ",
        "For mailing address, list the address of the petitioner’s primary office within the United States. ",
        "Basis for Classification",
        "The following explains the choices listed in Part 2., Item Number 2., of the Form I-129.",
        "A. New employment.  Check this box if the beneficiary:",
        "(1) Is outside the United States and holds no classification;",
        "(2) Will begin employment for a new U.S. employer in a different nonimmigrant classification than the beneficiary ",
        "currently holds; or",
        "(3) Will work for the same employer but in a different nonimmigrant classification.",
        "NOTE:  Do not check this box if the beneficiary will work for the same employer in the same classification but ",
        "there is a material change in the terms and conditions of employment, training, or the beneficiary’s eligibility as ",
        "specified in the original approved petition.  Check the box for Item f., Amended Petition, instead.",
        "B. Continuation of previously approved employment without change with the same employer.  Check this box ",
        "if you are applying to continue the employment of the beneficiary in the same nonimmigrant classification the ",
        "beneficiary currently holds and there has been no change to the employment.",
        "C. Change in previously approved employment.  Check this box if you are notifying USCIS of a non-material ",
        "change to the previously approved employment such as a change in job title without a material change in job ",
        "duties.",
        "D. New concurrent employment.  Check this box if you are applying for a beneficiary to begin new employment ",
        "with an additional employer in the same nonimmigrant classification the beneficiary currently holds while the ",
        "beneficiary will continue working for his or her current employer in the same classification.",
        "E. Change of employer.  Check this box if you are applying for a beneficiary to begin employment working for a ",
        "new employer in the same nonimmigrant classification that the beneficiary currently holds.",
        "F.   Amended petition.  Check this box if you are applying to notify USCIS of a material change in the terms or ",
        "conditions of employment or training or the beneficiary’s eligibility as specified in the original approved petition.  ",
        "Additionally, petitioners requesting H-2A or H-2B substitutions should check this box.",
        "Requested Action",
        "The following explains the kinds of action petitioners/employers may choose for Part 2., Information About This ",
        "Petitioner, Item Number 4. of Form I-129.  Choose only one action.",
        "A. Notify the office listed in Part 4. so the beneficiary(ies) can seek a visa or admission.  Check this box if the ",
        "beneficiary is outside of the United States, or, if the beneficiary is currently in the United States, but he or she will ",
        "leave the United States to obtain a visa/admission abroad.",
        "B. Change the status and extend the stay of beneficiaries who are now in the United States in another status.  ",
        "Check this box if the beneficiary is currently in the United States in a different nonimmigrant classification and is ",
        "applying to change to a new, nonimmigrant status.",
        "Exception:  If the beneficiary seeks to change status to H-1B1 Chile/Singapore or TN classification, see Item f. ",
        "below.",
        "",
        "Form I-129 Instructions   04/01/24 Page 6 of 30",
        "C. Extend the stay of each beneficiary who now holds this status.  Check this box if the beneficiary is currently ",
        "in the United States in a nonimmigrant classification and is requesting an extension of his or her stay in the same ",
        "nonimmigrant classification.",
        "Exception:  If the beneficiary seeks to extend his/her stay in H1B1 Chile/Singapore or TN classification, see  ",
        "Item e. below.",
        "D. Amend the stay of each beneficiary who now holds this status.  Check this box if the beneficiary is currently in ",
        "the United States in the same nonimmigrant classification and you are notifying USCIS of any material changes ",
        "in the terms and conditions of employment, training or the beneficiary’s eligibility as specified in the original ",
        "approved petition.",
        "E. Extend the status of a nonimmigrant classification that is based on a Free Trade Agreement.  Check this box ",
        "if the beneficiary is currently in the United States based on a Free Trade Agreement (H-1B1 Chile/Singapore or ",
        "TN classification) and is requesting an extension of his or her stay in that same classification.",
        "F.   Change status to a nonimmigrant classification that is based on a Free Trade Agreement.  Check this box ",
        "if the beneficiary is currently in the United States in a different nonimmigrant classification and is applying ",
        "to change to a nonimmigrant classification based on a Free Trade Agreement (H-1B1 Chile/Singapore or TN ",
        "classification).",
        "Certification Pertaining to the Release of Controlled Technology or Technical Data to Foreign Persons in the United ",
        "States",
        "U.S. Export Controls on Release of Controlled Technology or Technical Data to Foreign Persons.  The Export ",
        "Administration Regulations (EAR) (15 CFR Parts 770-774) and the International Traffic in Arms Regulations (ITAR) (22 ",
        "CFR Parts 120-130) require U.S. persons to seek and receive authorization from the U.S. Government before releasing to ",
        "foreign persons in the United States controlled technology or technical data.  Under both the EAR and the ITAR, release ",
        "of controlled technology or technical data to foreign persons in the United States--even by an employer--is deemed to be ",
        "an export to that person’s country or countries of nationality.  One implication of this rule is that a U.S. company must ",
        "seek and receive a license from the U.S. Government before it releases controlled technology or technical data to its ",
        "nonimmigrant workers employed as H-1B, H-1B1, L-1, or O-1A beneficiaries.",
        "Requirement to Certify Compliance with U.S. Export Control Regulations.  The U.S. Government requires each ",
        "company or other entity that files a Form I-129 to certify that to the best of its knowledge at the time of filing it has ",
        "reviewed the Export Administration Regulations (EAR) and the International Traffic in Arms Regulations (ITAR) and ",
        "determined whether it will require a U.S. Government export license to release controlled technology or technical data to ",
        "the beneficiary.",
        "If an export license is required, the company or other entity must further certify that it will not release or otherwise ",
        "provide access to controlled technology or technical data to the beneficiary until it has received the required authorization ",
        "from the U.S. Government.",
        "The petitioner must indicate whether or not a license is required in Part 6., Certification Regarding the Release of ",
        "Controlled Technology or Technical Data to Foreign Persons in the United States, of Form I-129.",
        "Controlled Technology and Technical Data.  The licensing requirements described above will affect only a small ",
        "percentage of petitioners because most types of technology are not controlled for export or release to foreign persons.  ",
        "The technology and technical data that are, however, controlled for release to foreign persons are identified on the EAR’s ",
        "Commerce Control List (CCL) and the ITAR’s U.S. Munitions List (USML).  The CCL is found at 15 CFR Part 774,  ",
        "Supp. 1.  See http://www.access.gpo.gov/bis/ear/ear_data.html#ccl.  The USML is at 22 CFR 121.1.  See  ",
        "http://www.pmddtc.state.gov/regulations_laws/itar.html.  The EAR-controlled technology on the CCL generally ",
        "pertains to that which is for the production, development, or use of what are generally known as “dual-use” items.  The ",
        "ITAR-controlled technical data on the USML generally pertains to that which is directly related to defense articles. ",
        "The U.S. Department of Commerce’s Bureau of Industry and Security administers the CCL and is responsible for ",
        "issuing licenses for the release to foreign persons of technology controlled under the EAR.  The U.S. Department of ",
        "State’s Directorate of Defense Trade Controls (DDTC) administers the USML and is responsible for issuing licenses ",
        "for the release to foreign persons of technical data controlled under the ITAR.  Information about the EAR and how to ",
        "apply for a license from BIS are at www.bis.doc.gov.  Specific information about EAR’s requirements pertaining to the ",
        "release of controlled technology to foreign persons is at www.bis.doc.gov/index.php/policy-guidance/deemed-exports.  ",
        "Information about the ITAR and how to apply for a license from DDTC are at www.pmddtc.state.gov.",
        "",
        "Form I-129 Instructions   04/01/24 Page 7 of 30",
        "Classification - Initial Evidence",
        "For all classifications, if a beneficiary is seeking a change of status or extension of stay, evidence of maintenance of ",
        "status must be included with the new petition.  If the beneficiary is employed in the United States, the petitioner may ",
        "submit copies of the beneficiary’s last 2 pay stubs, Form W-2, and other relevant evidence, as well as a copy of the ",
        "beneficiary’s Form I-94, passport, travel document, or I-797.",
        "The beneficiary’s dependent family members (generally, spouses and children under 21) should use Form I-539, ",
        "Application to Change/Extend Nonimmigrant Status, to apply for a change of status or extension of stay.",
        "A nonimmigrant, who must have a passport to be admitted, generally must maintain a valid passport during his or her ",
        "entire stay.",
        "The following nonimmigrants are not eligible to change status:",
        "1. A nonimmigrant admitted under a visa waiver program;",
        "2. A nonimmigrant is transit (C) or in transit without a visa (TWOV);",
        "3. A crewman (D);",
        "4. A fiancé(e) (K-1) or his or her dependent (K-2);",
        "5. A spouse of a U.S. citizen (K-3) or his or her dependent (K-4);",
        "6. A J-1 exchange visitor who was admitted in J-1 status for the purpose of receiving graduate medical training;",
        "7. A J-1 exchange visitor subject to the foreign residence requirement who has not received a waiver of that requirement; ",
        "and",
        "8. An M-1 student to an H classification if training received as an M-1 helped him or her qualify for H classification.",
        "Reduced Fees For Small Employers and Non-Profits",
        "You may qualify for a reduced fee on this form and the associated asylum program fee if you:",
        "1. Have 25 or fewer full-time equivalent employees in the United States, including any affiliates and subsidiaries; or",
        "• Reduced fee for form and asylum program fee.",
        "• Possible evidence to support eligibility for the reduced fees includes a copy of the petitioner’s most recent IRS ",
        "Form 941, Employer’s Quarterly Federal Return or IRS Form 943, Employer’ Annual Tax Return for Agricultural ",
        "Workers.",
        "2. Are a not-for-profit primary or secondary educational institution, or institution of higher education, as defined in ",
        "section 101(a) of the Higher Education Act of 1965, 20 U.S.C. 1001(a); tax exempt organization under the Internal ",
        "Revenue Code of 1986, section 501(c)(3), 26 U.S.C. 501(c)(3), or a governmental research organization as defined ",
        "under 8 CFR 214.2(h)(19)(iii)(C). ",
        "• Reduced fee for form and no asylum program fee.",
        "• Possible evidence to support eligibility for the reduced fees includes the organization’s Determination Letter from ",
        "the IRS or copy of a currently valid IRS tax exemption certificate.  ",
        "Part 1.  Petition Always Required",
        "The following classifications always require a petition.",
        "The initial evidence listed below and the initial evidence listed under the instructions for a change of status or extension of ",
        "stay must be included with a petition for a new or concurrent employment or for an extension where there is a change in ",
        "previously approved employment.",
        "However, a petition for extension based on unchanged, previously approved employment should only be filed with the ",
        "initial evidence required in the extension of stay instructions.",
        "",
        "Form I-129 Instructions   04/01/24 Page 8 of 30",
        "E-2 CNMI",
        "An E-2 CNMI investor is a nonimmigrant who seeks to enter or remain in the Commonwealth of the Northern ",
        "Mariana Islands (CNMI) in order to maintain an investment in the CNMI that was approved by the CNMI ",
        "government prior to November 28, 2009.  An E-2 CNMI investor classification is specifically limited to a ",
        "nonimmigrant investor who has previously been granted a qualifying long term investor status under the laws ",
        "of the CNMI.  This classification allows an eligible nonimmigrant to be lawfully present in the CNMI in order ",
        "to maintain the investment during the transition period from CNMI to Federal immigration law.  An investor’s ",
        "nationality is not a qualifying factor in the issuance of an E-2 CNMI investor classification.",
        "This classification expires on December 31, 2029",
        "A petition for the initial issuance of an E-2 CNMI investor classification must be filed within 2 years of the date the E-2 ",
        "CNMI investor classification became available, which was January 18, 2011.  Petitions for the initial issuance of the E-2 ",
        "CNMI filed after January 18, 2013 will be rejected.",
        "Requests for extension of the E-2 CNMI investor classification may be granted, in increments of not more than 2 years, ",
        "until December 31, 2029.",
        "Applications for the dependents of E-2 CNMI investors must be filed on Form I-539, Application to Extend/Change ",
        "Nonimmigrant Status.",
        "Write E-2C in the classification block.",
        "The petition must be filed with documentary evidence of:",
        "1. Continuous maintenance of the terms and conditions of E-2 CNMI investor nonimmigrant status;",
        "2. Physical presence in the CNMI at the time of filing of the extension of stay request; and",
        "3. The fact that the beneficiary will not leave during the pendency of the extension of stay request.",
        "H-1B Beneficiaries (Three Types)",
        "The H-1B classification is for beneficiaries coming to the United States temporarily to perform services in a ",
        "specialty occupation.",
        "Write H-1B in the classification block.",
        "A specialty occupation is one that requires the theoretical and practical application of a body of highly specialized ",
        "knowledge to fully perform the occupation and requires the attainment of a bachelor’s or higher degree in a specific ",
        "specialty, or its equivalent, as a minimum for entry into the occupation in the United States.",
        "The petition must be filed by a U.S. employer or a U.S. agent and must be filed with:",
        "1. Evidence that a labor condition application (LCA) has been certified by the U.S. Department of Labor;",
        "2. Evidence showing that the proposed employment qualifies as a specialty occupation;",
        "3. Evidence showing that the beneficiary has the required degree by submitting either:",
        "A. A copy of the beneficiary’s U.S. bachelor’s or higher degree as required by the specialty occupation;",
        "B. A copy of a foreign degree and evidence that it is equivalent to the U.S. degree; or",
        "C. Evidence of education, specialized training, and/or progressively responsible experience that is equivalent to the ",
        "required U.S. degree.",
        "4. A copy of any required license or other official permission to practice the occupation in the state of intended  ",
        "employment; and",
        "5. A copy of any written contract between the petitioner and the beneficiary or a summary of the terms of the oral ",
        "agreement under which the beneficiary will be employed.",
        "6. If you are filing an H-1B cap petition for a fiscal year that H-1B registration is required, you must provide a valid ",
        "Beneficiary Confirmation Number for the beneficiary included in this petition, along with a copy of the H-1B ",
        "Registration Selection Notice. ",
        "",
        "Form I-129 Instructions   04/01/24 Page 9 of 30",
        "7. If you are filing an H-1B cap petition for a fiscal year that H-1B registration is required, you must submit evidence of ",
        "the beneficiary’s passport or travel document used at the time of registration to identify the beneficiary.",
        "NOTE: This evidence requirement is not applicable to H-1B2 petitions.",
        "8. Off-site Assignment of H-1B Beneficiaries:  Petitioners seeking to place the H-1B beneficiary off-site at a location    ",
        "other than their own location must answer general questions regarding this assignment in Part 5., Basic Information ",
        "About the Proposed Employment and Employer.  Petitioners should advise the H-1B beneficiary of the off-site ",
        "work placement.",
        "Additionally, petitioner should submit an itinerary that shows the dates and places of assignment if the beneficiary will ",
        "be providing services at more than one location. ",
        "The H-1B classification is also for beneficiaries coming to the United States to perform services of an exceptional ",
        "nature relating to a cooperative research and development project administered by the U.S. Department of Defense ",
        "(DOD).",
        "Write H-1B2 in the classification requested block.",
        "A U.S. employer or U.S. agent may file the petition.",
        "The petition must be filed with:",
        "1. A description of the proposed employment;",
        "2. Evidence that the services and project meet the above conditions;",
        "3. A statement listing the names of nonimmigrants who are currently or have been employed on the project within the ",
        "past year, along with their dates of employment;",
        "4. Evidence that the beneficiary holds a bachelor’s or higher degree or its equivalent in the field of employment; and",
        "5. A verification letter from the DOD project manager.  Details about the specific project are not required.",
        "The H-1B classification is also for beneficiaries of distinguished merit and ability in the field of fashion modeling.",
        "Write H-1B3 in the classification block.",
        "The petition must be filed by a U.S. employer or U.S. agent.  The petitioner must submit evidence that establishes the ",
        "beneficiary will perform services at events or productions of a distinguished reputation.  Such evidence includes:",
        "1. Documentary evidence (such as certifications, affidavits, and reviews) to establish the beneficiary is a fashion model ",
        "of distinguished merit and ability.  Any affidavits submitted by present or former employers or recognized experts ",
        "must set forth their expertise of the affiant and the manner in which the affiant acquired such information; and",
        "2. Copies of any written contracts between the petitioner and the beneficiary or, if there is no written agreement, a ",
        "summary of the terms of the oral agreement under which the beneficiary will be employed.",
        "General H-1B Requirements",
        "Three relevant laws impacting the filing of H-1B and/or L visa petitions; include:",
        "1. The American Competitiveness and Workforce Improvement Act (ACWIA), Public Law 105-277 (signed into ",
        "law on October 21, 1998);",
        "2. The H-1B Visa Reform Act of 2004 (signed into law on December 8, 2004); and",
        "3. Public Law 114-113 (signed into law on December 18, 2005).",
        "Because of ACWIA, H-1B and H-1B1 free trade nonimmigrant petitioners must complete the H-1B Data Collection and ",
        "Filing Fee Exemption Supplement, which is part of this petition.  We use this supplement (formerly issued separately as ",
        "Form I-129W) to collect additional information about the H-1B nonimmigrant workers and the H-1B petitioners, and to ",
        "determine the applicability of fees mandated by ACWIA (INA section 214(c)(9)), the H-1B1 Visa Reform Act of 2004 ",
        "(INA section 214(c)(12)), and Public Law 114-113.",
        "",
        "Form I-129 Instructions   04/01/24 Page 10 of 30",
        "A petitioner seeking initial approval of H-1B or L nonimmigrant status for a beneficiary, or seeking approval to employ ",
        "an H-1B or L nonimmigrant currently working for another employer, must submit an additional Fraud Prevention and ",
        "Detection fee.  This fee does not apply to H-1B1 petitions.",
        "Those petitioners required to submit the Fraud Prevention and Detection fee are also required to submit either an ",
        "additional H-1B or L-1 fee mandated by Public Law 114-113, if:",
        "1. The petitioner employs 50 or more individuals in the United States;",
        "2. More than 50 percent of those employees are in H-1B or L-1A or L-1B nonimmigrant status; and",
        "3. Public Law 114-113 (signed into law on December 18, 2015.",
        "To determine if they are subject to any of these fees, petitioners must complete the H-1B and H-1B1 Data Collection and ",
        "Filing Fee Exemption Supplement discussed below.  See Form G-1055 for specific fee amounts.",
        "H-1B and H-1B1 Data Collection and Filing Fee Exemption Supplement",
        "A U.S. employer or U.S. agent who seek to place a beneficiary in H-1B classification (including H-1B1 classification for ",
        "free trade nonimmigrants from Chile and Singapore) must file this supplement.",
        "The supplement is used to:",
        "1. Collect additional information about the H-1B employer and beneficiary; and",
        "2. Determine the appropriate American Competitiveness and Workforce Improvement Act (ACWIA) fee.  The ACWIA ",
        "Fee is a training fee meant to fund the training of U.S. workers.  But if the employer has 25 or fewer full-time ",
        "employees, they must pay only one-half of the required fee at INA 214(c)(9)(B).  This supplement also helps to ",
        "determine whether the beneficiary is subject to the H-1B numerical limitation (also known as the H-1B Cap).  Please ",
        "note that the ACWIA fee may not be assessed to the beneficiary.",
        "Who is required to submit this supplement?",
        "A U.S. employer or U.S. agent seeking to classify a beneficiary as an H-1B or H-1B1 Free Trade Nonimmigrant worker ",
        "must file this supplement with the Form I-129 and the appropriate fee.",
        "Completing Section 1. of the H-1B and H-1B1 Data Collection and Filing Fee Exemption Supplement Form",
        "All petitioners who seek to classify a beneficiary as an H-1B or H-1B1 free trade nonimmigrant worker must answer every ",
        "question in Item Number 1. of Section 1., General Information.  Guidance on how to answer these questions follows.",
        "1. H-1B dependent employer.  An “H-1B dependent employer” is an employer that:",
        "A. Has 25 or fewer full-time-equivalent employees who are employed in the United States and employs more than ",
        "seven H-1B nonimmigrants;",
        "B. Has at least 26 but not more than 50 full-time-equivalent employees who are employed in the United States and ",
        "employs more than 12 H-1B nonimmigrants; or",
        "C. Has at least 51 full-time equivalent employees who are employed in the United States and employs H-1B ",
        "nonimmigrants in a number that is equal to at least 15 percent of the number of such full-time-equivalent ",
        "employees.",
        "2. Willful violators.  A willful violator is an employer whom the U.S. Secretary of Labor has found, after notice and ",
        "opportunity for a hearing, to have willfully failed to meet a condition of the labor condition application described in ",
        "section 212(n) of the Immigration and Nationality Act.",
        "3. Exempt H-1B nonimmigrant.  An “exempt H-1B nonimmigrant” is an H-1B nonimmigrant who:",
        "A. Receives wages (including cash bonuses and similar compensation) at an annual rate equal to at least $60,000; or",
        "B. Has attained a master’s degree or higher (or its equivalent) in a specialty related to the intended employment.",
        "4. Highest level of formal education.  In Item Number 2. of Section 1., place an “X” in the appropriate box that most ",
        "closely reflects the highest level of formal education the beneficiary has attained.",
        "",
        "Form I-129 Instructions   04/01/24 Page 11 of 30",
        "5. Major/primary field of study.  Use the beneficiary’s degree transcripts to determine the primary field of study.  DO ",
        "NOT consider work experience to determine the beneficiary’s major field of study.",
        "6. Master’s or higher degree from a U.S. institution of higher education.  Indicate whether or not the beneficiary has ",
        "earned a master’s or higher degree from a U.S. institution of higher education, as defined in 20 U.S.C. section 1001(a).",
        "7. Rate of pay per year.  The “rate of pay’’ is the salary or wages paid to the beneficiary.  Salary or wages must be ",
        "expressed in an annual full-time amount and do not include non-cash compensation or benefits.  For example, an ",
        "H-1B worker is to be paid $6,500 per month for a 4-month period and also provided separately a health benefits ",
        "package and transportation during the 4-month period.  The yearly rate of pay if he or she were working for a full year ",
        "would be 12 times the monthly rate, or $78,000.  This amount does not include health benefits or transportation costs. ",
        "The figure $78,000 should be entered on this form as the rate of pay.",
        "8. SOC Code.  This is the Standard Occupational Classification (SOC) Code.  You can obtain the SOC codes from the ",
        "Department of Labor (DOL), Bureau of Labor Statistics at www.bls.gov/soc.",
        "9. NAICS Code.  This is the North American Industry Classification System (NAICS) Code.  This code can be obtained ",
        "from the U.S. Department of Commerce, Census Bureau (www.census.gov/epcd/www/naics.html).  Enter the code ",
        "from left to right, one digit in each of the six boxes.  If you use a code with fewer than six digits, enter the code left to ",
        "right and then add zeros in the remaining unoccupied boxes.",
        "For example, the code sequence 33466 would be entered as:   [Each number inside a separate ",
        "box]",
        "For example, the code sequence 5133 would be entered as:   [Each number inside a separate ",
        "box]",
        "Completing Section 2. of the H-1B and H-1B1 Data Collection and Filing Fee Exemption Supplemental Form",
        "Petitioners must complete Section 2., Fee Exemption and/or Determination, to determine whether they must pay the ",
        "ACWIA fee.  See Form G-1055, available at www.uscis.gov/forms, for specific information about the fees applicable to ",
        "this form.  The petitioner is exempt from payment of the ACWIA fee if at least one of the following conditions apply:",
        "1. The employer is an institution of higher education as defined in the Higher Education Act of 1965, section 101(a), 20 ",
        "U.S.C. 1001(a);",
        "2. The employer is a nonprofit organization or entity related to, or affiliated with an institution of higher education as ",
        "defined in 20 U.S.C. 1001(a).  Such nonprofit organizations or entities include, but are not limited to, hospitals and ",
        "medical research institutions;",
        "NOTE:  “Related to” or “affiliated with” means the entity is:",
        "A. Connected to or associated with the institution of higher education through shared ownership or control by the ",
        "same board or federation; or",
        "B. Operated by the institution of higher education; or",
        "C. Attached to the institution of higher education as a member, branch, cooperative, or subsidiary; or",
        "D. A nonprofit entity that has entered into a formal written affiliation agreement with an institution of higher ",
        "education that establishes an active working relationship between the nonprofit entity and the institution of higher ",
        "education for the purposes of research or education, and a fundamental activity of the nonprofit entity is to directly ",
        "contribute to the research or education mission of the institution of higher education.",
        "3. The employer is a nonprofit research organization or governmental research organization that is primarily engaged in ",
        "basic research and/or applied research;",
        "NOTE:  The term “governmental research organization” is defined at 8 CFR 214.2(h)(19)(iii)(C) as “a federal, state, ",
        "or local entity whose primary mission is the performance or promotion of basic research and/or applied research.”",
        "NOTE:  “Nonprofit organization or entity” means the organization or entity is:",
        "A. Defined as a tax-exempt organization under the Internal Revenue Code of 1986, section 501(c)(3), (c)(4), or (c)(6) ",
        "(codified at 26 U.S.C. 501(c)(3), (c)(4), or (c)(6)); and",
        "",
        "Form I-129 Instructions   04/01/24 Page 12 of 30",
        "B. Has been approved as a tax-exempt organization for research or educational purposes by the Internal Revenue ",
        "Service.",
        "4. This petition is the second or subsequent request for an extension of stay filed by the employer regardless of when the ",
        "first extension of stay was filed or whether the ACWIA filing fee was paid on the initial petition or the first extension ",
        "of stay;",
        "5. This petition is an amended petition that does not contain any requests for extension of stay;",
        "6. This petition is being filed to correct a USCIS error;",
        "7. The employer is a primary or secondary education institution;",
        "8. The employer is a nonprofit entity which engages in an established curriculum-related clinical training for students ",
        "registered at the institution of higher education.",
        "What evidence is required under Section 2.?",
        "Petitioners claiming an exemption from the ACWIA filing fee must submit evidence showing why the organization or ",
        "entity is exempt.",
        "Completing Section 3. of the H-1B and H-1B1 Data Collection and Filing Fee Exemption Supplemental Form",
        "All petitioners must complete Section 3., Numerical Limitation Information, to determine whether the beneficiary is ",
        "subject to the H-1B cap.",
        "Public Law 110-229 provides that nonimmigrant workers admitted to Guam or CNMI are exempt from the statutory caps ",
        "for the H visa programs through December 31, 2029.",
        "The Form I-129 H Classification Supplement and H-1B Data Collection and Filing Fee Exemption Worksheet require ",
        "employers to indicate the specific reason for any claimed cap exemption.  Please select, in Section 3 of the H-1B and ",
        "H-1B1 Data Collection and Filing Fee Exemption Supplement, the reason(s) this petition is exempt from the numerical ",
        "limitation for H-1B classification:",
        "1. The employer is an institution of higher education as defined in 20 U.S.C. 1001(a);",
        "2. The employer is a nonprofit entity related to or affiliated with an institution of higher education as defined in 8 CFR ",
        "214.2(h)(8)(ii)(F)(2);",
        "3. The employer is a nonprofit research organization or governmental research organization that is primarily engaged in ",
        "basic research and/or applied research as defined in 8 CFR 214.2(h)(8)(ii)(F)(3);",
        "NOTE:  To determine if you qualify for exemption from the H-1B cap as an institution of higher education, nonprofit ",
        "entity related to or affiliated with an institution of higher education, nonprofit research organization or governmental ",
        "research organization, please refer to the definitions of those terms in the section above (“Completing Section 2. of the ",
        "H-1B and H-1B1 Data Collection and Filing Fee Exemption Supplemental Form”).",
        "4. The beneficiary will spend  the majority of his or her work time performing job duties at a qualifying institution, ",
        "organization, or entity and those job duties directly and predominantly further the essential purpose, mission, ",
        "objectives, or functions of the qualifying institution, organization, or entity, namely, either higher education, nonprofit ",
        "research, or governmental research;",
        "NOTE:  The burden is on the H-1B petitioner to establish that there is a nexus between the duties to be performed ",
        "by the H-1B beneficiary and the essential purpose, mission, objectives or functions of the qualifying institution, ",
        "organization or entity.",
        "5. The beneficiary is currently employed at a cap-exempt institution, entity, or organization and you seek to concurrently ",
        "employ the H-1B beneficiary; ",
        "6. The beneficiary is a J-1 nonimmigrant physician who has received a waiver based on section 214(l) of the Act;",
        "7. The beneficiary of this petition has been counted against the regular H-1B cap or masters cap exemption; and  ",
        "A. This petition is an amended petition without an extension of stay request;",
        "B. You are applying to extend or obtain H-1B classification for time remaining (including through recapture) on the ",
        "beneficiary’s full period of authorized admission; or",
        "",
        "Form I-129 Instructions   04/01/24 Page 13 of 30",
        "C. You are seeking an extension beyond the 6-year period of authorized admission limitation based on sections ",
        "104(c) or 106(a) and 106(b) of the American Competitiveness in the Twenty-first Century Act (AC21); or",
        "8. The petitioner is an employer eligible for the Guam-CNMI cap exemption pursuant to Public Law 110-229.",
        "H-2A Nonimmigrants",
        "The H-2A classification is for beneficiaries coming to the United States temporarily to perform agricultural labor ",
        "or services of a temporary or seasonal nature.",
        "Write H-2A in the classification block.",
        "Total number of workers:  The total number of workers you request on an H-2A petition must not exceed the number of ",
        "workers approved by the Department of Labor on the temporary labor certification.  If naming beneficiaries, a single H-2A ",
        "petition may not include more than 25 named workers.  A petitioner may file additional petitions if requesting more than ",
        "25 named workers.",
        "Naming beneficiaries.  Generally, you may request named or unnamed workers as beneficiaries of an H-2A petition. ",
        "However, you may not request both named and unnamed workers on the same H-2A petition.",
        "Workers must be named if you request workers who: ",
        "1. Are currently in the United States; and",
        "2. Are nationals of countries that are not on the eligible countries list (see link and information below).",
        "The petition may be filed by:",
        "1. The employer listed on the temporary labor certification;",
        "2. The employer’s agent; or",
        "3. The association of U.S. agricultural producers named as a joint employer on the temporary labor certification.",
        "The petitioner, employer (if different from the petitioner), and each joint employer must complete and sign the relevant ",
        "sections of the H Classification Supplement.",
        "Additionally, the petitioner must submit:",
        "1. A single valid temporary labor certification from the U.S. Department of Labor;* and",
        "2. Evidence showing that each named beneficiary meets the minimum job requirements stated in the temporary labor ",
        "certification at the time the certification application was filed.",
        "* Under certain emergent circumstances, as determined by USCIS, petitions requesting a continuation of ",
        "employment with the same employer for 2 weeks or less are exempt from the temporary labor certification ",
        "requirement.  See 8 CFR 214.2(h)(5)(x).",
        "E-Verify and H-2A Petitions",
        "In certain cases, H-2A workers may start work immediately after a petitioner files a Form I-129 on their behalf.  This may ",
        "happen only if:",
        "1. The petitioner is a participant in good standing in the E-Verify program; and",
        "2. The requested workers are currently in the United States in a lawful nonimmigrant status, and either:",
        "A. Changing status to H-2A, or",
        "B. Extending their stay in H-2A status by changing employers.",
        "If the petitioner and the requested H-2A workers meet these criteria, provide the E-Verify Company ID or Client Company ",
        "ID in Section 2., Complete This Section If Filing For H-2A or H-2B Classification, of the H Classification Supplement.  ",
        "See 8 CFR 274a.12(b)(21) for more information.",
        "H-2B Nonimmigrants",
        "The H-2B classification is for beneficiaries coming to the United States temporarily to engage in nonagricultural ",
        "services or labor that is based on the employer’s seasonal, intermittent, peak load, or one-time need.",
        "",
        "Form I-129 Instructions   04/01/24 Page 14 of 30",
        "Write H-2B in the classification block.",
        "Total number of workers:  The total number of workers you request on an H-2B petition must not exceed the number of ",
        "workers approved by the Department of Labor on the temporary labor certification.  If naming beneficiaries, a single H-2B ",
        "petition may not include more than 25 named workers.  A petitioner may file additional petitions if requesting more than ",
        "25 named workers.",
        "Naming beneficiaries.  Generally, you may request named or unnamed workers as beneficiaries of an H-2B petition. ",
        "However, you may not request both named and unnamed workers on the same H-2B petition.",
        "Workers must be named if you request workers who: ",
        "1. Are currently in the United States; and",
        "2. Are nationals of countries that are not on the eligible countries list (see link and information below).",
        "The petition must be filed by a U.S. employer, a U.S. agent, or a foreign employer filing through a U.S. agent.  The ",
        "petitioner and employer (if different from the petitioner) must complete and sign the relevant sections of the H ",
        "Classification Supplement.",
        "Additionally, the petitioner must submit:",
        "1. An approved temporary labor certification from the U.S. Department of Labor (or the Governor of Guam, if the ",
        "employment will occur in Guam);** and",
        "2. Evidence showing that each named beneficiary meets the minimum job requirements, if any, stated on the temporary ",
        "labor certification.",
        "**   Petitions filed on behalf of Canadian musicians who will be performing for 1 month or less within 50 miles ",
        "of the U.S. - Canadian border do not require a temporary labor certification.  Petitions which require work in ",
        "the jurisdictions of both the U.S. and Guam Departments of Labor must submit an approved temporary labor ",
        "certification from each agency.",
        "H-2B Start Date",
        "A petition for H-2B workers must request an employment start date that matches the start date approved by the ",
        "Department of Labor on the temporary labor certification.  Petitions without matching start dates may be denied.  This ",
        "does not apply to amended petitions which request to substitute H-2B workers using the same temporary labor certificate.",
        "Additional Information Regarding H-2A and H-2B Petitions",
        "Eligible Countries List",
        "H-2A and H-2B petitions may generally only be approved for nationals of countries that the Secretary of Homeland ",
        "Security has designated, with the concurrence of the Secretary of State, as eligible to participate in the H-2 program.  The ",
        "current list of eligible countries is located at www.uscis.gov/h-2a and www.uscis.gov/h-2b.",
        "Nationals of countries that are not eligible to participate in the H-2 program may still be named as beneficiaries on an ",
        "H-2A or H-2B petition.  To do so, you must:",
        "1. Name each beneficiary who is not from an eligible country; and",
        "2. Provide evidence to show that it is in the U.S. interest for the national to be the beneficiary of such a petition.",
        "USCIS’ determination of what constitutes U.S. interest takes into account certain factors, including but not limited to:",
        "1. Evidence demonstrating that a worker with the required skills is not available from among foreign workers from a ",
        "country currently on the eligible countries list;",
        "NOTE:  Also, for H-2A petitions only, the petitioner must submit evidence demonstrating that a U.S. worker with the ",
        "required skills is not available.",
        "2. Evidence that the beneficiary has been admitted to the United States previously in H-2A or H-2B status;",
        "",
        "Form I-129 Instructions   04/01/24 Page 15 of 30",
        "3. The potential for abuse, fraud, or other harm to the integrity of the H-2A or H-2B visa program through the potential ",
        "admission of a beneficiary from a country not currently on the eligible countries list; and",
        "4. Such other factors as may serve the U.S. interest.",
        "Prohibited Fees",
        "As a condition of approval of an H-2A or H-2B petition, no job placement fee or other compensation (either direct or ",
        "indirect) may be collected at any time from a beneficiary of an H-2A or H-2B petition.  This includes collection by a ",
        "petitioner, agent, facilitator, recruiter, or similar employment service, as a condition of employment, whether before or ",
        "after the filing or approval of a petition.  Unless the payment of such fees by a worker is prohibited under law, the only ",
        "exceptions to this are:",
        "1. The lower of the actual cost or fair market value of transportation to the offered employment; and",
        "2. Any government-mandated passport, visa, or inspection fees.",
        "If USCIS determines any of the following have occurred, the petition will be denied or revoked.  The only exceptions to a ",
        "mandatory denial or revocation are found at 8 CFR 214.2(h)(5)(xi)(A)(4) and 8 CFR 214.2(h)(6)(i)(B)(4):",
        "1. You collected, or entered into an agreement to collect, prohibited fees as described above;",
        "2. You knew, or should have known, at the time of filing the petition that the beneficiary paid, or agreed to pay, any ",
        "agent, facilitator, recruiter, or similar employment service as a condition of employment;",
        "3. The beneficiary paid you prohibited fees or compensation as a condition of employment after the petition was filed; or ",
        "4. You knew, or had reason to know, that the beneficiary paid, or agreed to pay, the agent, facilitator, recruiter, or similar ",
        "employment service prohibited fees after the petition was filed.",
        "The petition should be filed with evidence that indicates the beneficiaries have not paid, and will not pay, prohibited fees ",
        "to the best of your knowledge.",
        "Interrupted Stays",
        "Interrupted stays are certain periods of time that a worker spends outside the United States during an authorized period ",
        "of stay in H-2A or H-2B status.  An interrupted stay does not count toward the worker’s maximum 3-year limit in the ",
        "classification.",
        "An H-2A or H-2B worker may qualify for an interrupted stay under the following conditions:",
        "If the worker was in the United States in H-2 status ",
        "for an aggregate period of:",
        "Then H-2 time is interrupted if he or she is outside ",
        "the United States for:",
        "18 months or lessAt least 45 days, but less than 3 months",
        "More than 18 months, but less than 3 yearsAt least 2 months",
        "Time in H-2A or H-2B status is not automatically interrupted if the worker departs the United States.  It is considered ",
        "interrupted only if the guidelines in the above chart are met.  For more on interrupted stays, see www.uscis.gov.",
        "Notification Requirements",
        "By filing an H-2A or H-2B petition, you agree to notify USCIS within 2 work days if an H-2A or H-2B worker:",
        "1. Fails to report to work within 5 workdays after the employment start date stated on the petition or within 5 workdays ",
        "after the start date as established by the H-2A employer, whichever is later;",
        "2. Completes the labor or services more than 30 days earlier than the employment end date stated on the petition;",
        "3. Absconds from the worksite; or",
        "4. Is terminated prior to the completion of the services or labor.",
        "Failure to comply with this agreement may result in penalties.  See www.uscis.gov for more information.",
        "",
        "Form I-129 Instructions   04/01/24 Page 16 of 30",
        "Filing Multiple Petitions",
        "You generally may file one petition to request all of your H-2A or H-2B workers associated with one temporary labor ",
        "certification (with a limit of 25 named workers per petition).  In cases where filing a separate petition is not required, it ",
        "may be advantageous to file more than one H-2A or H-2B petition instead.  This can occur when you petition for multiple ",
        "workers, some of whom may not qualify for part or all of the validity period you request.  This most frequently occurs ",
        "when:",
        "1. Some of the workers you request are not nationals of a country on the eligible countries list;",
        "2. You request interrupted stays for workers; or",
        "3. At least one worker is nearing the 3-year maximum stay limit.",
        "If we request additional evidence because of these situations, it may delay petition processing.  Filing separate petitions ",
        "for workers who are not affected by these scenarios may enable you to quickly obtain some workers, if they are otherwise ",
        "eligible, in the event that the petition for your other workers is delayed.",
        "If you decide to file more than one petition with the same temporary labor certification, you may do so if:",
        "1. One petition is accompanied by the original temporary labor certification;",
        "2. The total number of beneficiaries on your petitions does not exceed the total number of workers approved by the U.S. ",
        "Department of Labor on the temporary labor certification; and",
        "3. The other petitions are accompanied by copies of the same temporary labor certification, along with an attachment ",
        "explaining why the original was not submitted.",
        "H-3 Nonimmigrants (Two Types)",
        "The H-3 classification is for beneficiaries coming to the United States temporarily to participate in a special ",
        "education exchange visitor program in the education of children with physical, mental, or emotional disabilities.",
        "Write H-3 in the classification block.",
        "Including more than one beneficiary in a petition.  You may include up to 25 beneficiaries on the same petition if all ",
        "beneficiaries will receive the same training for the same period of time in the same location.  If you seek H-3 classification ",
        "for more than 25 beneficiaries, you must file more than one petition.",
        "Any custodial care of the children must be incidental to the training program.  The petition must be filed by a U.S. ",
        "employer, which must be a facility which has professionally trained staff and a structured program for providing education ",
        "to children with disabilities and training and hands-on experience to participants in the special education exchange visitor ",
        "program.  The petition must be filed with:",
        "1. A description of the training, staff, and facilities; evidence that the program meets the above conditions; and details of ",
        "the beneficiary’s participation in the program; and",
        "2. Evidence showing that the beneficiary is nearing completion of a baccalaureate degree in special education, or already ",
        "holds such a degree, or has extensive prior training and experience in teaching children with physical, mental, or ",
        "emotional disabilities.",
        "The H-3 classification is also for beneficiaries coming to the United States temporarily to receive training from an ",
        "employer in any field other than graduate medical education or training.",
        "Write H-3 in the classification block.",
        "The petition must be filed with:",
        "1. A detailed description of the structured training program, including the number of classroom hours per week and the ",
        "number of hours of on-the-job training per week;",
        "2. A summary of the prior training and experience of each beneficiary in the petition; and",
        "3. An explanation stating why the training is required, whether similar training is available in the beneficiary’s country, ",
        "how the training will benefit the beneficiary in pursuing a career abroad, the source of any remuneration the trainee ",
        "will receive and any benefit the petitioner will obtain by providing the training.",
        "",
        "Form I-129 Instructions   04/01/24 Page 17 of 30",
        "L-1 Nonimmigrants (Two Types)",
        "The L-1A classification is for beneficiaries coming to the United States temporarily to perform services in a ",
        "managerial or executive capacity for the same employer (or for the parent, branch, subsidiary, or affiliate of the ",
        "employer) that employed the beneficiary abroad in a capacity that was managerial or executive in nature, or one that ",
        "required specialized knowledge, for at least 1 continuous year within the last 3 years.  In the case of an L-1A beneficiary ",
        "who is coming to the United States to set up a new office, the 1 year of experience abroad must have been in an executive ",
        "or managerial capacity.",
        "Write L-1A in the classification block.",
        "Either a U.S. employer or foreign employer may file the petition, but the foreign employer must have a legal business ",
        "entity in the United States.",
        "The L-1B classification is for beneficiaries coming to the United States temporarily to perform services that ",
        "require specialized knowledge for the same employer (or for the parent, branch, subsidiary, or affiliate of the employer) ",
        "that employed the beneficiary abroad in a capacity that was managerial or executive in nature, or one that required ",
        "specialized knowledge for at least 1 continuous year within the last 3 years.***  Specialized knowledge is either: (a) ",
        "special knowledge of the petitioning employer’s product, service research, equipment, techniques, management, or other ",
        "interests and its application in international markets or (b) an advanced level of knowledge or expertise in the employing ",
        "organization’s processes or procedures.",
        "***    In the case of blanket petitions, the L-1B must be a specialized knowledge professional.  There is no requirement, ",
        "however, that the person have acted in a “professional capacity” while abroad for purposes of meeting the one-year ",
        "requirement.",
        "Write L-1B in the classification block.",
        "General L Classification Requirements",
        "Either a U.S. or foreign employer may file the petition.",
        "The petition must be filed with:",
        "1. Evidence establishing the existence of the qualifying relationship between the U.S. and foreign employer based on ",
        "ownership and control, such as:  an annual report, articles of incorporation, financial statements, or copies of stock ",
        "certificates.  Note:  Whether such evidence will be sufficient to meet the petitioner’s burden of establishing such a ",
        "qualifying relationship will depend on the quality and probative value of the evidence submitted.",
        "2. Evidence of the beneficiary’s employment for the required one year abroad in, as applicable, a managerial, executive, ",
        "or specialized knowledge capacity.  Such evidence may include, but is not limited to, a letter from the beneficiary’s ",
        "foreign qualifying employer detailing his or her dates of employment, job duties, and qualifications, along with ",
        "supporting documentary evidence; and",
        "3. A description of the proposed job duties and qualifications, and evidence showing that the proposed employment is in ",
        "an executive, managerial, or specialized knowledge capacity.",
        "Evidence for a New Office",
        "In addition to the evidence required under the General L Classification Requirements section above, if the beneficiary ",
        "is coming to the United States to open or to be employed in a new office in the United States, the petitioner must submit ",
        "evidence to show the following:",
        "For managerial or executive capacity (L-1A):",
        "1. Sufficient physical premises to house the new office have been secured;",
        "2. The beneficiary has been employed for 1 continuous year in the 3-year period preceding the filing of the petition in an ",
        "executive or managerial capacity and that the proposed employment involves executive or managerial authority over ",
        "the new operation; and",
        "3. The intended U.S. operation, within 1 year of approval, will support an executive or managerial position.  This ",
        "statement should be supported by information regarding:",
        "",
        "Form I-129 Instructions   04/01/24 Page 18 of 30",
        "A. The proposed nature of the office describing the scope of the entity, its organizational structure, and its financial ",
        "goals;",
        "B. The size of the United States investment and the foreign entity’s financial ability to remunerate the beneficiary and ",
        "to commence doing business in the United States; and",
        "C. The organizational structure of the foreign entity.",
        "For specialized knowledge capacity (L-1B):",
        "1. Sufficient physical premises to house the new office have been secured; and",
        "2. The petitioner has the financial ability to remunerate the beneficiary and to commence doing business in the  ",
        "United States.",
        "O-1A Nonimmigrants",
        "The O-1A classification is for beneficiaries coming to the United States temporarily who have extraordinary ability ",
        "in the sciences, education, business, or athletics (not including the arts, motion picture, or television industry).  The ",
        "extraordinary ability must be demonstrated by sustained national or international acclaim.",
        "Write O-1A in the classification block.",
        "The petition must be filed with:",
        "1. A written consultation from a peer group or labor and/or management organization with expertise in the field (which ",
        "could include a person or persons with expertise in the field (see General Evidence);",
        "2. A copy of any written contract between the employer and the beneficiary or a summary of the terms of the oral ",
        "agreement under which the beneficiary will be employed;",
        "3. An explanation of the nature of the events or activities, the beginning and ending dates for the events or activities, and ",
        "a copy of any itinerary for the events and activities; and",
        "4. Evidence of the beneficiary’s extraordinary ability, such as receipt of major nationally or internationally recognized ",
        "awards or prizes for excellence in the field, documentation of the beneficiary’s membership in associations in the ",
        "field which require outstanding achievements of their members, published material relating to the beneficiary’s work, ",
        "evidence of the beneficiary’s original scholarly work or, contributions of major significance to the field, evidence of ",
        "the beneficiary’s high salary within the field, evidence that the beneficiary participated individually on a panel that ",
        "judges the work of others in the field, or evidence of the beneficiary’s prior employment in a critical or essential ",
        "capacity for organizations and establishments that have a distinguished reputation.",
        "NOTE:  If the preceding forms of evidence do not readily apply to the beneficiary’s field of endeavor, you may submit ",
        "other comparable evidence.",
        "O-1B Nonimmigrants",
        "The O-1B classification is for beneficiaries coming to the United States temporarily who have extraordinary ability ",
        "in the arts or extraordinary achievement in the motion picture or television industry.",
        "Write O-1B in the classification block.",
        "The petition must be filed with:",
        "1. A written consultation from a peer group (which could be a person with expertise in the beneficiary’s field), a labor, ",
        "and/or a management organization (see General Evidence).  If the petition is based on the beneficiary’s extraordinary ",
        "achievement in the motion picture or television industry, separate consultations are required from the relevant labor ",
        "and management organizations;",
        "2. A copy of any written contract between the employer and the beneficiary or a summary of the terms of the oral ",
        "agreement under which the beneficiary will be employed;",
        "",
        "Form I-129 Instructions   04/01/24 Page 19 of 30",
        "3. Evidence that the beneficiary has received or been nominated for significant national or international awards or ",
        "prizes in the field, such as an Academy Award, Emmy, Grammy, or Director’s Guild Award, or at least three of the ",
        "following:",
        "A. Evidence that the beneficiary has performed and will perform as a lead or starring participant in productions or ",
        "events that have a distinguished reputation as evidenced by critical reviews, advertisements, publicity releases, ",
        "publications contracts, or endorsements;",
        "B. Evidence that the beneficiary has achieved national or international recognition for achievements in the field as ",
        "evidenced by critical reviews or other published materials by or about the individual in major newspapers, trade ",
        "journals, magazines, or other publications;",
        "C. Evidence that the beneficiary has a record of major commercial or critically acclaimed successes, as evidenced ",
        "by title, rating, standing in the field, box office receipts, and other occupational achievements reported in ",
        "publications;",
        "D. Evidence that the beneficiary has received significant recognition from organizations, critics, government ",
        "agencies, or other recognized experts;",
        "E. Evidence that the beneficiary commands or will command a high salary or other remuneration for services in ",
        "relation to others in the field; or",
        "F.   Evidence that the beneficiary has performed and will perform in a lead or starring role for organizations that have ",
        "a distinguished reputation.",
        "NOTE:  If you are applying for O-1B in the Arts and the preceding forms of evidence do not readily apply to the ",
        "beneficiary’s field of endeavor, you may submit other comparable evidence.",
        "O-2 Nonimmigrants",
        "The O-2 classification is for beneficiaries coming to the United States temporarily and solely to assist in the ",
        "performance of an O-1 artist or athlete because he or she performs support services that are integral to the ",
        "successful performance of the O-1.  No test of the U.S. labor market is required.  The beneficiary must have critical ",
        "skills and experience with the O-1 which must not be of a general nature or possessed by U.S. workers.",
        "Write O-2 in the classification block.",
        "This form must be filed in conjunction with an O-1 petition and filed with:",
        "1. A written consultation (see General Evidence);",
        "A. If it is for support of an athlete or an alien with extraordinary ability in the arts, the consultation must be from an ",
        "appropriate labor organization; or",
        "B. If it is for support of an alien with extraordinary achievement in motion pictures or television, the consultation ",
        "must be from an appropriate labor organization and management organization.",
        "2. Evidence of the current essentiality, critical skills, and experience of the O-2 with the O-1 and evidence that the ",
        "beneficiary has substantial experience performing the critical skills and essential support services for the O-1 principal ",
        "nonimmigrant.  In the case of a specific motion picture or television production, the evidence must establish that ",
        "significant production has taken place outside the United States, and will take place inside the United States, and that ",
        "the continuing participation of the beneficiary is essential to the successful completion of the production.",
        "Including more than one beneficiary in a petition.  You may include up to 25 beneficiaries seeking O-2 classification on ",
        "the same petition if they will all be assisting the same O-1 for the same events or performances, during the same period of ",
        "time, and in the same location.",
        "If you seek O classification for more than 25 beneficiaries, or if the above conditions do not apply, you must file a separate ",
        "petition.",
        "Employers must file separate petitions for O-2 accompanying aliens providing essential support.  These beneficiaries may ",
        "not be included in the same petition as the O-1 principal they seek to accompany.",
        "",
        "Form I-129 Instructions   04/01/24 Page 20 of 30",
        "P-1A or P-1 Major League Sports",
        "The P-1A classification is for beneficiaries coming to the United States temporarily to perform at a specific athletic ",
        "competition as an individual or as part of a group or team participating at an internationally recognized level of ",
        "performance.",
        "P-1 Major League Sports classification is for an association of teams or clubs that compete chiefly among themselves ",
        "which include major league athletes, minor league sports, and any affiliates associated with the major leagues including ",
        "but not limited to baseball, hockey, soccer, basketball, and football.  Support personnel for Major League Sports include ",
        "coaches, trainers, broadcasters, referees, linesmen, umpires, and interpreters.",
        "Write P-1A in the classification block.",
        "Including more than one beneficiary in a petition.  You may include up to 25 beneficiaries on the same petition, ",
        "provided that the beneficiaries are all members of a team.  If you seek P-1A or P-1 classification for more than 25 ",
        "beneficiaries, you must file more than one petition.",
        "The petition must be filed with:",
        "1. A written consultation (see General Evidence);",
        "2. A copy of the contract with a major U.S. sports league or team or a contract in an individual sport commensurate with ",
        "national or international recognition in the sport, if such contracts are normally utilized in the sport; and",
        "3. Evidence of at least two of the following:",
        "A. Significant participation in a prior season with a major U.S. sports league;",
        "B. Significant participation in a prior season for a U.S. college or university in intercollegiate competition;",
        "C. Participation in international competition with a national team;",
        "D. A written statement from a member of the sports media or a recognized expert in the sport which details how the ",
        "beneficiary or team is internationally recognized;",
        "E. A written statement from an official of a major U.S. sports league or official of the governing body for a sport that ",
        "details how the beneficiary or team is internationally recognized;",
        "F.   That the beneficiary or team is ranked if the sport has international rankings; or",
        "G. That the beneficiary or team has received a significant honor or award in the sport.",
        "P-1B Entertainer or Entertainment Group",
        "The P-1B classification is for beneficiaries coming to the United States temporarily to perform as a member of an ",
        "entertainment group that has been recognized internationally as outstanding in the discipline for a substantial ",
        "period of time, and who has had a sustained relationship with the group (ordinarily for at least 1 year).",
        "Write P-1B in the classification block.",
        "Including more than one beneficiary in a petition.  You may include up to 25 beneficiaries on the same petition, ",
        "provided that the beneficiaries are all members of a group.  If you seek P-1B classification for more than 25 beneficiaries, ",
        "you must file more than one petition.",
        "The petition must be filed with:",
        "1. A written consultation (see General Evidence);",
        "2. Evidence that the beneficiary or group is internationally recognized in the discipline as demonstrated by the ",
        "submission of evidence of the group’s receipt of or nomination for significant international awards or prizes for ",
        "outstanding achievement, or evidence of at least two of the following:",
        "A. The beneficiary or group has performed, and will perform as a starring or leading group in productions or events ",
        "with a distinguished reputation;",
        "B. The beneficiary or group has achieved international recognition and acclaim for outstanding achievement in the ",
        "field;",
        "",
        "Form I-129 Instructions   04/01/24 Page 21 of 30",
        "C. The group has performed, and will perform, services as a star or leading group for organizations and ",
        "establishments that have a distinguished reputation;",
        "D. The beneficiary or group has a record of major commercial or critically acclaimed success;",
        "E. The beneficiary or group has received significant recognition for achievements from critics, organizations, ",
        "government agencies, or other recognized experts in the field; or",
        "F.   The beneficiary or group commands a high salary or other substantial remuneration for services compared to other ",
        "similarly situated in the field.",
        "3. Evidence that 75 percent of the members of the group have had a sustained and substantial relationship with the group ",
        "for at least 1 year.  Provide a list of the benefiriary’s functions which are integral to the group’s performance.",
        "By filing for a P-1 group, the petitioner certifies that at least 75 percent of the group members have been performing ",
        "regularly together for at least 1 year.  The 1-year requirement does not apply to circus groups coming to perform with ",
        "nationally recognized circuses.",
        "Attach a separate statement to the form to request a waiver of:",
        "1. The 1-year relationship requirement due to exigent circumstances; or",
        "2. The international recognition requirement (1) due to emergent circumstances, or (2) because the group has been ",
        "nationally recognized as outstanding in its discipline for a sustained and substantial period of time.",
        "P-2 Nonimmigrants",
        "The P-2 classification is for beneficiaries coming to the United States temporarily to perform as an artist or ",
        "entertainer, individually or as part of a group, under a reciprocal exchange program between an organization in ",
        "the United States and an organization in another country.",
        "Write P-2 in the classification block.",
        "Including more than one beneficiary in a petition.  You may include up to 25 beneficiaries on the same petition, ",
        "provided that the beneficiaries are all members of a group.  If you seek P-2 classification for more than 25 beneficiaries, ",
        "you must file more than one petition.",
        "The petition must be filed by the sponsoring organization or U.S. employer with:",
        "1. A written consultation (see General Evidence);",
        "2. A copy of the reciprocal exchange program agreement;",
        "3. A statement from the sponsoring organization describing the reciprocal agreement as it relates to the petition;",
        "4. Evidence that the beneficiary and the U.S. artist or group have comparable skills and that the terms of employment are ",
        "similar; and",
        "5. Evidence that an appropriate labor organization in the United States was involved in negotiating or concurred with the ",
        "exchange.",
        "P-3 Nonimmigrants",
        "The P-3 classification is for beneficiaries coming to the United States temporarily to perform, teach, or coach, ",
        "individually or as part of a group, in the arts or entertainment fields in a program that is culturally unique and ",
        "which will further the understanding or development of the art form.",
        "Write P-3 in the classification block.",
        "Including more than one beneficiary in a petition.  You may include up to 25 beneficiaries on the same petition, ",
        "provided that the beneficiaries are all members of a group.  If you seek P-3 classification for more than 25 beneficiaries, ",
        "you must file more than one petition.",
        "The petition must be filed with:",
        "1. A written consultation (see General Evidence);",
        "2. Evidence that all performances will be culturally unique events; and either",
        "",
        "Form I-129 Instructions   04/01/24 Page 22 of 30",
        "A. Affidavits, testimonials, or letters from recognized experts attesting to the authenticity of the beneficiary’s or ",
        "group’s skills in performing, presenting, coaching, or teaching art forms; or",
        "B. Documentation that the performance of the beneficiary or group is culturally unique as evidenced by actual ",
        "reviews in newspapers, journals, or other published material.",
        "Essential Support Personnel",
        "The P-1S, P-2S, or P-3S classification are for beneficiaries coming to the United States temporarily as essential and ",
        "integral parts of the competition or performance of a principal P-1 athlete, athletic team or entertainment group, P-2, or ",
        "P-3 entertainer or entertainment group, because they perform support services which cannot be readily performed by ",
        "a U.S. worker and which are essential to the successful performance or services of the principal P-1, P-2, or P-3.  The ",
        "accompanying personnel must have appropriate qualifications, prior experience and critical knowledge of the specific ",
        "services to be performed by the principal P-1, P-2, or P-3 petition.",
        "Write P-1S, P-2S, or P-3S as appropriate in the classification block.",
        "Including more than one beneficiary in a petition.  You may include up to 25 beneficiaries on the same petition if they ",
        "will provide essential support to P-1, P-2, or P-3 beneficiaries performing in the same location and in the same occupation.  ",
        "If you seek P-1, P-2, or P-3 classification for more than 25 beneficiaries, or seek different classifications for each ",
        "beneficiary, you must file more than one petition.",
        "The petition must be filed with:",
        "1. A written consultation (see General Evidence);",
        "2. Evidence of the beneficiary’s qualifications to perform the services, if any;",
        "3. A statement describing the beneficiary’s critical knowledge of the specific services to be performed and prior ",
        "experience with the principal P-1, P-2, or P-3;",
        "4. Statements or affidavits from persons with first-hand knowledge that the beneficiary has had experience performing ",
        "the critical skills and essential support services for the principal P-1, P-2, or P-3; and",
        "5. A copy of any written contract between the employer and the beneficiary or a summary of the terms of the oral ",
        "agreement under which the beneficiary will be employed.",
        "Q-1 Nonimmigrants",
        "The Q-1 classification is for beneficiaries coming to the United States temporarily to participate in an international ",
        "cultural exchange program for the purpose of providing practical training, employment, and the sharing of the ",
        "history, culture, and traditions of the country of the beneficiary’s nationality.",
        "The culture sharing must take place in a school, museum, business, or other establishment where the public, or a segment ",
        "of the public sharing a common cultural interest, is exposed to aspects of a foreign culture as part of a structured program.",
        "The work component of the program may not be independent of the cultural component, but must serve as the vehicle to ",
        "achieve the objectives of the cultural component.  An employer (U.S. or foreign firm, corporation, nonprofit organization, ",
        "or other legal entity) or its designated agent may file the petition.  If a designated agent is filing the petition, that agent ",
        "must be employed by the qualified employer on a permanent basis in an executive or managerial capacity and must be ",
        "either a U.S. citizen or lawful permanent resident.",
        "Write Q-1 in the classification block on the petition.",
        "The petition must be filed with evidence showing that the employer:",
        "1. Maintains an established international cultural exchange program;",
        "2. Has designated a qualified employee to administer the program and serve as a liaison with USCIS;",
        "3. Is actively doing business in the United States;",
        "4. Will offer the beneficiary wages and working conditions comparable to those accorded local domestic workers ",
        "similarly employed; and",
        "5. Has the financial ability to remunerate the participants.",
        "",
        "Form I-129 Instructions   04/01/24 Page 23 of 30",
        "To demonstrate that the petitioner has an established international cultural exchange program, submit program ",
        "documentation, such as catalogs, brochures, or other types of material.",
        "To demonstrate financial ability to remunerate the participants, submit your organization’s most recent annual report, ",
        "business income tax return, or other form of certified accountant’s report.",
        "If the proposed dates of employment are within the same calendar year of a previously approved Q-1 petition filed for the ",
        "same international cultural exchange program, a copy of the approval notice for that prior petition may be submitted in ",
        "lieu of the required evidence about the program described above.",
        "R-1 Nonimmigrants",
        "The R-1 classification is for beneficiaries coming to the United States temporarily to be employed at least part time ",
        "(average of at least 20 hours per week) by a bona fide nonprofit religious organization in the United States (or a ",
        "bona fide organization that is affiliated with the religious denomination in the United States) to work:",
        "1. Solely as a minister;",
        "2. In a religious vocation; or",
        "3. In a religious occupation.",
        "To qualify, the beneficiary must have been a member of a religious denomination that has a bona fide nonprofit religious ",
        "organization in the United States, for at least 2 years immediately preceding the filing of the petition.",
        "Write R-1 in the classification block.",
        "Petitions for R-1 classification may not include more than one beneficiary.",
        "The petition must be filed by a U.S. employer with:",
        "1. Evidence relating to the petitioning organization:",
        "A. Currently valid determination letter from the Internal Revenue Service (IRS) establishing that the organization is a ",
        "tax-exempt organization; or",
        "B. For a religious organization that is recognized as tax-exempt under a group tax-exemption, a currently valid ",
        "determination letter from the IRS establishing that the group is tax exempt; or",
        "C. For a bona fide organization that is affiliated with the religious denomination, if the organization was granted ",
        "tax-exempt status under section 501(c)(3) of the Internal Revenue Code (IRC) of 1986, or any subsequent ",
        "amendments or equivalent sections of prior enactments of the IRC, as something other than a religious ",
        "organization",
        "(1) A currently valid determination letter from the IRS establishing that the organization is a tax-exempt ",
        "organization;",
        "(2) Documentation that establishes the religious nature and purpose of the organization, such as a copy of the ",
        "organizing instrument of the organization that specifies the purposes of the organization;",
        "(3) Organizational literature, such as books, articles, brochures, calendars, flyers, and other literature describing ",
        "the religious purpose and nature of the activities of the organization; and",
        "(4) Religious Denomination Certification, which is part of the R-1 Classification Supplement to Form I-129, ",
        "completed, signed, and dated by the religious organization certifying that the petitioning organization is ",
        "affiliated with the religious denomination.",
        "2. Employer Attestation, which is part of the R-1 Classification Supplement to Form I-129, completed, signed, and dated ",
        "by an authorized official of the petitioner;",
        "3. Verifiable evidence of how the petitioner intends to compensate the beneficiary, including salaried or non-salaried ",
        "compensation;",
        "4. If the beneficiary will be self-supporting, the petitioner must submit documentation establishing that the position the ",
        "beneficiary will hold is part of an established program for temporary, uncompensated missionary work, which is part ",
        "of a broader international program of missionary work sponsored by the denomination;",
        "",
        "Form I-129 Instructions   04/01/24 Page 24 of 30",
        "5. Evidence that the beneficiary has been a member in the religious denomination during at least the 2 years immediately ",
        "preceding the filing of the petition; and",
        "6. Evidence to establish the beneficiary is qualified to perform the duties of the offered position.",
        "Part 2.  Petition Only Required for a Nonimmigrant in the United States to Change Status or Extend ",
        "Stay",
        "The following classifications listed in this Part 2. do not require a petition for new employment if the applicant is outside ",
        "the United States.",
        "Use this Form I-129 when the beneficiary is physically present in the United States and a change of status, concurrent ",
        "employment, or an extension of stay is needed.  Note:  The beneficiary must be maintaining lawful status in the United ",
        "States to remain eligible for the benefit sought.",
        "E-1 Nonimmigrants",
        "The E-1 classification is for nonimmigrants who are nationals of a country with which the United States maintains ",
        "a qualifying treaty or an international agreement, or which has been deemed a qualifying country by legislation, ",
        "and who are coming to the United States to carry on substantial trade principally between the United States and ",
        "the nonimmigrants’s country of nationality.  The Department of State maintains a list of countries with qualifying ",
        "treaties.  See https://travel.state.gov/content/visas/en/fees/treaty.html for a list of qualifying countries.",
        "Write E-1 in the classification block.",
        "Qualifying trade involves the commercial exchange of goods or services in the international market place.  Substantial ",
        "trade is an amount of trade sufficient to ensure continuous flow of international trade items between the United States and ",
        "the treaty country.  Principal trade exists when more than 50 percent of the E-1’s total volume of international trade is ",
        "conducted between United States and the treaty country.",
        "An employee of an E-1 treaty trader who possesses the same nationality as the E-1 employer may also be classified as E-1.  ",
        "The employee must principally and primarily perform executive or supervisory duties or possess special qualifications that ",
        "are essential to the successful or efficient operation of the enterprise.  The E-1 employee may perform work for the parent ",
        "treaty organization or enterprise, or any subsidiary of the parent organization or enterprise.",
        "The petition must be filed with evidence of:",
        "1. Ownership and Nationality of the E-1 treaty trader.  Such evidence may include, but is not limited to, lists of ",
        "investors with current status and nationality, stock certificates, certificate of ownership issued by the commercial ",
        "section of a foreign embassy, and reports from a certified personal accountant;",
        "2. Substantial Trade.  Evidence of substantial trade may include, but is not limited to, copies of three or more of the ",
        "following:  bills of lading, customs receipts, letter of credit, trade brochures, purchase orders, insurance papers, ",
        "documenting commodities imported, carrier inventories, and/or sales contracts, or other probative documentation ",
        "establishing the requisite substantial trade; and",
        "3. For E-1 employees only:  Executive or Supervisory Duties or special qualification essential to the enterprise.  ",
        "Evidence of such duties or qualifications may include, but is not limited to, certificates, diplomas or transcripts, letters ",
        "from employers describing job titles, duties, operators’ manuals, and the required level of education and knowledge.",
        "E-2 Nonimmigrants",
        "The E-2 classification is for nonimmigrants who are nationals of a country with which the United States ",
        "maintains a qualifying treaty or an international agreement, or which has been deemed a qualifying ",
        "country by legislation, and who are coming to the United States to develop and direct the operations of an ",
        "enterprise in which the nonimmigrant has invested or is actively in the process of investing a substantial ",
        "amount  of  capital.    The  Department  of  State  maintains  a  list  of  countries  with  qualifying  treaties.    See                                                     ",
        "https://travel.state.gov/content/visas/en/fees/treaty.html for a list of qualifying countries.",
        "Write E-2 in the classification block.",
        "",
        "Form I-129 Instructions   04/01/24 Page 25 of 30",
        "An E-2 must demonstrate possession and control of capital and the ability to develop and direct the investment enterprise ",
        "and the ability to develop and direct the investment enterprise.  Capital in the process of being invested or that has been ",
        "invested must be placed at risk and be irrevocably committed to the enterprise.  The enterprise must be a real, active, and ",
        "operating commercial or entrepreneurial undertaking that produces services or goods for profit.  The investment must be ",
        "substantial and the funds must not have been obtained, directly or indirectly, from criminal activity.  The enterprise must ",
        "be more than marginal.",
        "An employee of an E-2 who possesses the same nationality as the E-2 employer may also be classified as E-2.  The ",
        "employee must principally and primarily perform executive or supervisory duties or possess special qualifications that are ",
        "essential to the successful or efficient operation of the enterprise.",
        "The petition must be filed with evidence of:",
        "1. Ownership and Nationality of the E-2 treaty investor.  Such evidence may include, but is not limited to, lists of ",
        "investors with current status and nationality, stock certificates, certificate of ownership issued by the commercial ",
        "section of a foreign embassy, and reports from a certified personal accountant;",
        "2. Substantial investment.  Such evidence may include, but is not limited to, copies of partnership agreements (with a ",
        "statement on proportionate ownership), articles of incorporation, payments for the rental of business premises or office ",
        "equipment, business licenses, stock certificates, office inventories (goods and equipment purchased for the business), ",
        "insurance appraisals, annual reports, net worth statements from certified profession accountants, advertising invoices, ",
        "business bank accounts containing funds for routine operations, funds held in escrow; and",
        "3. For E-2 employees only:  Executive or Supervisory Duties or special qualifications essential to the enterprise.  ",
        "Evidence of such duties or qualifications may include, but is not limited to, certificates, diplomas or transcripts, letters ",
        "from employers describing job titles, duties, operators’ manuals, and the required level of education and knowledge.",
        "Advice on E-1 and E-2 petitions",
        "You must obtain approval from USCIS when substantive changes occur in the terms or conditions of the status of the ",
        "treaty trader, investor, or E employee.  To do this, file Form I-129 and E-1/E-2 Classification Supplement, with fee, and ",
        "request an extension of stay.",
        "You may seek advice from USCIS to determine whether changes in the terms or conditions in E status are substantive.  ",
        "To obtain advice, file Form I-129 and E-1/E-2 Classification Supplement, with fee.  Answer “Yes” to the question on the ",
        "Supplement which asks whether you are seeking advice.",
        "Free Trade Nonimmigrants (H-1B1 and TNs)",
        "The Free Trade Nonimmigrant classifications (H-1B1 and TN) are temporary nonimmigrant classifications based on the ",
        "provisions of a Free Trade Agreement between the United States and the nonimmigrant’s country of citizenship.  Currently ",
        "there are two stand-alone Free Trade Nonimmigrant classifications available:  TN and H-1B1.",
        "The TN nonimmigrant classification is for nonimmigrants who are citizens of Canada or Mexico covered by the ",
        "United States-Mexico-Canada Agreement (“USMCA” formerly North American Free Trade Agreement) coming to ",
        "the United States to engage temporarily in business activities at a professional level.  Depending on the specific type ",
        "of business activity, a TN must at least have a bachelor’s degree or, in certain limited instances, other appropriate ",
        "credentials which demonstrate status as a professional.  The acceptable types of TN business activities at a ",
        "professional level are listed at 8 CFR 214.6(c).",
        "Write TN in the classification block.",
        "Documentary evidence must be submitted if the applicant is a citizen of Canada and is currently outside the United States ",
        "OR if the applicant is a citizen of Canada or Mexico and is requesting a “Change of Status” to TN.  The applicant must ",
        "submit evidence demonstrating that he or she will be engaged in business activities at a professional level and that the ",
        "applicant possesses the requisite professional qualifications.  Acceptable evidence may include, but is not limited to, the ",
        "following:",
        "1. A letter from the employer stating the activity the beneficiary will be engaged in, the anticipated length of stay, and ",
        "the arrangements for remuneration;",
        "2. A copy of the beneficiary’s last two pay stubs and W-2 if employed in the United States; and",
        "3. Evidence the beneficiary meets the educational and/or licensing requirements for the profession or occupation.",
        "",
        "Form I-129 Instructions   04/01/24 Page 26 of 30",
        "NOTE:  While a petition is not required, citizens of Canada who are outside the United States may use this form to apply ",
        "for TN status.",
        "If the applicant is a citizen of Canada or Mexico and is requesting an “Extension of Stay” in TN classification, submit ",
        "evidence, such as a letter, describing the continuing employment and evidence of the beneficiary’s continued valid ",
        "licensing (if required by the profession and/or the state).",
        "The H-1B1 classification is for nonimmigrants from Chile or Singapore coming to the United States temporarily ",
        "to perform services in a specialty occupation.  See the instructions for H-1B nonimmigrants for the definition of ",
        "“specialty occupation.”",
        "Write H-1B1 in the classification block.",
        "Submit all evidence listed in the H Classification Supplement to Form I-129 under Section 1., Complete This Section If ",
        "Filing for H-1B Classification, as well as evidence listed in the section of the instructions for H-1B specialty occupation ",
        "classification.  The following supplements must be filed with the petition:",
        "1. Nonimmigrant Classification Based on a Trade Agreement Supplement; and",
        "2. H Classification Supplement; and",
        "3. H-1B Data Collection and Filing Fee Exemption Supplement.",
        "If requesting an “Extension of Stay,” submit evidence, such as a letter describing the continuing employment, as well ",
        "as evidence of the beneficiary’s continued valid licensing (if required by the profession and/or the state).  Also, if this ",
        "extension is the 6th consecutive extension requested for this beneficiary, a statement to that effect should be provided.",
        "Change of Status",
        "A petition for change of status to one of the classifications described in this section must be submitted with the initial ",
        "evidence detailed above and with the initial evidence required by the separate instructions for all petitions involving ",
        "change of status.",
        "Extension of Stay",
        "A petition requesting an extension of stay for an employee in the United States must be filed with a copy of the ",
        "beneficiary’s Form I-94, Nonimmigrant Arrival/Departure Record, and a letter from the petitioner explaining the reasons ",
        "for the extension.  Consult the regulations that relate to the specific nonimmigrant classification sought.",
        "NOTE:  Dependent family members should use Form I-539 to file for an extension of stay.",
        "A nonimmigrant who must have a passport to be admitted must maintain a valid passport during his or her entire stay.  If ",
        "a required passport is not valid, include a full explanation with your petition.  A petition requesting an extension must be ",
        "filed with:",
        "1. The appropriate supplements for the classification;",
        "2. A letter describing the proffered employment;",
        "3. A copy of the beneficiary’s last 2 pay stubs and most recent W-2, if applicable;",
        "4. Evidence the beneficiary continues to meet the licensing requirements for the profession or occupation, if applicable;",
        "5. If requesting an extension of H-1B status (including H1B1 Chile/Singapore), evidence that the Department of Labor ",
        "has certified a labor condition application for the specialty occupation which is valid for the period of time requested;",
        "6. If requesting H-2A status, submit a U.S. Department of Labor approved temporary labor certification valid for ",
        "the dates of the extension, unless it is based on a continuation of previously approved employment due to exigent ",
        "circumstances and the extension will last no longer than 2 weeks;",
        "7. If requesting H-2B status, submit a U.S. Department of Labor approved temporary labor certification valid for the ",
        "dates of extension.",
        "",
        "Form I-129 Instructions   04/01/24 Page 27 of 30",
        "Special Considerations for Beneficiaries Residing in CNMI",
        "A nonimmigrant who was admitted to the CNMI prior to November 28, 2009 may not currently hold a Federal ",
        "nonimmigrant classification that permits a change of status.  However, in certain situations, a petitioner may request ",
        "that the beneficiary be granted initial status in the CNMI.  This will allow certain beneficiaries who were present in the ",
        "CNMI prior to the  transition date and are currently lawfully present in the CNMI with a valid unexpired CNMI status to ",
        "be granted an initial status without having to depart the CNMI.  Additionally, a nonimmigrant who is currently in parole ",
        "status in the CNMI may also be granted an initial status in the CNMI.",
        "The E-2 CNMI investor regulations permit a petitioner to request that the nonimmigrant be granted an initial E-2 CNMI ",
        "investor status in the CNMI.  In addition to the classification requirements, the petitioner must submit documentation that ",
        "the beneficiary is currently lawfully present in the CNMI.",
        "The regulations indicate that if the beneficiary is lawfully present in the CNMI the beneficiary may apply for a change ",
        "of status with this form without having to seek consular processing.  In addition to the classification requirements, the ",
        "petitioner must submit documentation that the beneficiary is currently lawfully present in the CNMI.",
        "A petition for a grant of initial status for a beneficiary currently in the CNMI with a CNMI issued permit must have been ",
        "filed on or before November 27, 2011.",
        "Written Consultation for O and P Nonimmigrants",
        "Written consultation.  Certain classifications require a written consultation with a recognized peer group, labor, and/ or ",
        "management organization regarding the nature of the work to be done and the beneficiary’s qualifications before USCIS ",
        "can approve the petition.",
        "To obtain timely adjudication of a petition, you should obtain a written advisory opinion from an appropriate peer group, ",
        "labor, and/or management organization and submit it with the petition.",
        "If you file a petition without the advisory opinion, you will need to send a copy of the petition and all supporting ",
        "documents to the appropriate organization when you file the petition with USCIS, and name that organization in the ",
        "petition.  Explain to the organization that USCIS will contact them for an advisory opinion.",
        "If you do not know the name of an appropriate organization with which to consult, indicate that on the petition.  However, ",
        "a petition filed without the actual advisory opinion will require substantially longer processing time.",
        "Liability for Return Transportation",
        "The Immigration and Nationality Act makes a petitioner liable for the reasonable cost of return transportation for an H-1B, ",
        "H-2B, O, and P beneficiary who is dismissed before the end of the period of authorized admission.",
        "When To File?",
        "Generally, a Form I-129 petition may not be filed more than 6 months prior to the date employment is scheduled to begin. ",
        "Petitioners should review the appropriate regulatory provisions in 8 CFR that relate to the nonimmigrant classification ",
        "sought.",
        "Where To File?",
        "Regular Processing:",
        "Please see our website at www.uscis.gov/I-129 for the most current information about where to file this petition.",
        "",
        "Form I-129 Instructions   04/01/24 Page 28 of 30",
        "Premium Processing:",
        "To determine if your requested classification or category is available for Premium Processing, please visit the USCIS ",
        "website at www.uscis.gov/forms/how-do-i-use-premium-processing-service.  If you are requesting Premium Processing ",
        "Services, you must also file Form I-907, Request for Premium Processing Service, with the filing fee.",
        "Address Change",
        "If you are not a U.S. citizen, you must notify USCIS of your new address within 10 days of moving from your previous ",
        "residence.  For information on changing your address, go to our website at www.uscis.gov/addresschange, or call the ",
        "USCIS Contact Center.",
        "NOTE:  Do not submit a change of address request to the USCIS Lockbox.",
        "Processing Information",
        "Acceptance.  Any petition that is not signed or accompanied by the correct fee will be rejected with a notice that the ",
        "petition is deficient.  You may correct the deficiency and resubmit the petition.  A petition is not considered properly filed ",
        "until accepted by USCIS.",
        "Initial Processing.  Once USCIS accepts your petition, we will check it for completeness.  If you do not properly ",
        "complete this petition, you will not establish a basis for your eligibility and we may reject or deny your petition.",
        "Service Processing Information.  Our goal at USCIS is to process all petitions fairly.  The processing time will vary, ",
        "depending on the specific circumstances of each case.  We may reject an incomplete petition.  We may deny your petition ",
        "if you do not give us the requested information.",
        "Requests for More Information.  USCIS may request that you provide more information or evidence to support your ",
        "petition.  We may also request that you provide the originals of any copies you submit.  If we request an original document ",
        "from you, we will return it to you after USCIS determines it is no longer needed.",
        "Requests for Interview.  USCIS may request that you appear at a USCIS office for an interview based on your petition.  ",
        "During your interview, USCIS may require you to provide your biometrics to verify your identity and/or update ",
        "background and security checks. ",
        "Decision.  The decision on Form I-129 involves a determination of whether you have established eligibility for the ",
        "immigration benefit you are seeking.  USCIS will notify you of our decision in writing.",
        "USCIS Forms and Information",
        "To ensure you are using the latest version of this petition, visit www.uscis.gov. ",
        "",
        "Form I-129 Instructions   04/01/24 Page 29 of 30",
        "Penalties",
        "If you knowingly and willfully falsify or conceal a material fact or submit a false document with your Form I-129, we will ",
        "deny your petition and may deny any other immigration benefit.  In addition, you will face severe penalties provided by ",
        "law and may be subject to criminal prosecution.",
        "USCIS Compliance Review and Monitoring",
        "By signing this petition, you have stated under penalty of perjury (28 U.S.C. section 1746) that all information and ",
        "documentation submitted with this petition are complete, true, and correct.  Y",
        "ou also authorize the release of any ",
        "information from your records that USCIS may need to determine your eligibility for the immigration benefit you are ",
        "seeking and consent to USCIS verifying such information.",
        "The Department of Homeland Security (DHS) has the authority to verify any information you submit to establish ",
        "eligibility for the immigration benefit you are seeking at any time.  Our legal authority to verify this information is in  ",
        "8 U.S.C. sections 1103, 1154, 1155, and 1184, and 8 CFR parts 103, 204, 205, and 214.  To ensure compliance with ",
        "applicable laws and authorities, we may verify information before or after your case is decided. ",
        "Agency verification methods may include, but are not limited to:  reviewing public records and information; contacting ",
        "through written correspondence; using the internet, fax, other electronic transmission, or telephone; making unannounced ",
        "physical site inspections of residences and locations of employment; and interviewing people.  USCIS will use the ",
        "information we obtain to assess your compliance with the laws and to determine your eligibility for an immigration ",
        "benefit.",
        "Subject to the restrictions under 8 CFR 103.2(b)(16), USCIS will provide you with an opportunity to address any adverse ",
        "or derogatory information that may result from a compliance review, verification, or site visit before a decision is made ",
        "on your request.  For a visit after your request is approved, USCIS will provide you with an opportunity to address any ",
        "adverse or derogatory information which may result in revocation or termination of an approval.",
        "DHS Privacy Notice",
        "AUTHORITIES:  The information requested on this petition and the associated evidence, is collected under 8 U.S.C. ",
        "sections 1154, 1184, and 1258.",
        "PURPOSE:  The primary purpose for providing the requested information on this petition is to petition USCIS for a ",
        "nonimmigrant worker to come temporarily to the United States to perform services or labor or to receive training.  DHS ",
        "will use the information you provide to grant or deny the immigration benefit you are seeking.",
        "DISCLOSURE:  The information you provide is voluntary.  However, failure to provide the requested information, ",
        "including your Social Security number (if applicable), and any requested evidence, may delay a final decision or result in ",
        "denial of your petition. ",
        "ROUTINE USES:  DHS may share the information you provide on this petition and any additional requested evidence ",
        "with other Federal, state, local, and foreign government agencies and authorized organizations.  DHS follows approved ",
        "routine uses described in the associated published system of records notices [DHS/USCIS/ICE/CBP-001 Alien File, Index, ",
        "and National File Tracking System and DHS/USCIS-007 Benefits Information System, and DHS/USCIS-018 Immigration ",
        "Biometric and Background Check] and the published privacy impact assessments [DHS/USCIS/PIA-016(a) Computer ",
        "Linked Application Information Management System and Associated Systems] which you can find at www.dhs.gov/privacy.  ",
        "DHS may also share this information, as appropriate, for law enforcement purposes or in the interest of national security.",
        "",
        "Form I-129 Instructions   04/01/24 Page 30 of 30",
        "Paperwork Reduction Act",
        "USCIS may not conduct or sponsor an information collection, and you are not required to respond to a collection of ",
        "information unless it displays a currently valid OMB control number.  The public reporting burden for this collection ",
        "of information is estimated for Form I-129 at 2.487 hours; E-1/E-2 Classification at 0.67 hours; Trade Agreement ",
        "Supplement at 0.67 hours; H Classification Supplement at 2.07 hours; H-1B and H-1B1 Data Collection and Filing Fee ",
        "Exemption Supplement at 1 hour; L Classification Supplement to Form I-129 at 1.34 hours; P Classifications Supplement ",
        "to Form I-129 at 1 hour; Q-1 Classification Supplement at 0.34 hours; R-1 Classification Supplement at 2.34 hours; ",
        "and Form I-129 ATT at 0.33 hours, including the time for reviewing instructions, gathering the required documentation ",
        "and information, completing the petition, preparing statements, attaching necessary documentation, and submitting the ",
        "petition.  Send comments regarding this burden estimate or any other aspect of this collection of information, including ",
        "suggestions for reducing this burden to:  U.S. Citizenship and Immigration Services, Office of Policy and Strategy, ",
        "Regulatory Coordination Division, 5900 Capital Gateway Drive, Mail Stop #2140, Camp Springs, MD 20588-0009; OMB ",
        "No 1615-0009.  Do not mail your completed Form I-129 to this address."
    ]
}