{
    "content": "\n    <iframe src=\"https://www.googletagmanager.com/ns.html?id=GTM-WK8MXNN\"\n                  height=\"0\" width=\"0\" style=\"display:none;visibility:hidden\"></iframe>\n\n      \n    \n\n\n\n\n\n  \n\n  \n        \n      Skip to main content\n    \n\n    \n          \n        \n            \n      \n    \n        \n                      \n\n\nAn official website of the United States government    Here's how you know\n\n\n      \n      \n\n  \n\n            \n      \n    \n        \n          Español\n      \n  \n    \n        \n                      \n  \n  \n   Multilingual Resources\n\n\n      \n      \n\n  \n\n        \n      \n    \n          \n        \n            \n      \n    \n        \n                      \n\n\n\nOfficial websites use .gov\nA .gov website belongs to an official government organization in the United States.\n\n\n\n\n\n\n\nSecure .gov websites use HTTPS\nA lock ( A locked padlock  ) or https:// means you've safely connected to the .gov website. Share sensitive information only on official, secure websites.\n\n\n\n      \n      \n\n  \n\n        \n      \n    \n    \n              \n      \n      \n          \n      \n    \n        \n          \n      \n        \n      \n    \n      \n  \n  \n    \n        \n                      \n\n//<![CDATA[\n\n    \n//]]>\n \n\n\n\n\n\n\n\nSign In  \n\n\n\n\nAccess USCIS online services.\n\n\nSign In\n\tCreate Account\n\n\n\n\n\n      \n      \n\n  \n\n        Menu\n      \n\n      \n        \n          \n        \n          \n      \n    \n        \n                      Sign In \n\nCreate Account\n\n      \n      \n\n\n        \n          Topics      \n        Topics\n        \n                \n    \n        \n          Family                    \n    \n        \n          Family of Green Card Holders (Permanent Residents)              \n            \n\n        \n          Family of Refugees and Asylees              \n            \n\n        \n          Family of U.S. Citizens              \n            \n\n  \n\n  \n\n\n\n            \n\n        \n          Adoption                    \n    \n        \n          Before You Start              \n            \n\n        \n          Immigration through Adoption              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Military                    \n    \n        \n          Citizenship for Military Family Members              \n            \n\n        \n          Naturalization Through Military Service              \n            \n\n  \n\n  \n\n\n\n            \n\n        \n          Humanitarian                    \n    \n        \n          Humanitarian Parole              \n            \n\n        \n          Refugees and Asylum              \n            \n\n        \n          Temporary Protected Status              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Visit the U.S.                    \n    \n        \n          Change My Nonimmigrant Status              \n            \n\n        \n          Extend Your Stay              \n            \n\n  \n\n  \n\n\n\n            \n\n        \n          Working in the United States                    \n    \n        \n          Permanent Workers              \n            \n\n        \n          Temporary (Nonimmigrant) Workers              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Avoid Scams                    \n    \n        \n          Common Scams              \n            \n\n        \n          Find Legal Services              \n            \n\n        \n          Report Immigration Scams              \n            \n\n  \n\n  \n\n\n\n            \n\n        \n          Careers at USCIS                    \n    \n        \n          Career Opportunities              \n            \n\n        \n          Special Hiring Programs              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n        \n          Forms      \n        Forms\n        \n                \n    \n        \n          Most Accessed Forms                    \n    \n        \n          I-485, Application to Register Permanent Residence or Adjust Status              \n            \n\n        \n          I-765, Application for Employment Authorization              \n            \n\n        \n          I-90, Application to Replace Permanent Resident Card (Green Card)              \n            \n\n        \n          N-400, Application for Naturalization              \n            \n\n  \n\n  \n\n\n\n            \n\n        \n          All Forms              \n            \n\n        \n          File Online              \n            \n\n  \n\n  \n\n    \n    \n        \n          Family Based Forms                    \n    \n        \n          I-129F, Petition for Alien Fiancé(e)              \n            \n\n        \n          I-130, Petition for Alien Relative              \n            \n\n        \n          I-360, Petition for Amerasian, Widow(er), or Special Immigrant              \n            \n\n        \n          I-600, Petition to Classify Orphan as an Immediate Relative              \n            \n\n        \n          I-751, Petition to Remove Conditions on Residence              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Employment Based Forms                    \n    \n        \n          I-9, Employment Eligibility Verification              \n            \n\n        \n          I-129, Petition for a Nonimmigrant Worker              \n            \n\n        \n          I-140, Immigrant Petition for Alien Workers              \n            \n\n        \n          I-526, Immigrant Petition by Standalone Investor              \n            \n\n        \n          I-539, Application to Extend/Change Nonimmigrant Status              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Humanitarian Based Forms                    \n    \n        \n          I-134A, Online Request to be a Supporter and Declaration of Financial Support              \n            \n\n        \n          I-589, Application for Asylum and for Withholding of Removal              \n            \n\n        \n          I-730, Refugee/Asylee Relative Petition              \n            \n\n        \n          I-821, Application for Temporary Protected Status              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n        \n          Newsroom      \n        Newsroom\n        \n                \n    \n        \n          All News                    \n    \n        \n          Alerts              \n            \n\n        \n          Fact Sheets              \n            \n\n        \n          News Releases              \n            \n\n        \n          Stakeholder Messages              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Media Contacts              \n            \n\n        \n          Multimedia Gallery              \n            \n\n        \n          Social Media Directory              \n            \n\n        \n          Speeches, Statements, Testimony              \n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n        \n          Citizenship      \n        Citizenship\n        \n                \n    \n        \n          Learners                    \n    \n        \n          Apply for Citizenship              \n            \n\n        \n          Learn About Citizenship              \n            \n\n        \n          Naturalization Test and Study Resources              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Educators                    \n    \n        \n          Educational Products for Educators              \n            \n\n        \n          Resources for Educational Programs              \n            \n\n        \n          Teacher Training Sessions              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Organizations                    \n    \n        \n          Outreach Tools              \n            \n\n        \n          Civic Integration              \n            \n\n        \n          Interagency Strategy for Promoting Naturalization              \n            \n\n        \n          Naturalization-Related Data and Statistics              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Grants                    \n    \n        \n          Learn About the Citizenship and Integration Grant Program              \n            \n\n        \n          Success Stories from Grant Recipients              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n        \n          Green Card      \n        Green Card\n        \n                \n    \n        \n          Green Card Processes and Procedures                    \n    \n        \n          Adjustment of Status              \n            \n\n        \n          After We Grant Your Green Card              \n            \n\n        \n          Employment Authorization Document              \n            \n\n        \n          Visa Availability and Priority Dates              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Green Card Eligibility Categories              \n            \n\n        \n          How to Apply for a Green Card              \n            \n\n        \n          Replace Your Green Card              \n            \n\n        \n          While Your Green Card Application Is Pending with USCIS              \n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n        \n          Laws      \n        Laws\n        \n                \n    \n        \n          Legislation                    \n    \n        \n          Immigration and Nationality Act              \n            \n\n  \n\n  \n\n\n\n            \n\n        \n          Class Action, Settlement Notices and Agreements              \n            \n\n        \n          Unlawful Presence and Inadmissibility              \n            \n\n        \n          Policy Manual              \n            \n\n  \n\n  \n\n    \n    \n        \n          Regulations              \n            \n\n        \n          Administrative Appeals              \n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n        \n          Tools      \n        Tools\n        \n                \n    \n        \n          Self-Help Tools                    \n    \n        \n          Check Case Processing Times              \n            \n\n        \n          Case Status Online              \n            \n\n        \n          Change of Address              \n            \n\n        \n          E-Request              \n            \n\n        \n          Password Resets and Technical Support              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Website Resources                    \n    \n        \n          Archive              \n            \n\n        \n          A-Z Index              \n            \n\n        \n          Website Policies              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Additional Resources                    \n    \n        \n          Explore my Options              \n            \n\n        \n          Immigration and Citizenship Data              \n            \n\n        \n          Multilingual Resource Center              \n            \n\n        \n          USCIS Tools and Resources              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n  \n\n\n  \n    \n        \n                      Contact us\n\tMultilingual Resources\n\t\n\n      \n      \n\n  \n\n      \n\n              \n          \n  \n\n      \n  \n  \n                    \n    \n\n  \n\n            \n\n      \n              \n                      \n                  \n            \n                  \n        \n                  \n                            \n    \n  \n\n                      \n        \n                  \n        \n        \n                                    \n                  \n    \n            \n  Main navigation\n  \n\n        \nSkip to main content\n\n      \n          Working in the United StatesInternational Entrepreneur RuleTemporary WorkersCW-1: CNMI-Only Transitional WorkerE-1 Treaty TradersE-2 CNMI InvestorE-2 Treaty InvestorsE-3 Certain Specialty Occupation Professionals from AustraliaH-1B Specialty OccupationsH-1B Cap SeasonFAQs for Individuals in H-1B Nonimmigrant StatusH-1B Electronic Registration ProcessOrganizational Accounts Frequently Asked QuestionsExtension of Post Completion Optional Practical Training (OPT) and F-1 Status for Eligible Students under the H-1B Cap-Gap RegulationsEmployment Authorization for Certain H-4 Dependent SpousesH-2A Agricultural WorkersH-2B Non-Agricultural WorkersH-3 Nonimmigrant TraineeI Representatives of Foreign MediaL-1A Intracompany Transferee Executive or ManagerL-1B Intracompany Transferee Specialized KnowledgeO-1 Individuals with Extraordinary Ability or AchievementO Nonimmigrant Classifications: Question and AnswersP-1A Internationally Recognized AthleteP-1B Member of Internationally Recognized Entertainment GroupP-2 Performer or Group Performing under Reciprocal Exchange ProgramP-3 Artist or Entertainer Part of a Culturally Unique ProgramQ Cultural ExchangeR-1 Temporary Religious WorkersTN NAFTA ProfessionalsPermanent WorkersEmployment-Based Immigration: First Preference EB-1Employment-Based Immigration: Second Preference EB-2Employment-Based Immigration: Third Preference EB-3Employment-Based Immigration: Fourth Preference EB-4Special Immigrant JuvenilesSpecial Immigrant Juvenile (SIJ) Frequently Asked QuestionsReligious WorkersEmployment-Based Immigration: Fifth Preference EB-5EB-5 Immigrant Investor Regional CentersEB-5 Integrity FundAbout the EB-5 Visa ClassificationEB-5 Immigrant Investor ProcessSTEM Employment PathwaysImmigrant Pathways for STEM Employment in the United StatesNonimmigrant Pathways for STEM Employment in the United StatesEntrepreneur Employment PathwaysImmigrant Pathways for Entrepreneur Employment in the United StatesNonimmigrant or Parole Pathways for Entrepreneur Employment in the United StatesStudents and Exchange VisitorsConrad 30 Waiver ProgramExchange VisitorsStudents and EmploymentTemporary Visitors for BusinessB-1 Temporary Business VisitorGB Temporary Business Visitor to GuamWB Temporary Business Visitor under Visa Waiver ProgramInformation for Employers and EmployeesAutomatic Employment Authorization Document (EAD) ExtensionDHS Support of the Enforcement of Labor and Employment LawsEmployer InformationEmployment AuthorizationVIBEEmployment Authorization in Compelling CircumstancesOptions for Nonimmigrant Workers Following Termination of EmploymentReport Labor AbusesPetition Process OverviewImportant Information About Working Legally in the United States    \n    \n  \n\n\n  \n\n  \n\n              \n                      \n          \n                            \n      \n    \n        \n            \n    Breadcrumb\n    \n              \n          Home        \n              \n          Working in the United States        \n              \n          Temporary Workers        \n              \n          H-1B Specialty Occupations        \n              \n          H-1B Electronic Registration Process        \n          \n  \n\n      \n\n  \n\n            \n            \n            \n                              \n              \n              \n                                    \n      \n    \n        \n          \n\n      \n                \n\n                        \n            \n              H-1B Electronic Registration Process\n            \n          \n              \n                    \n      \n  \n                      \n\n\n\n  \n  Alert Type info\n    \n              ALERT: As of April 1, 2024, USCIS service centers are no longer accepting Form I-129 petitions requesting H-1B or H-1B1 (HSC) classification.We will reject H-1B or H-1B1 (HSC) petitions received at a USCIS service center on or after April 1, 2024. There will be no grace period provided.As of April 1, 2024, all paper-filed Form I-129 petitions requesting H-1 or H-1B1 (HSC) classification, including those with a concurrent Form I-907, Request for Premium Processing Service, and those with concurrently filed Form I-539 and/or Form I-765, must be filed at a USCIS lockbox facility. You can find the lockbox filing addresses for paper-filed forms on our Form I-129 Direct Filing Addresses page.If you are filing Form I-129 alone or with Form I-907, you may also file online. On March 25, USCIS launched online filing of Form I-129 and associated Form I-907 for non-cap H-1B petitions. On April 1, USCIS began accepting online filing for H-1B cap petitions and associated Forms I-907 for petitioners whose registrations have been selected.  To file online, visit myaccount.uscis.gov.In addition, on Feb. 28, 2024, USCIS launched new USCIS organizational accounts that allow multiple people within a company and their legal representatives to collaborate and prepare H-1B registrations, online H-1B petitions, and associated online requests for premium processing.\n          \n      \n\nProspective petitioners seeking to file H-1B cap-subject petitions, including for beneficiaries eligible for the advanced degree exemption, must first electronically register and pay the associated H-1B registration fee for each prospective beneficiary. See Fee Schedule, Form G-1055.The electronic registration process streamlines processing by reducing paperwork and data exchange and provides overall cost savings to employers seeking to file H-1B cap-subject petitions.Under this process, prospective petitioners (also known as registrants), and their authorized representatives, who are seeking to employ H-1B workers subject to the cap, complete a registration process that requires basic information about the prospective petitioner and each requested worker. The initial registration period is for a minimum of 14 calendar days each fiscal year. The H-1B selection process is then run on properly submitted electronic registrations. Only those with selected registrations are eligible to file H-1B cap-subject petitions.On Jan. 30, 2024, USCIS announced a final rule to strengthen integrity and reduce the potential for fraud in the H-1B registration process, including by ensuring each beneficiary would have the same chance of being selected, regardless of the number of registrations submitted on their behalf. The final rule created a beneficiary-centric selection process for registrations by employers, codified start date flexibility for certain petitions subject to the congressionally mandated H-1B cap, and added more integrity measures related to the registration process.Under the beneficiary-centric process, registrations are selected by unique beneficiary rather than by registration. The final rule went into effect on March 4, 2024, and applied to the fiscal year (FY) 2025 registration process. Starting with the FY 2025 initial registration period, USCIS is requiring registrants to provide valid passport information or valid travel document information for each beneficiary. The passport or travel document provided must be the one the beneficiary, if or when abroad, intends to use to enter the United States if issued an H-1B visa. Each beneficiary must only be registered under one passport or travel document. Only those with selected registrations are eligible to file H-1B cap-subject petitions. For additional information on the passport or valid travel document requirement, please see the Frequently Asked Questions section below.Selections take place after the initial registration period closes, so there is no requirement to register on the day the initial registration period opens.FY 2025 H-1B Cap Registration Process UpdateAs we announced on April 1, 2024, we received enough electronic registrations during the initial registration period to reach the fiscal year 2025 H-1B numerical allocations (H-1B cap), including the advanced degree exemption, also known as the master’s cap.We selected 114,017 beneficiaries, resulting in 120,603 selected registrations in the initial selection for the FY 2025 H-1B cap.We subsequently announced that we would need to select additional registrations for unique beneficiaries to reach the FY 2025 regular cap numerical allocations. As announced on August 5, 2024, our projections indicate we have now randomly selected a sufficient number of registrations for unique beneficiaries as needed to reach the regular cap from the remaining properly submitted FY 2025 registrations. Additionally, we have notified all prospective petitioners with selected registrations from this round of selection that they are eligible to file an H-1B cap-subject petition for the beneficiary named in the applicable selected registration. We selected 13,607 beneficiaries in the second selection for the FY 2025 H-1B regular cap, resulting in 14,534 selected registrations.During the registration period for the FY 2025 H-1B cap, we saw a significant decrease in the total number of registrations submitted compared to FY 2024, including a decrease in the number of registrations submitted on behalf of beneficiaries with multiple registrations.The number of unique beneficiaries this year for FY 2025 (approximately 442,000) was comparable to the number last year for FY 2024 (approximately 446,000).The number of unique employers this year for FY 2025 (approximately 52,700) was also comparable to the number last year for FY 2024 (approximately 52,000).The number of eligible registrations, however, was down dramatically for FY 2025 (470,342) compared with FY 2024 (758,994) — a 38.6% reduction.Overall, we saw an average of 1.06 registrations per beneficiary this year in FY 2025, compared to 1.70 for FY 2024.   This chart shows registration and selection numbers for fiscal years 2021-2025 (as of April 12, 2024):Cap Fiscal YearTotal RegistrationsEligible Registrations*Eligible Registrations for Beneficiaries with No Other Eligible RegistrationsEligible Registrations for Beneficiaries with Multiple Eligible RegistrationsSelected Registrations2021274,237269,424241,29928,125124,4152022308,613301,447211,30490,143131,9242023483,927474,421309,241165,180127,6002024780,884758,994350,103408,891188,400**2025479,953470,342423,02847,314135,137****The count of eligible registrations excludes duplicate registrations, those deleted by the prospective employer prior to the close of the registration period, and those with failed payments.**The number of initial selections for FY 2024 – 110, 791 – was smaller than in prior years primarily due to (a) establishing a higher anticipated petition filing rate by selected registrants based on prior years; and (b) higher projected Department of State approvals of H-1B1 visas, which count against the H-1B cap.***The number of initial selections for FY 2025 – 120,603 – was smaller than in prior years primarily due to establishing a higher anticipated petition filing rate based on the beneficiary-centric selection process (i.e. selection by unique beneficiary). USCIS selected the number of unique beneficiaries projected as needed to reach the congressionally mandated caps and exemptions. All properly submitted registrations for those beneficiaries that were selected were set to a selected status. Accordingly, the number of selected registrations was higher than the number of selected beneficiaries and this number is not completely comparable to prior years that used a direct registration selection method.Measures to Combat Fraud in the Registration ProcessThe initial data for the registration period for the FY 2025 H-1B cap indicates that there were far fewer attempts to gain an unfair advantage than in prior years, owing in large measure to our implementation of the beneficiary-centric selection process under the final rule on Improving the H-1B Registration Selection Process and Program Integrity.We remain committed to deterring and preventing abuse of the H-1B registration process, and to ensuring that only those who follow the law are eligible to file an H-1B cap petition.We remind the public that at the time each registration is submitted, each prospective petitioner is required to sign an attestation, under penalty of perjury, that:All the information contained in the registration submission is complete, true, and correct;The registrations reflect a legitimate job offer; andThe registrant, or the organization for whom the registration is submitted, has not worked with, or agreed to work with, another registrant, petitioner, agent, or other individual or entity to submit a registration to unfairly increase chances of selection for the beneficiary or beneficiaries in this submission.If we find that this attestation was not true and correct, we will find the registration to not be properly submitted and the prospective petitioner would not be eligible to file a petition based on that registration. We may deny a petition, or revoke a petition approval, based on a registration that contained a false attestation and was therefore not properly submitted.Furthermore, we may also refer the individual or entity who submitted a false attestation to appropriate federal law enforcement agencies for investigation and further action, as appropriate.Based on evidence from the FY 2023 and FY 2024 H-1B cap seasons, we have undertaken extensive fraud investigations, denied and revoked petitions accordingly, and continue to make law enforcement referrals for criminal prosecution.  We are also reviewing the FY 2025 data for any attempts to gain an unfair advantage through the beneficiary-centric selection process. If applicable, we will deny or revoke any petitions and make law enforcement referrals for criminal prosecution accordingly.We believe that the decreased filing rate for FY 2024 H-1B cap petitions and the decreased registration numbers for FY 2025 are indicative that these investigations and the beneficiary-centric selection process have been effective integrity measures.The H-1B program is an essential part of our nation’s immigration system and our economy, and we are committed to implementing the law and helping meet the ever-changing needs of the U.S. labor market.You can report suspected immigration benefit fraud and abuse to USCIS through our online tip form.For more information about the H-1B program, visit our H-1B Specialty Occupations webpage.How to RegisterTo submit an H-1B registration, you must first create a USCIS online account.The initial registration period for FY 2025 will open at noon Eastern on March 6 and run through noon Eastern on March 25. Both representatives and registrants must wait until March 1 to create and submit H-1B registrations.On Feb. 28, 2024, USCIS will launch new myUSCIS organizational accounts that will allow multiple people within an organization and their legal representatives to collaborate on and prepare H-1B registrations, H-1B petitions, and any associated Form I-907, Request for Premium Processing Service.   Prospective petitioners submitting their own registrations (U.S. employers and U.S. agents, collectively known as “registrants”) will use an “organizational” account (formerly known as a “registrant” account). Registrants will be able to create new organizational accounts beginning at noon Eastern on Feb. 28, 2024. Those who have an existing registrant account can easily upgrade to an organizational account instead of creating a new account.   Representatives can create an account at any time by using the same kind of account already available to representatives. Representatives who already have a representative account may use that account; they do not need to create a new account. They will also have the ability to upgrade to an organizational account beginning at noon Eastern on Feb. 28, 2024.We launched our Tech Talks sessions in February to help guide organizations and legal representatives through the new process. We will also be hosting two national engagements on the registration process and online filing of Form I-129 for H-1B petitions leading up to the cap season. During the Tech Talk sessions, individuals will have the opportunity to ask questions about the organizational accounts and online filing. USCIS encourages all individuals involved in the H-1B registration and petition filing process to attend these sessions. Additional information and dates are available on the Upcoming National Engagements page.All presentations on organizational accounts will be posted to our Electronic Reading Room and we have also posted helpful videos on our USCIS YouTube channel. Visit our Contact Public Engagement page to subscribe to notifications about upcoming engagements. Step-by-Step InstructionsRegistering online is quick and easy!Organizational Accounts for Legal Representatives - DemonstrationIn this video, we present some of the new features in organizational accounts for legal representatives and show you how to use the accounts.  Link: https://youtu.be/_jcj4ak_xAkOrganizational Accounts for Companies - DemonstrationIn this video, we present some of the new features in organizational accounts for companies and show you how to use the accounts.Link: https://youtu.be/lkRs9-YmdD0Tips to Avoid Common Mistakes with H-1B Electronic RegistrationBased on our experience with the H-1B electronic registration period, the top two user errors are:Creating the wrong type of account; andEntering the same beneficiary more than once.Make Sure You Create the Right Type of AccountThere are three types of USCIS online accounts:Applicant/petitioner/requestor account – Individuals use this type of account to prepare and file applications, petitions, or other benefit requests. You cannot use this account type to prepare or submit H-1B registrations.Attorney/representative account – If you are an attorney or accredited representative (legal representative) submitting H-1B registrations on behalf of a prospective petitioner, select this option. You will also be able to submit Form G-28, Notice of Entry of Appearance as Attorney or Accredited Representative.Organizational account (formerly registrant account) – This is the account that a prospective petitioner must create in order participate in the H-1B registration process, regardless of whether the prospective petitioner will be using an attorney or accredited representative to submit the registration.Avoid Duplicate EntriesA prospective petitioner may only have one registration submitted per beneficiary per fiscal year. Once the initial registration period has closed, if the prospective petitioner has more than one registration submitted for the same beneficiary, we may invalidate all registrations submitted for that beneficiary by that prospective petitioner, or their authorized attorney or representative, from the selection process. This does not prevent other prospective petitioners or their representatives from submitting registrations for that same beneficiary, but they too need to ensure that each of them, as a prospective petitioner, only has one registration submitted for the beneficiary.We have added duplicate checker functionality to the electronic registration process. Before you submit your registration(s), you can check if the registrant/prospective petitioner named in the draft submission previously submitted a registration for any of the beneficiaries included in that draft submission for the same fiscal year. Using this check does not guarantee that you will not submit a duplicate. This check will compare the beneficiaries listed in the draft with any registrations previously submitted during this registration period. It will not check for duplicates within that draft or between drafts. Even if using this check function, the burden is still on the registrant and their authorized attorney or representative, if applicable, to ensure that no duplicate registrations are submitted. To that end, we also provide a tool to download a .csv file and search for duplicate entries. Also, we recommend that attorneys and authorized individuals who work for the same company coordinate to eliminate duplicates before submitting their registrations.If you discover you or your representative submitted more than one registration for the same person and the initial registration period is still open (before noon Eastern on March 25, 2024), you can go into your account and delete the extra submission(s) until there is only one registration for the beneficiary. We do not refund the fee if you delete a duplicate registration.If you discover that you or your representative submitted more than one registration for the same person and the initial registration period has closed (after noon Eastern on March 25, 2024), there is no way to correct this error. We will remove all registrations submitted for the beneficiary by, or on behalf of, that prospective petitioner from the selection process. We do not refund the fee for a removed registration.Unfairly Increasing Chances of SelectionWhen you submit your registration(s), you must attest, under penalty of perjury, that all of the information contained in the submission is complete, true, and correct.  The attestation that is required before submission indicates, “I further certify that this registration (or these registrations) reflects a legitimate job offer and that I, or the organization on whose behalf this registration (or these registrations) is being submitted, have not worked with, or agreed to work with, another registrant, petitioner, agent, or other individual or entity to submit a registration to unfairly increase chances of selection for the beneficiary or beneficiaries in this submission.”If we find that this attestation was not true and correct (for example, that a company worked with another entity to submit multiple registrations for the same beneficiary to unfairly increase chances of selection for that beneficiary), we will deny or revoke the petition based on a registration with a false attestation in accordance with the regulatory language at 8 CFR 214.2(h)(10)(ii) and 8 CFR 214.2(h)(11)(iii)(A)(2). Furthermore, we may also refer the individual or entity who submitted a false attestation to appropriate federal law enforcement agencies for investigation and further action as appropriate.Required FeesFor information on fees, see Fee Schedule, Form G-1055.Each registration is for a single beneficiary.Registrants or their representative are required to pay the non-refundable H-1B registration fee for each beneficiary before being eligible to submit a registration for that beneficiary for the H-1B cap.On Jan. 31, 2024, DHS published the Fee Schedule final rule. That rule will go into effect after the initial registration period for the FY 2025 H-1B cap. Therefore, the registration fee during the registration period starting in March 2024 will remain $10.The U.S. Department of the Treasury has approved a temporary increase in the daily credit card transaction limit from $24,999.99 to $99,999.99 per day for H-1B registrations and petitions submitted online using one credit card for the FY 2025 H-1B cap season. This temporary increase is in response to stakeholder feedback and the volume of previous H-1B registrations that exceeded the daily credit card limit.There is a daily transaction limit for credit cards of $24,999.99 per credit card per day for petitions that are sent by mail. Alternatively, you can:Process transactions using a checking account. The checking account information (routing and account number) must be from a financial institution located in the United States; orProcess transactions using a debit card from a financial institution located in the United States.Important DatesH-1B Registration Process TimelineFeb. 28: Petitioners and registrants can begin creating H-1B registrant accounts at noon Eastern.March 6: H-1B registration period opens at noon Eastern.March 25: H-1B registration period closes at noon Eastern.March 31: Date by which USCIS intends to notify selected registrants.April 1: The earliest date that FY 2025 H-1B cap-subject petitions based on the registrations selected during the initial FY 2025 selection period may be filed.Registration Selection NotificationsWe intend to notify registrants and their representatives with selected registrations via their USCIS online accounts.A registrant’s USCIS online account will show one of the following statuses for each registration:Submitted: The registration has been submitted and is eligible for selection. If the initial selection process has been completed, this registration remains eligible, unless subsequently invalidated, for selection in any subsequent selections for the fiscal year for which it was submitted.Selected: Selected to file an H-1B cap petition.Not Selected: Not selected – not eligible to file an H-1B cap petition based on this registration.Denied: Multiple registrations were submitted by or on behalf of the same registrant for the same beneficiary. If denied as a duplicate registration, all registrations submitted by or on behalf of the same registrant for this beneficiary for the fiscal year are invalid.Invalidated-Failed Payment: A registration was submitted but the payment method was declined, not reconciled, disputed, or otherwise invalid.H-1B cap-subject beneficiaries, including those eligible for the advanced degree exemption, must have a valid “Selected” registration notification for that specific fiscal year in order for a registrant or representative to properly file an H-1B cap-subject petition. The status of registrations that are not selected as part of any initial random selection process, and not denied or invalidated, will remain as “Submitted.” Registrants and representatives that are not selected will not be notified until after USCIS has determined that they have reached the H-1B cap for that fiscal year.H-1B Electronic Registration Frequently Asked QuestionsQ. Are there any changes to the H-1B electronic registration form for FY 2025?A. The FY 2025 H-1B electronic registration form is very similar to past years. You still only need to provide basic information about the prospective petitioner and beneficiary. One change this year is that we will require H-1B registrants to provide valid passport information or valid travel document information for each beneficiary. The passport or travel document provided must be the same as the beneficiary used to enter the United States; if or when they are outside the United States, it must be the document they intend to use to enter the United States if they receive an H-1B visa. Also, the passport or travel document’s validity period must be current and unexpired. Each beneficiary must be registered under only 1 passport or travel document. The passport or travel document must be valid at the time of registration. If the passport or travel document expires between when a registration is submitted and when the H-1B petition is filed, the petitioner should enter data from the new, currently valid passport or travel document on Page 3, Part 3 of Form I-129, Petition for Nonimmigrant Worker. In support of the H-1B petition, the petitioner should provide documentation for both passports or travel documents to establish that the passport or travel document was valid at the time of registration and an explanation as to why there was a change in identifying information.In rare instances, such as for nationals of Venezuela, the passport or travel document may be past the expiration date listed on the document (i.e., facially expired) but may have had its validity extended by decree or automatically by the national government or issuing authority that issued the passport or travel document. In these unusual circumstances, we would consider those documents to be valid since they were extended by decree or automatically.​ Registrants should enter the expiration date of the passport or travel document based on the extension, rather than the date which appears in the passport itself. If an H-1B petition is filed based on such registration, USCIS will review the copy of the facially expired document along with any relevant information about the extension to ensure the information entered at registration was accurate.Q. Is there an appeal process for registrations that USCIS finds are invalid duplicates?A. Registrations that we find are duplicates will be invalid. A registrant will not be able to appeal our finding that the registrations are duplicates.Q. If registering for the master’s cap based on the expectation that the beneficiary will earn a qualifying advanced degree and the registration is selected under the master’s cap, but the beneficiary does not obtain their qualifying advanced degree by the time of filing the cap-subject H-1B petition, is there a risk that USCIS will deny the cap-subject H-1B petition for that beneficiary?A. If we select a registration under the advanced degree exemption (under INA 214(g)(5)(C)) because the beneficiary has earned, or will earn prior to the filing of the petition, a master’s or higher degree from a U.S. institution of higher education, the beneficiary must be eligible for the advanced degree exemption at the time of filing Form I-129, Petition for a Nonimmigrant Worker. If we select the beneficiary under the advance degree exemption and the beneficiary has not earned a qualifying master’s or higher degree from a U.S. institution of higher education at the time of filing the petition, we will deny or reject the petition.Q. What happens if the prospective employer with a selected registration puts an address on their registration but moves before they file their I-129 petition, such that the addresses on their registration and Form I-129 don’t match?A. In such a situation, the petitioner should include a statement with their petition, with supporting documentation, explaining why the address on the registration differs from the address on the petition. If we cannot determine that the petitioning entity is the same as the prospective petitioner identified on the selected registration, we may reject or deny the petition.Q. What start date should petitioners with a selected registration indicate on their Form I-129?A.  If we selected your registration, you must indicate a start date of Oct. 1 or later of the appropriate fiscal year (and 6 months or less from the receipt date of the petition) on your petition. If you do not, we will reject or deny your petition.Q. If there is a typo on the registration in comparison to the Form I-129, will USCIS reject the Form I-129 petition?A. Although we will not automatically reject the Form I-129 petition for typos on the selected registration in comparison with the Form I-129, the burden is on the registrant/petitioner to confirm that all registration and petition information is correct and to establish that the H-1B cap petition is based on a valid registration submitted for the beneficiary named in the petition and selected by USCIS.Q. Will the H-1B registration system or the beneficiary-centric selection process affect how USCIS handles the prohibited filing of multiple H-1B petitions for the same beneficiary by related entities?A. The prohibition on an employer or related entities filing multiple H-1B cap petitions for the same beneficiary has not changed. Our handling of multiple H-1B cap petitions is consistent with 8 CFR 214.2(h)(2)(i)(G) and Matter of S- Inc., Adopted Decision 2018-02 (AAO Mar. 23, 2018).Q. Where should a petitioner with a selected registration file their Form I-129 and supporting documentation?A. USCIS recently announced that, on April 1, 2024, USCIS will begin accepting online filing for H-1B cap petitions and associated Forms I-907 for petitioners whose registrations have been selected. Petitioners will continue to have the option of filing a paper Form I-129 H-1B petition and any associated Form I-907 if they prefer. However, during the initial launch of organizational accounts, users will not be able to link paper-filed Forms I-129 and I-907 to their online accounts.For paper-filed forms, petitioners must file per the instructions on the H-1B registration selection notice, which may be different from the historical Form I-129 filing jurisdictions for cap cases. Please see our Direct Filing Addresses for Form I-129, Petition for a Nonimmigrant Worker webpage for information on the correct location at which to file your cap petition.Q. What happens if a legal representative submits a registration but then stops representing the registrant?A. It is up to the representative and registrant to ensure that the registrant maintains access to submissions made for them and any updates related to those submissions. If a registrant no longer wants their attorney involved, they can end the relationship with the representative, and the registrant will still be able to see all registration information in their own organizational account(s). However, the registrant will not be able to add a new attorney or representative to H-1B registrations prepared or submitted by the previous attorney.Q. Will the system prevent the representative and the registrant from both entering the same beneficiary?A. The system will not prevent a representative and a registrant from both registering the same beneficiary. However, we added duplicate checker functionality to the electronic registration process. Before you submit your registration(s), you can check whether the registrant named in the draft submission previously submitted a registration for any of the beneficiaries included in that draft submission for the same fiscal year. Using this check does not guarantee that you will not submit a duplicate. This check will compare the beneficiaries listed in the draft with any registrations previously submitted during this registration period. It will not check for duplicates within that draft or between drafts. Even when using this check function, the representative and the registrant still are responsible for ensuring that they do not submit duplicate registrations. To help with that, we also offer a tool to download a .csv file and search for duplicate entries. In addition, we recommend that attorneys and authorized individuals who work for the same company communicate among themselves to eliminate duplicates before submitting their registrations.Q. I am a legal representative submitting the H-1B registration online, and the Form G-28, Notice of Entry of Appearance as Attorney or Accredited Representative, asks if I have an online account and what my account number is. How do I find it?A. If you have paper-filed cases that are eligible to be added to your online account, your USCIS notices for those cases should include your online account number. If you do not know your account number, this will not affect your H-1B registration. You can click “No” to this question and move on to the next question.Q. Will both the attorney and the client (prospective registrant) need to create a USCIS online account for the H-1B electronic registration process?A. Yes. Both the client (prospective registrant) and attorney will need a USCIS online account for the H-1B electronic registration process. If you are an attorney and already have an existing legal representative account, your account will work with the H-1B electronic registration process. You do not need to create a new legal representative account unless you do not have one.All clients (prospective registrants) will need to create an H-1B organizational account to review and approve the Form G-28 and H-1B registrations as part of the electronic registration process.Q. As a registrant, can I delete my account?A. See the Tips for Filing Forms Online webpage for information on how to delete your account.Q. Does a duplicate registration in a submission batch affect all registrations in the batch or only the duplicate registration?A. We would invalidate only the duplicate registrations. If you properly submitted other registrations for different beneficiaries, these valid registrations would remain in the system for the selection process. You have until  the initial registration period closes, to log into your account, review all of your H-1B registrations, and delete any duplicate registrations. This is also true if one of the registrations submitted in a batch contains an error. You would be able to delete the registration for the beneficiary that contained the error without affecting the rest of the batch submission.Q. As a legal representative, how will I know that the registrant has gone into the system and approved my Form G-28 and the H-1B registrations?A. You can log into your account to check if the registrant has approved the Form G-28 and the H-1B registrations. Our system will not separately notify you that the registrant has approved the Form G-28 and H-1B registrations.Q. After the legal representative submits a registration, will the registrant be notified via email or by logging into their account?A. The legal representative will need to notify the registrant that the registration and Form G-28 were entered for the registrant’s review; or the registrant can see the registrations and Form G-28 by logging into their account. Our system will not separately notify the registrant.Q. Can an attorney represent a petitioner for an I-129 petition if the petitioner completed the H-1B electronic registration process without the help of the attorney?A. Yes. However, to authorize their representation, the attorney would need to file a Form G-28 with the Form I-129 H-1B petition. Even if the attorney submitted a Form G-28 to represent a registrant for the registration process, they would still need to submit a new Form G-28 with the Form I-129 petition.Q. How do I reset the password for my USCIS account or get technical support?A. To reset your password, please visit the Forgot Your Password page on our website. To review the steps on how to create an online account, sign into your account, or complete an H-1B registration with USCIS, please see the “How to Register” tab above. If you need other technical support, please call the USCIS Contact Center at 800-375-5283. You may also use our online form, but you will get faster service by calling.Q. What is the earliest date I can start drafting registrations?A. March 6, 2024, at noon Eastern.Q. Will the system allow for multiple staff members to log into my account at the same time?A. No. You must agree to the Terms of Use, which include an attestation that you are the person that holds the account and that you will not share your account with others or allow others to use your account.However, on Feb. 28, 2024, USCIS will launch new myUSCIS organizational accounts that will allow multiple people within an organization and their legal representatives to collaborate on and prepare H-1B registrations, H-1B petitions, and any associated Form I-907. Q. How should a registrant with a selected registration notify USCIS if they do not intend to file a petition?A. Since no H-1B petition will be filed, we will have no paper file that we can use to match the notification with the registration. We suggest that the employer keep documentation of the reason for not filing, so that the employer would be able to show us the documentation if we have questions.Q. If a registration is selected and the petition is filed during the 90-day period, but it is rejected, will a petitioner be eligible to refile if they are still within the 90-day window?A. A petitioner is eligible to refile their rejected petition as long as it is refiled within the designated 90-day filing window. The petitioner must file their petition at the correct location and must include all required fees and supporting evidence with the filing.Q. Will USCIS invalidate registrations as duplicates if the same representative submits two registrations for the same beneficiary, but for two unrelated companies?A. No. We would not consider such registrations duplicates. However, we will consider registrations as duplicates if the registrations are for the same prospective petitioners and the same prospective beneficiaries.Furthermore, we would consider a registration to not be properly submitted if it contained an attestation that was not true and correct (for example, that a company worked with another entity to submit multiple registrations for the same beneficiary to unfairly increase chances of selection for that beneficiary). For more information, please see the “Unfairly Increasing Chances of Selection” tab above.Q. If one person is the authorized signatory for two separate companies, could this person use their email with different domain names to set up a registrant account and submit registrations for the two companies?A. Yes, they may. They will need two separate accounts, one for each company. They will also need a separate email address for each account.Q. What happens to my registration submission if the payment fails to initially go through?A. If your payment initially fails or is canceled before it can be processed on Pay.gov, you will see a payment failure notification on the screen and your registration will not be submitted. Your registration data will be available in your account for 30 days from the date you last worked on your registrations. You can sign-in to your account at any time before the initial registration period closes to try the payment and registration submission again. You must submit all registrations and payments successfully before the initial registration period closes for consideration in the initial registration period selection processQ. What happens if my payment initially clears, but then fails (for example, payment is made using an electronic check that my bank then returns)?A. It is your responsibility to submit valid payment.When paying by check, please be sure to enter the bank routing number and bank account number accurately. While the status of the registration in the system will indicate “submitted” following completion of the Pay.gov payment process, the submission will only be valid once your payment clears. If your checking information is not accurate, your payment will be declined when presented to your financial institution. If your payment is declined, your H-1B registration will be invalidated.If payment is completed with a credit card or debit card, the status of the registration in the system will indicate “submitted” following completion of the Pay.gov payment process. The submission, however, will only be valid once processing of the payment is completed. If the payment is later declined, not reconciled, disputed, or otherwise invalidated after submission, the registration will be invalidated.If your payment fails, we will attempt to notify you, but the burden will be on you to determine the status of your required payment. If your registration is invalidated while the registration period is still open, you will be able to submit a new registration with a valid payment. If your registration is invalidated due to a failed payment after the registration period closes, you will not be able to submit a new registration.Q. May an authorized signatory within the company, who is different from the authorized signatory who signed the H-1B electronic registration, sign the paper Form I-129?A. Yes. The authorized signatory who signed the registration does not need to be the same authorized signatory who signs the Form I-129. However, the prospective petitioner (registrant) at the registration stage must match the petitioner at the Form I-129 stage.Q. What time zone does the H-1B registration system and Form I-129 petitions submitted online use?A. H-1B registrations and Forms I-129 that are submitted online via myUSCIS will reflect a filing time based on Coordinated Universal Time (UTC).For Form I-129 petitions submitted online, the receipt date will be based on UTC, not the local time of the submitter or the service center that will ultimately work the petition. This may result in a later receipt date than anticipated if filing late in the day. Please verify that any filings are submitted on time to ensure that there are no adverse impacts to eligibility.Q. I indicated on a registration that a beneficiary was not eligible for the master’s cap, but their selection notice indicates they were selected in the master’s cap. Is this an error on the selection notice?A. First, you should verify your indication on the registration regarding the beneficiary ‘s eligibility for consideration in the master’s cap.However, even if you did not indicate the beneficiary was eligible for consideration in the master’s cap, they may still have been properly considered in the master’s cap. The beneficiary would have been entered into the master’s cap selection process if they had another registration submitted on their behalf that indicated they were eligible for consideration in the master’s cap. Because of the beneficiary-centric selection process, all registrations submitted for that beneficiary are selected if the beneficiary is selected. Accordingly, if the beneficiary was selected in the master’s cap, all registrations would indicate that selection, even if a particular registration did not indicate eligibility for the master’s cap.Based on DHS regulations, the general cap selection is conducted first by selecting beneficiaries from among all properly submitted registrations, including those eligible for the advanced degree exemption. Then the master’s cap selection is conducted. Accordingly, any beneficiary selected in the initial master’s cap selection was not selected in the initial general cap selection.You are still eligible to file a petition based on this selected registration during the applicable filing period. However, you would need to establish the beneficiary’s eligibility for the master’s cap as of the time of filing the Form I-129 petition.Organizational Accounts Frequently Asked QuestionsOrganizational Accounts Frequently Asked QuestionsRelated LinksH-1B Registration Federal Register NoticeH-1B Registration Final Rule (2019)H-1B Registration Final Rule (2024)\n      \n      \n\n                \n  \n  \n    \n              \n    Last Reviewed/Updated:\n                08/05/2024\n\n      \n  \n\n      \n\n      \n\n  \n\n                              \n\n                                \n      \n    \n        \n          \n\n  \n      \n    Was this page helpful?\n  \n  \n                \n          \n          Yes\n    \n\n          \n          No\n    \n\n\n          \n\n\n        This page was not helpful because the content:\n          Select a reasonhas too little informationhas too much informationis confusingis out of dateother\n      \n\n        How can the content be improved?\n          \n  \n\n\n      0 / 2000To protect your privacy, please do not include any personal information in your feedback. Review our Privacy Policy.\n      \n\n\n\n\n      \n\n  \n\n              \n                \n            \n          \n        \n\n              \n    \n                                \n  \n    \n\n  \n    \n      Return to top\n    \n\n           \n         \n           \n                                         \n                 \n\n                      \n                          \n        Topics\n              \n                      \n        Forms\n              \n                      \n        Newsroom\n              \n                      \n        Citizenship\n              \n                      \n        Green Card\n              \n                      \n        Laws\n              \n                      \n        Tools\n              \n        \n  \n\n\n\n\n\n                 \n               \n             \n                     \n                               \n       \n                            \n        \n          \n\n                      \n              \n                \n                  \n              \n                              \n                                                              \n                  \n                                                                  \n                                                      \n                              Facebook\n                            \n                                                  \n                                                                                        \n                                                      \n                              Twitter\n                            \n                                                  \n                                                                                        \n                                                      \n                              YouTube\n                            \n                                                  \n                                                                                                                                                                            \n                                                      \n                              Instagram\n                            \n                                                  \n                                                                                        \n                                                      \n                              LinkedIn\n                            \n                                                  \n                                                                                        \n                                                      \n                              Email\n                            \n                                                  \n                                                            \n\n                                  \n                                          Contact USCIS\n                                      \n                                  \n                    \n                                                                \n                  \n                \n                          \n          \n          \n        \n      \n    \n      \n        \n          \n            \n              \n                \n                  \n                    \n                  \n                Agency description\n                \n                  USCIS.gov\n                  \n                    An official website of the U.S. Department of Homeland Security\n                  \n                \n              \n            \n              \n    \n\n\n            \n  Important links\n  \n\n        \n  \n    \n                                                                                                                                About USCIS                                                  \n                                                Accessibility                                                  \n                                                Budget and Performance                                                  \n                                                DHS Components                                                  \n                                    \n                                                                                                                            Freedom of Information Act                                                  \n                                                No FEAR Act Data                                                  \n                                                Privacy and Legal Disclaimers                                                  \n                                                Site Map                                                  \n                                    \n                                                                                                                            Office of the Inspector General                                                  \n                                                The White House                                                  \n                                                USA.gov                                                  \n                                    \n                                                \n\n          \n  \n\n\n  \n\n\n  \n\n                        \n              \n                Looking for U.S. government information and services?\n                Visit USA.gov\n              \n            \n          \n                      \n                \n            \n                  \n      \n    \n  \n\n\n  \n\n    \n      \n    \n        \n                      \n//<![CDATA[\n\n(function(){var g=function(e,h,f,g){\nthis.get=function(a){for(var a=a+\"=\",c=document.cookie.split(\";\"),b=0,e=c.length;b<e;b++){for(var d=c[b];\" \"==d.charAt(0);)d=d.substring(1,d.length);if(0==d.indexOf(a))return d.substring(a.length,d.length)}return null};\nthis.set=function(a,c){var b=\"\",b=new Date;b.setTime(b.getTime()+6048E5);b=\"; expires=\"+b.toGMTString();document.cookie=a+\"=\"+c+b+\"; path=/; \"};\nthis.check=function(){var a=this.get(f);if(a)a=a.split(\":\");else if(100!=e)\"v\"==h&&(e=Math.random()>=e/100?0:100),a=[h,e,0],this.set(f,a.join(\":\"));else return!0;var c=a[1];if(100==c)return!0;switch(a[0]){case \"v\":return!1;case \"r\":return c=a[2]%Math.floor(100/c),a[2]++,this.set(f,a.join(\":\")),!c}return!0};\nthis.go=function(){if(this.check()){var a=document.createElement(\"script\");a.type=\"text/javascript\";a.src=g;document.body&&document.body.appendChild(a)}};\nthis.start=function(){var t=this;\"complete\"!==document.readyState?window.addEventListener?window.addEventListener(\"load\",function(){t.go()},!1):window.attachEvent&&window.attachEvent(\"onload\",function(){t.go()}):t.go()};};\ntry{(new g(100,\"r\",\"QSI_S_ZN_3WrTsyl9WWQdlxb\",\"https://zn3wrtsyl9wwqdlxb-uscisomnichannel.gov1.siteintercept.qualtrics.com/SIE/?Q_ZID=ZN_3WrTsyl9WWQdlxb\")).start()}catch(i){}})();\n\n//]]>\n\n\n      \n      \n  \n    \n        \n                      \n  /*<![CDATA[*/\n  (function() {\n    var sz = document.createElement('script'); sz.type = 'text/javascript'; sz.async = true;\n    sz.src = '//siteimproveanalytics.com/js/siteanalyze_10709.js';\n    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(sz, s);\n  })();\n  /*]]>*/\n\n      \n      \n\n  \n\n\n\n  \n\n    \n    {\"path\":{\"baseUrl\":\"\\/\",\"scriptPath\":null,\"pathPrefix\":\"\",\"currentPath\":\"node\\/80860\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\"},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"gtm\":{\"tagId\":null,\"settings\":{\"data_layer\":\"dataLayer\",\"include_classes\":false,\"allowlist_classes\":\"google\\nnonGooglePixels\\nnonGoogleScripts\\nnonGoogleIframes\",\"blocklist_classes\":\"customScripts\\ncustomPixels\",\"include_environment\":false,\"environment_id\":\"\",\"environment_token\":\"\"},\"tagIds\":[\"GTM-WK8MXNN\"]},\"gtag\":{\"tagId\":\"\",\"otherIds\":[],\"events\":[],\"additionalConfigInfo\":[]},\"ajaxPageState\":{\"libraries\":\"admin_feedback\\/admin_feedback_block,admin_feedback\\/admin_feedback_css,admin_feedback_extended\\/feedback_extended,asset_injector\\/css\\/qualtrics_popup_dialog,asset_injector\\/css\\/rtl_table_heading,asset_injector\\/js\\/force_enable_reset,asset_injector\\/js\\/preview_message_bar,asset_injector\\/js\\/translation_helper,calendar\\/calendar.theme,ckeditor_accordion\\/accordion.frontend,ckeditor_indentblock\\/indentblock,classy\\/base,classy\\/messages,clientside_validation_jquery\\/cv.jquery.ife,core\\/normalize,dhs_uswds\\/global,dhs_uswds\\/uswds,extlink\\/drupal.extlink,google_tag\\/gtag,google_tag\\/gtag.ajax,google_tag\\/gtm,system\\/base,tb_megamenu\\/theme.tb_megamenu,uscis_design\\/global-styling,uscis_design\\/select-component,usfedgov_google_analytics\\/load-analytics-cdn,uswds\\/drupal\",\"theme\":\"uscis_design\",\"theme_token\":null},\"ajaxTrustedUrl\":{\"form_action_p_pvdeGsVG5zNF_XLGPTvYSKCf43t8qZYSwcfZl2uzM\":true},\"clientside_validation_jquery\":{\"validate_all_ajax_forms\":2,\"force_validate_on_blur\":false,\"messages\":{\"required\":\"This field is required.\",\"remote\":\"Please fix this field.\",\"email\":\"Please enter a valid email address.\",\"url\":\"Please enter a valid URL.\",\"date\":\"Please enter a valid date.\",\"dateISO\":\"Please enter a valid date (ISO).\",\"number\":\"Please enter a valid number.\",\"digits\":\"Please enter only digits.\",\"equalTo\":\"Please enter the same value again.\",\"maxlength\":\"Please enter no more than {0} characters.\",\"minlength\":\"Please enter at least {0} characters.\",\"rangelength\":\"Please enter a value between {0} and {1} characters long.\",\"range\":\"Please enter a value between {0} and {1}.\",\"max\":\"Please enter a value less than or equal to {0}.\",\"min\":\"Please enter a value greater than or equal to {0}.\",\"step\":\"Please enter a multiple of {0}.\"}},\"data\":{\"extlink\":{\"extTarget\":false,\"extTargetNoOverride\":false,\"extNofollow\":false,\"extNoreferrer\":false,\"extFollowNoOverride\":false,\"extClass\":\"ext\",\"extLabel\":\"(link is external)\",\"extImgClass\":false,\"extSubdomains\":true,\"extExclude\":\"\\\\.gov|\\\\.mil\",\"extInclude\":\"web\\\\.archive\\\\.org\",\"extCssExclude\":\".footer-social-media__links,.usa-footer__contact-links\",\"extCssExplicit\":\"\",\"extAlert\":true,\"extAlertText\":\"You are now leaving an official website of U.S. Citizenship and Immigration Services. Links to non-USCIS sites are provided for the visitor\\u2018s convenience and do not represent an endorsement by USCIS of any commercial or private issues, products or services. Note that the privacy policy of the linked site may differ from that of USCIS.\",\"mailtoClass\":\"0\",\"mailtoLabel\":\"(link sends email)\",\"extUseFontAwesome\":true,\"extIconPlacement\":\"append\",\"extFaLinkClasses\":\"far fa-external-link-alt\",\"extFaMailtoClasses\":\"fa fa-envelope-o\",\"whitelistedDomains\":[]}},\"ckeditorAccordion\":{\"accordionStyle\":{\"collapseAll\":0,\"keepRowsOpen\":0,\"animateAccordionOpenAndClose\":0,\"openTabsWithHash\":0}},\"admin_feedback\":{\"yes_response\":\"Unused\",\"no_response\":\"This page was not helpful because the content:\",\"custom_text_response_on_no\":{\"value\":\"\",\"format\":\"full_html\"},\"feedback_prompt_on_yes\":true,\"feedback_prompt_on_no\":true,\"feedback_enable_predefined_answers\":true,\"feedback_prompt\":\"Great!  Any other feedback? (Optional)\",\"feedback_allow_cancel\":{\"active\":false,\"timeout\":3},\"final_response\":\"Thank you for your feedback.\"},\"TBMegaMenu\":{\"TBElementsCounter\":{\"column\":15},\"theme\":\"uscis_design\"},\"user\":{\"uid\":0,\"permissionsHash\":\"3b6956a260aed539487495a59fc0d31d7bc833a987b30b49c2e3df9582097b29\"}}\n\n\n\n\n\n\n\n\n\n  \n\n"
}