{
    "content": "\n    <iframe src=\"https://www.googletagmanager.com/ns.html?id=GTM-WK8MXNN\"\n                  height=\"0\" width=\"0\" style=\"display:none;visibility:hidden\"></iframe>\n\n      \n    \n\n\n\n\n\n  \n\n  \n        \n      Skip to main content\n    \n\n    \n          \n        \n            \n      \n    \n        \n                      \n\n\nAn official website of the United States government    Here's how you know\n\n\n      \n      \n\n  \n\n            \n      \n    \n        \n          Español\n      \n  \n    \n        \n                      \n  \n  \n   Multilingual Resources\n\n\n      \n      \n\n  \n\n        \n      \n    \n          \n        \n            \n      \n    \n        \n                      \n\n\n\nOfficial websites use .gov\nA .gov website belongs to an official government organization in the United States.\n\n\n\n\n\n\n\nSecure .gov websites use HTTPS\nA lock ( A locked padlock  ) or https:// means you've safely connected to the .gov website. Share sensitive information only on official, secure websites.\n\n\n\n      \n      \n\n  \n\n        \n      \n    \n    \n              \n      \n      \n          \n      \n    \n        \n          \n      \n        \n      \n    \n      \n  \n  \n    \n        \n                      \n\n//<![CDATA[\n\n    \n//]]>\n \n\n\n\n\n\n\n\nSign In  \n\n\n\n\nAccess USCIS online services.\n\n\nSign In\n\tCreate Account\n\n\n\n\n\n      \n      \n\n  \n\n        Menu\n      \n\n      \n        \n          \n        \n          \n      \n    \n        \n                      Sign In \n\nCreate Account\n\n      \n      \n\n\n        \n          Topics      \n        Topics\n        \n                \n    \n        \n          Family                    \n    \n        \n          Family of Green Card Holders (Permanent Residents)              \n            \n\n        \n          Family of Refugees and Asylees              \n            \n\n        \n          Family of U.S. Citizens              \n            \n\n  \n\n  \n\n\n\n            \n\n        \n          Adoption                    \n    \n        \n          Before You Start              \n            \n\n        \n          Immigration through Adoption              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Military                    \n    \n        \n          Citizenship for Military Family Members              \n            \n\n        \n          Naturalization Through Military Service              \n            \n\n  \n\n  \n\n\n\n            \n\n        \n          Humanitarian                    \n    \n        \n          Humanitarian Parole              \n            \n\n        \n          Refugees and Asylum              \n            \n\n        \n          Temporary Protected Status              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Visit the U.S.                    \n    \n        \n          Change My Nonimmigrant Status              \n            \n\n        \n          Extend Your Stay              \n            \n\n  \n\n  \n\n\n\n            \n\n        \n          Working in the United States                    \n    \n        \n          Permanent Workers              \n            \n\n        \n          Temporary (Nonimmigrant) Workers              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Avoid Scams                    \n    \n        \n          Common Scams              \n            \n\n        \n          Find Legal Services              \n            \n\n        \n          Report Immigration Scams              \n            \n\n  \n\n  \n\n\n\n            \n\n        \n          Careers at USCIS                    \n    \n        \n          Career Opportunities              \n            \n\n        \n          Special Hiring Programs              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n        \n          Forms      \n        Forms\n        \n                \n    \n        \n          Most Accessed Forms                    \n    \n        \n          I-485, Application to Register Permanent Residence or Adjust Status              \n            \n\n        \n          I-765, Application for Employment Authorization              \n            \n\n        \n          I-90, Application to Replace Permanent Resident Card (Green Card)              \n            \n\n        \n          N-400, Application for Naturalization              \n            \n\n  \n\n  \n\n\n\n            \n\n        \n          All Forms              \n            \n\n        \n          File Online              \n            \n\n  \n\n  \n\n    \n    \n        \n          Family Based Forms                    \n    \n        \n          I-129F, Petition for Alien Fiancé(e)              \n            \n\n        \n          I-130, Petition for Alien Relative              \n            \n\n        \n          I-360, Petition for Amerasian, Widow(er), or Special Immigrant              \n            \n\n        \n          I-600, Petition to Classify Orphan as an Immediate Relative              \n            \n\n        \n          I-751, Petition to Remove Conditions on Residence              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Employment Based Forms                    \n    \n        \n          I-9, Employment Eligibility Verification              \n            \n\n        \n          I-129, Petition for a Nonimmigrant Worker              \n            \n\n        \n          I-140, Immigrant Petition for Alien Workers              \n            \n\n        \n          I-526, Immigrant Petition by Standalone Investor              \n            \n\n        \n          I-539, Application to Extend/Change Nonimmigrant Status              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Humanitarian Based Forms                    \n    \n        \n          I-134A, Online Request to be a Supporter and Declaration of Financial Support              \n            \n\n        \n          I-589, Application for Asylum and for Withholding of Removal              \n            \n\n        \n          I-730, Refugee/Asylee Relative Petition              \n            \n\n        \n          I-821, Application for Temporary Protected Status              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n        \n          Newsroom      \n        Newsroom\n        \n                \n    \n        \n          All News                    \n    \n        \n          Alerts              \n            \n\n        \n          Fact Sheets              \n            \n\n        \n          News Releases              \n            \n\n        \n          Stakeholder Messages              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Media Contacts              \n            \n\n        \n          Multimedia Gallery              \n            \n\n        \n          Social Media Directory              \n            \n\n        \n          Speeches, Statements, Testimony              \n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n        \n          Citizenship      \n        Citizenship\n        \n                \n    \n        \n          Learners                    \n    \n        \n          Apply for Citizenship              \n            \n\n        \n          Learn About Citizenship              \n            \n\n        \n          Naturalization Test and Study Resources              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Educators                    \n    \n        \n          Educational Products for Educators              \n            \n\n        \n          Resources for Educational Programs              \n            \n\n        \n          Teacher Training Sessions              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Organizations                    \n    \n        \n          Outreach Tools              \n            \n\n        \n          Civic Integration              \n            \n\n        \n          Interagency Strategy for Promoting Naturalization              \n            \n\n        \n          Naturalization-Related Data and Statistics              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Grants                    \n    \n        \n          Learn About the Citizenship and Integration Grant Program              \n            \n\n        \n          Success Stories from Grant Recipients              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n        \n          Green Card      \n        Green Card\n        \n                \n    \n        \n          Green Card Processes and Procedures                    \n    \n        \n          Adjustment of Status              \n            \n\n        \n          After We Grant Your Green Card              \n            \n\n        \n          Employment Authorization Document              \n            \n\n        \n          Visa Availability and Priority Dates              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Green Card Eligibility Categories              \n            \n\n        \n          How to Apply for a Green Card              \n            \n\n        \n          Replace Your Green Card              \n            \n\n        \n          While Your Green Card Application Is Pending with USCIS              \n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n        \n          Laws      \n        Laws\n        \n                \n    \n        \n          Legislation                    \n    \n        \n          Immigration and Nationality Act              \n            \n\n  \n\n  \n\n\n\n            \n\n        \n          Class Action, Settlement Notices and Agreements              \n            \n\n        \n          Unlawful Presence and Inadmissibility              \n            \n\n        \n          Policy Manual              \n            \n\n  \n\n  \n\n    \n    \n        \n          Regulations              \n            \n\n        \n          Administrative Appeals              \n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n        \n          Tools      \n        Tools\n        \n                \n    \n        \n          Self-Help Tools                    \n    \n        \n          Check Case Processing Times              \n            \n\n        \n          Case Status Online              \n            \n\n        \n          Change of Address              \n            \n\n        \n          E-Request              \n            \n\n        \n          Password Resets and Technical Support              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Website Resources                    \n    \n        \n          Archive              \n            \n\n        \n          A-Z Index              \n            \n\n        \n          Website Policies              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Additional Resources                    \n    \n        \n          Explore my Options              \n            \n\n        \n          Immigration and Citizenship Data              \n            \n\n        \n          Multilingual Resource Center              \n            \n\n        \n          USCIS Tools and Resources              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n  \n\n\n  \n    \n        \n                      Contact us\n\tMultilingual Resources\n\t\n\n      \n      \n\n  \n\n      \n\n              \n          \n  \n\n      \n  \n  \n                    \n    \n\n  \n\n            \n\n      \n              \n                      \n                  \n            \n                  \n        \n                  \n                            \n    \n  \n\n                      \n        \n                  \n        \n        \n                                    \n                  \n    \n            \n  Main navigation\n  \n\n        \nSkip to main content\n\n      \n          Working in the United StatesInternational Entrepreneur RuleTemporary WorkersCW-1: CNMI-Only Transitional WorkerE-1 Treaty TradersE-2 CNMI InvestorE-2 Treaty InvestorsE-3 Certain Specialty Occupation Professionals from AustraliaH-1B Specialty OccupationsH-1B Cap SeasonFAQs for Individuals in H-1B Nonimmigrant StatusH-1B Electronic Registration ProcessOrganizational Accounts Frequently Asked QuestionsExtension of Post Completion Optional Practical Training (OPT) and F-1 Status for Eligible Students under the H-1B Cap-Gap RegulationsEmployment Authorization for Certain H-4 Dependent SpousesH-2A Agricultural WorkersH-2B Non-Agricultural WorkersH-3 Nonimmigrant TraineeI Representatives of Foreign MediaL-1A Intracompany Transferee Executive or ManagerL-1B Intracompany Transferee Specialized KnowledgeO-1 Individuals with Extraordinary Ability or AchievementO Nonimmigrant Classifications: Question and AnswersP-1A Internationally Recognized AthleteP-1B Member of Internationally Recognized Entertainment GroupP-2 Performer or Group Performing under Reciprocal Exchange ProgramP-3 Artist or Entertainer Part of a Culturally Unique ProgramQ Cultural ExchangeR-1 Temporary Religious WorkersTN NAFTA ProfessionalsPermanent WorkersEmployment-Based Immigration: First Preference EB-1Employment-Based Immigration: Second Preference EB-2Employment-Based Immigration: Third Preference EB-3Employment-Based Immigration: Fourth Preference EB-4Special Immigrant JuvenilesSpecial Immigrant Juvenile (SIJ) Frequently Asked QuestionsReligious WorkersEmployment-Based Immigration: Fifth Preference EB-5EB-5 Immigrant Investor Regional CentersEB-5 Integrity FundAbout the EB-5 Visa ClassificationEB-5 Immigrant Investor ProcessSTEM Employment PathwaysImmigrant Pathways for STEM Employment in the United StatesNonimmigrant Pathways for STEM Employment in the United StatesEntrepreneur Employment PathwaysImmigrant Pathways for Entrepreneur Employment in the United StatesNonimmigrant or Parole Pathways for Entrepreneur Employment in the United StatesStudents and Exchange VisitorsConrad 30 Waiver ProgramExchange VisitorsStudents and EmploymentTemporary Visitors for BusinessB-1 Temporary Business VisitorGB Temporary Business Visitor to GuamWB Temporary Business Visitor under Visa Waiver ProgramInformation for Employers and EmployeesAutomatic Employment Authorization Document (EAD) ExtensionDHS Support of the Enforcement of Labor and Employment LawsEmployer InformationEmployment AuthorizationVIBEEmployment Authorization in Compelling CircumstancesOptions for Nonimmigrant Workers Following Termination of EmploymentReport Labor AbusesPetition Process OverviewImportant Information About Working Legally in the United States    \n    \n  \n\n\n  \n\n  \n\n              \n                      \n          \n                            \n      \n    \n        \n            \n    Breadcrumb\n    \n              \n          Home        \n              \n          Working in the United States        \n              \n          Temporary Workers        \n              \n          H-1B Specialty Occupations        \n              \n          Employment Authorization for Certain H-4 Dependent Spouses        \n          \n  \n\n      \n\n  \n\n            \n            \n            \n                              \n              \n              \n                                    \n      \n    \n        \n          \n\n      \n                \n\n                        \n            \n              Employment Authorization for Certain H-4 Dependent Spouses\n            \n          \n              \n                    \n      \n  \n                      Certain H-4 dependent spouses of H-1B nonimmigrants can file Form I-765, Application for Employment Authorization, if the H-1B nonimmigrant:Is the principal beneficiary of an approved Form I-140, Immigrant Petition for Alien Worker; orHas been granted H-1B status under sections 106(a) and (b) of the American Competitiveness in the Twenty-first Century Act of 2000 as amended by the 21st Century Department of Justice Appropriations Authorization Act (AC21).U.S. businesses use the H-1B program to employ foreign workers in specialty occupations that require a bachelor’s or higher degree in a specific specialty that is directly related to the H-1B position. In addition to specialty occupation workers, the H-1B classification applies to individuals performing services related to a Department of Defense cooperative research and development project or coproduction project, and to individuals performing services of distinguished merit and ability in the field of fashion modeling.Visit our H-1B Visa page for more information on eligibility for the H-1B program.Eligibility RequirementsYou are eligible if you are the H-4 dependent spouse of an H-1B nonimmigrant if your H-1B nonimmigrant spouse:Is the principal beneficiary of an approved Form I-140, Immigrant Petition for Alien Workers; orHas been granted H-1B status under sections 106(a) and (b) of AC21. Under AC21, H-1B nonimmigrants seeking employment-based lawful permanent residence may be eligible to work and remain in the United States beyond the six-year H-1B period of admission limitation.How to ApplyYou must file Form I-765, Application for Employment Authorization, to request employment authorization as an H-4 dependent spouse. You must receive an Employment Authorization Document (EAD/Form I-766) from USCIS before you may begin working. Use the newest version of Form I-765 to prevent delays or the need for USCIS to issue you a request for evidence.Carefully follow these steps to prevent your application from being rejected and returned to you:Complete Form I-765 using the Instructions for Form I-765  (PDF, 520.79 KB). USCIS will reject any application that is not accompanied by the proper filing fees or signature.If you are filing Form I-765 together with Form I-485, you must specify your eligibility category as (c)(9), not as (c)(26), and pay the Form I-485 filing fee. Follow the Form I-485 filing instructions to avoid processing delays.   If you file a Form I-765 together with a Form I-485 at the filing address for Form I-765 category (c)(26), USCIS will reject your Form I-485 and any corresponding fees. Additionally, if you included the fees for both forms on the same check or money order, USCIS may also reject your Form I-765 for category (c)(26).Submit supporting evidence (see chart below). Submitting sufficient supporting evidence will minimize the likelihood that USCIS will need to send you a request for more evidence.Evidence of…Can be shown by submitting…Your H-4 statusA copy of your current Form I-797 approval notice for Form I-539, Application to Extend/Change Nonimmigrant Status; orA copy of Form I-94, Arrival/Departure Record, showing your admission as an H-4 nonimmigrant or your most recent approved extension of stay.A government-issued identification document with photoA copy of your last EAD (if any);A copy of the biometric page of your passport;A birth certificate with photo ID;A visa issued by a foreign consulate; orA national identity document with photo.Your relationship to the H-1B nonimmigrantA copy of your marriage certificate.Your basis for eligibilityEvidence that the H-1B nonimmigrant is the principal beneficiary of an approved Form I-140, Immigrant Petition for Alien Worker. You may show this by submitting a copy of the approval notice (Form I-797) for the Form I-140 filed for the H-1B nonimmigrant;OREvidence that the H-1B nonimmigrant has been admitted or granted an extension of stay under AC21 sections 106(a) and (b).You may show this by submitting:A copy of the H-1B nonimmigrant’s passports, prior Forms I-94 (Arrival/Departure Record), and current and prior Forms I-797 for Form I-129, Petition for a Nonimmigrant Worker; andEvidence to establish one of the following bases for the H-1B nonimmigrant’s extension of stay.Based on Filing of a Permanent Labor Certification Application. Submit evidence that the H-1B nonimmigrant is the beneficiary of a Permanent Labor Certification Application that was filed at least 365 days before the period of admission authorized under AC21 106(a) and (b) begins. You may show this by submitting a copy of a print out from the Department of Labor’s (DOL’s) website or other correspondence from DOL showing the status of the H-1B nonimmigrant’s Permanent Labor Certification Application. If more than 180 days have passed since DOL certified the Permanent Labor Certification Application, also submit a copy of Form I-797 Notice of Receipt for Form I-140 establishing that the Form I-140 was filed within 180 days of such DOL certification;ORBased on a Pending Form I-140. Submit evidence that the H-1B nonimmigrant’s Form I-140 was filed at least 365 days before the period of admission authorized under AC21 106(a) and (b) begins. You may show this by submitting a copy of the Form I-797, Notice of Receipt, for Form I-140.Examples of Secondary Evidence. If you do not have any evidence relating to the H-1B nonimmigrant as described in “a” or “b” above, you may ask USCIS to consider secondary evidence in support of your application for employment authorization as an H-4 spouse. For example, such information may include the receipt number of the most current Form I-129 extension of stay request filed for the H-1B nonimmigrant or the receipt number of the approved Form I-140 petition filed for the H-1B nonimmigrant. Failure to provide necessary information about the H-1B nonimmigrant may result in a delay in the adjudication or denial of your application for employment authorization.Photos for card productionTwo identical two-by-two-inch passport-style color photographs of yourselfTranslationsIf you submit any documents containing a foreign language to USCIS, you must also submit a full English language translation that the translator has certified as complete and accurate. The translator must also certify that they are competent to translate from the foreign language into English.Form Filing TipsWhen filing Form I-765, please mail it to the proper location based on the chart below.If you are submitting your Form I-765…Then please file your application at…As a standalone application because you are currently in H-4 status and do not need to extend your statusThe Lockbox address found on our Direct Filing Addresses for Form I-765 web page.Together with Form I-539 seeking a change to or extension of H-4 statusThe Lockbox address found on our Direct Filing Addresses for Form I-765 web page.Together with Form I-129 seeking H-1B status for your spouse and Form I-539, seeking a change to or extension of H-4 status for yourselfThe service center with jurisdiction over Form I-129. Please see our Direct Filing Addresses for Form I-129 web page for more information.For your convenience, you may file Form I-765 with Form I-539, Application to Extend/Change Nonimmigrant Status, or with both Form I-539 and the Form I-129, Petition for a Nonimmigrant Worker, filed for the H-1B principal nonimmigrant. However, we will not make a decision on your Form I-765 until after we have adjudicated your Form I-539 and determined whether you are eligible for the underlying H-4 nonimmigrant status, whether your spouse is eligible for the underlying H-1B nonimmigrant status, or both. Go to the Filing Form I-765 with Other Forms page for more information on filing these forms togetherValidity of Employment AuthorizationYou will not be authorized to work until USCIS approves your Form I-765. Once your employment authorization is approved, the expiration date on your Employment Authorization Document (Form I-766 EAD) should be the same date as the expiration date on your most recent Form I-94 indicating your H-4 nonimmigrant status. Generally, you are only authorized to work through the expiration date on your EAD. If you are still eligible for employment authorization after that date, you should file for a renewal EAD by submitting another Form I-765. You cannot file for a renewal EAD more than 180 days before your original EAD expiresYou may qualify for automatic extension of your existing employment authorization. See our Automatic Employment Authorization Document (EAD) Extension page for more information on this automatic extension.Avoid Immigration ScamsSome unauthorized practitioners may try to take advantage of you by claiming they can file an EAD. These same individuals may ask that you pay them to file such forms. To learn the facts about how to protect yourself and your family from scams, please visit www.uscis.gov/avoidscams.\n      \n      \n\n                \n  \n  \n    \n              \n    Last Reviewed/Updated:\n                08/02/2024\n\n      \n  \n\n      \n\n      \n\n  \n\n                              \n\n                                \n      \n    \n        \n          \n\n  \n      \n    Was this page helpful?\n  \n  \n                \n          \n          Yes\n    \n\n          \n          No\n    \n\n\n          \n\n\n        This page was not helpful because the content:\n          Select a reasonhas too little informationhas too much informationis confusingis out of dateother\n      \n\n        How can the content be improved?\n          \n  \n\n\n      0 / 2000To protect your privacy, please do not include any personal information in your feedback. Review our Privacy Policy.\n      \n\n\n\n\n      \n\n  \n\n              \n                \n            \n          \n        \n\n              \n    \n                                \n  \n    \n\n  \n    \n      Return to top\n    \n\n           \n         \n           \n                                         \n                 \n\n                      \n                          \n        Topics\n              \n                      \n        Forms\n              \n                      \n        Newsroom\n              \n                      \n        Citizenship\n              \n                      \n        Green Card\n              \n                      \n        Laws\n              \n                      \n        Tools\n              \n        \n  \n\n\n\n\n\n                 \n               \n             \n                     \n                               \n       \n                            \n        \n          \n\n                      \n              \n                \n                  \n              \n                              \n                                                              \n                  \n                                                                  \n                                                      \n                              Facebook\n                            \n                                                  \n                                                                                        \n                                                      \n                              Twitter\n                            \n                                                  \n                                                                                        \n                                                      \n                              YouTube\n                            \n                                                  \n                                                                                                                                                                            \n                                                      \n                              Instagram\n                            \n                                                  \n                                                                                        \n                                                      \n                              LinkedIn\n                            \n                                                  \n                                                                                        \n                                                      \n                              Email\n                            \n                                                  \n                                                            \n\n                                  \n                                          Contact USCIS\n                                      \n                                  \n                    \n                                                                \n                  \n                \n                          \n          \n          \n        \n      \n    \n      \n        \n          \n            \n              \n                \n                  \n                    \n                  \n                Agency description\n                \n                  USCIS.gov\n                  \n                    An official website of the U.S. Department of Homeland Security\n                  \n                \n              \n            \n              \n    \n\n\n            \n  Important links\n  \n\n        \n  \n    \n                                                                                                                                About USCIS                                                  \n                                                Accessibility                                                  \n                                                Budget and Performance                                                  \n                                                DHS Components                                                  \n                                    \n                                                                                                                            Freedom of Information Act                                                  \n                                                No FEAR Act Data                                                  \n                                                Privacy and Legal Disclaimers                                                  \n                                                Site Map                                                  \n                                    \n                                                                                                                            Office of the Inspector General                                                  \n                                                The White House                                                  \n                                                USA.gov                                                  \n                                    \n                                                \n\n          \n  \n\n\n  \n\n\n  \n\n                        \n              \n                Looking for U.S. government information and services?\n                Visit USA.gov\n              \n            \n          \n                      \n                \n            \n                  \n      \n    \n  \n\n\n  \n\n    \n      \n    \n        \n                      \n//<![CDATA[\n\n(function(){var g=function(e,h,f,g){\nthis.get=function(a){for(var a=a+\"=\",c=document.cookie.split(\";\"),b=0,e=c.length;b<e;b++){for(var d=c[b];\" \"==d.charAt(0);)d=d.substring(1,d.length);if(0==d.indexOf(a))return d.substring(a.length,d.length)}return null};\nthis.set=function(a,c){var b=\"\",b=new Date;b.setTime(b.getTime()+6048E5);b=\"; expires=\"+b.toGMTString();document.cookie=a+\"=\"+c+b+\"; path=/; \"};\nthis.check=function(){var a=this.get(f);if(a)a=a.split(\":\");else if(100!=e)\"v\"==h&&(e=Math.random()>=e/100?0:100),a=[h,e,0],this.set(f,a.join(\":\"));else return!0;var c=a[1];if(100==c)return!0;switch(a[0]){case \"v\":return!1;case \"r\":return c=a[2]%Math.floor(100/c),a[2]++,this.set(f,a.join(\":\")),!c}return!0};\nthis.go=function(){if(this.check()){var a=document.createElement(\"script\");a.type=\"text/javascript\";a.src=g;document.body&&document.body.appendChild(a)}};\nthis.start=function(){var t=this;\"complete\"!==document.readyState?window.addEventListener?window.addEventListener(\"load\",function(){t.go()},!1):window.attachEvent&&window.attachEvent(\"onload\",function(){t.go()}):t.go()};};\ntry{(new g(100,\"r\",\"QSI_S_ZN_3WrTsyl9WWQdlxb\",\"https://zn3wrtsyl9wwqdlxb-uscisomnichannel.gov1.siteintercept.qualtrics.com/SIE/?Q_ZID=ZN_3WrTsyl9WWQdlxb\")).start()}catch(i){}})();\n\n//]]>\n\n\n      \n      \n  \n    \n        \n                      \n  /*<![CDATA[*/\n  (function() {\n    var sz = document.createElement('script'); sz.type = 'text/javascript'; sz.async = true;\n    sz.src = '//siteimproveanalytics.com/js/siteanalyze_10709.js';\n    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(sz, s);\n  })();\n  /*]]>*/\n\n      \n      \n\n  \n\n\n\n  \n\n    \n    {\"path\":{\"baseUrl\":\"\\/\",\"scriptPath\":null,\"pathPrefix\":\"\",\"currentPath\":\"node\\/48037\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\"},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"gtm\":{\"tagId\":null,\"settings\":{\"data_layer\":\"dataLayer\",\"include_classes\":false,\"allowlist_classes\":\"google\\nnonGooglePixels\\nnonGoogleScripts\\nnonGoogleIframes\",\"blocklist_classes\":\"customScripts\\ncustomPixels\",\"include_environment\":false,\"environment_id\":\"\",\"environment_token\":\"\"},\"tagIds\":[\"GTM-WK8MXNN\"]},\"gtag\":{\"tagId\":\"\",\"otherIds\":[],\"events\":[],\"additionalConfigInfo\":[]},\"ajaxPageState\":{\"libraries\":\"admin_feedback\\/admin_feedback_block,admin_feedback\\/admin_feedback_css,admin_feedback_extended\\/feedback_extended,asset_injector\\/css\\/qualtrics_popup_dialog,asset_injector\\/css\\/rtl_table_heading,asset_injector\\/js\\/force_enable_reset,asset_injector\\/js\\/preview_message_bar,asset_injector\\/js\\/translation_helper,calendar\\/calendar.theme,ckeditor_accordion\\/accordion.frontend,ckeditor_indentblock\\/indentblock,classy\\/base,classy\\/messages,clientside_validation_jquery\\/cv.jquery.ife,core\\/normalize,dhs_uswds\\/global,dhs_uswds\\/uswds,extlink\\/drupal.extlink,google_tag\\/gtag,google_tag\\/gtag.ajax,google_tag\\/gtm,system\\/base,tb_megamenu\\/theme.tb_megamenu,uscis_design\\/global-styling,uscis_design\\/select-component,usfedgov_google_analytics\\/load-analytics-cdn,uswds\\/drupal\",\"theme\":\"uscis_design\",\"theme_token\":null},\"ajaxTrustedUrl\":{\"form_action_p_pvdeGsVG5zNF_XLGPTvYSKCf43t8qZYSwcfZl2uzM\":true},\"clientside_validation_jquery\":{\"validate_all_ajax_forms\":2,\"force_validate_on_blur\":false,\"messages\":{\"required\":\"This field is required.\",\"remote\":\"Please fix this field.\",\"email\":\"Please enter a valid email address.\",\"url\":\"Please enter a valid URL.\",\"date\":\"Please enter a valid date.\",\"dateISO\":\"Please enter a valid date (ISO).\",\"number\":\"Please enter a valid number.\",\"digits\":\"Please enter only digits.\",\"equalTo\":\"Please enter the same value again.\",\"maxlength\":\"Please enter no more than {0} characters.\",\"minlength\":\"Please enter at least {0} characters.\",\"rangelength\":\"Please enter a value between {0} and {1} characters long.\",\"range\":\"Please enter a value between {0} and {1}.\",\"max\":\"Please enter a value less than or equal to {0}.\",\"min\":\"Please enter a value greater than or equal to {0}.\",\"step\":\"Please enter a multiple of {0}.\"}},\"data\":{\"extlink\":{\"extTarget\":false,\"extTargetNoOverride\":false,\"extNofollow\":false,\"extNoreferrer\":false,\"extFollowNoOverride\":false,\"extClass\":\"ext\",\"extLabel\":\"(link is external)\",\"extImgClass\":false,\"extSubdomains\":true,\"extExclude\":\"\\\\.gov|\\\\.mil\",\"extInclude\":\"web\\\\.archive\\\\.org\",\"extCssExclude\":\".footer-social-media__links,.usa-footer__contact-links\",\"extCssExplicit\":\"\",\"extAlert\":true,\"extAlertText\":\"You are now leaving an official website of U.S. Citizenship and Immigration Services. Links to non-USCIS sites are provided for the visitor\\u2018s convenience and do not represent an endorsement by USCIS of any commercial or private issues, products or services. Note that the privacy policy of the linked site may differ from that of USCIS.\",\"mailtoClass\":\"0\",\"mailtoLabel\":\"(link sends email)\",\"extUseFontAwesome\":true,\"extIconPlacement\":\"append\",\"extFaLinkClasses\":\"far fa-external-link-alt\",\"extFaMailtoClasses\":\"fa fa-envelope-o\",\"whitelistedDomains\":[]}},\"ckeditorAccordion\":{\"accordionStyle\":{\"collapseAll\":0,\"keepRowsOpen\":0,\"animateAccordionOpenAndClose\":0,\"openTabsWithHash\":0}},\"admin_feedback\":{\"yes_response\":\"Unused\",\"no_response\":\"This page was not helpful because the content:\",\"custom_text_response_on_no\":{\"value\":\"\",\"format\":\"full_html\"},\"feedback_prompt_on_yes\":true,\"feedback_prompt_on_no\":true,\"feedback_enable_predefined_answers\":true,\"feedback_prompt\":\"Great!  Any other feedback? (Optional)\",\"feedback_allow_cancel\":{\"active\":false,\"timeout\":3},\"final_response\":\"Thank you for your feedback.\"},\"TBMegaMenu\":{\"TBElementsCounter\":{\"column\":15},\"theme\":\"uscis_design\"},\"user\":{\"uid\":0,\"permissionsHash\":\"3b6956a260aed539487495a59fc0d31d7bc833a987b30b49c2e3df9582097b29\"}}\n\n\n\n\n\n\n\n\n\n  \n\n"
}