{
    "content": "\n    <iframe src=\"https://www.googletagmanager.com/ns.html?id=GTM-WK8MXNN\"\n                  height=\"0\" width=\"0\" style=\"display:none;visibility:hidden\"></iframe>\n\n      \n    \n\n\n\n\n\n  \n\n  \n        \n      Skip to main content\n    \n\n    \n          \n        \n            \n      \n    \n        \n                      \n\n\nAn official website of the United States government    Here's how you know\n\n\n      \n      \n\n  \n\n            \n      \n    \n        \n          Español\n      \n  \n    \n        \n                      \n  \n  \n   Multilingual Resources\n\n\n      \n      \n\n  \n\n        \n      \n    \n          \n        \n            \n      \n    \n        \n                      \n\n\n\nOfficial websites use .gov\nA .gov website belongs to an official government organization in the United States.\n\n\n\n\n\n\n\nSecure .gov websites use HTTPS\nA lock ( A locked padlock  ) or https:// means you've safely connected to the .gov website. Share sensitive information only on official, secure websites.\n\n\n\n      \n      \n\n  \n\n        \n      \n    \n    \n              \n      \n      \n          \n      \n    \n        \n          \n      \n        \n      \n    \n      \n  \n  \n    \n        \n                      \n\n//<![CDATA[\n\n    \n//]]>\n \n\n\n\n\n\n\n\nSign In  \n\n\n\n\nAccess USCIS online services.\n\n\nSign In\n\tCreate Account\n\n\n\n\n\n      \n      \n\n  \n\n        Menu\n      \n\n      \n        \n          \n        \n          \n      \n    \n        \n                      Sign In \n\nCreate Account\n\n      \n      \n\n\n        \n          Topics      \n        Topics\n        \n                \n    \n        \n          Family                    \n    \n        \n          Family of Green Card Holders (Permanent Residents)              \n            \n\n        \n          Family of Refugees and Asylees              \n            \n\n        \n          Family of U.S. Citizens              \n            \n\n  \n\n  \n\n\n\n            \n\n        \n          Adoption                    \n    \n        \n          Before You Start              \n            \n\n        \n          Immigration through Adoption              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Military                    \n    \n        \n          Citizenship for Military Family Members              \n            \n\n        \n          Naturalization Through Military Service              \n            \n\n  \n\n  \n\n\n\n            \n\n        \n          Humanitarian                    \n    \n        \n          Humanitarian Parole              \n            \n\n        \n          Refugees and Asylum              \n            \n\n        \n          Temporary Protected Status              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Visit the U.S.                    \n    \n        \n          Change My Nonimmigrant Status              \n            \n\n        \n          Extend Your Stay              \n            \n\n  \n\n  \n\n\n\n            \n\n        \n          Working in the United States                    \n    \n        \n          Permanent Workers              \n            \n\n        \n          Temporary (Nonimmigrant) Workers              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Avoid Scams                    \n    \n        \n          Common Scams              \n            \n\n        \n          Find Legal Services              \n            \n\n        \n          Report Immigration Scams              \n            \n\n  \n\n  \n\n\n\n            \n\n        \n          Careers at USCIS                    \n    \n        \n          Career Opportunities              \n            \n\n        \n          Special Hiring Programs              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n        \n          Forms      \n        Forms\n        \n                \n    \n        \n          Most Accessed Forms                    \n    \n        \n          I-485, Application to Register Permanent Residence or Adjust Status              \n            \n\n        \n          I-765, Application for Employment Authorization              \n            \n\n        \n          I-90, Application to Replace Permanent Resident Card (Green Card)              \n            \n\n        \n          N-400, Application for Naturalization              \n            \n\n  \n\n  \n\n\n\n            \n\n        \n          All Forms              \n            \n\n        \n          File Online              \n            \n\n  \n\n  \n\n    \n    \n        \n          Family Based Forms                    \n    \n        \n          I-129F, Petition for Alien Fiancé(e)              \n            \n\n        \n          I-130, Petition for Alien Relative              \n            \n\n        \n          I-360, Petition for Amerasian, Widow(er), or Special Immigrant              \n            \n\n        \n          I-600, Petition to Classify Orphan as an Immediate Relative              \n            \n\n        \n          I-751, Petition to Remove Conditions on Residence              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Employment Based Forms                    \n    \n        \n          I-9, Employment Eligibility Verification              \n            \n\n        \n          I-129, Petition for a Nonimmigrant Worker              \n            \n\n        \n          I-140, Immigrant Petition for Alien Workers              \n            \n\n        \n          I-526, Immigrant Petition by Standalone Investor              \n            \n\n        \n          I-539, Application to Extend/Change Nonimmigrant Status              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Humanitarian Based Forms                    \n    \n        \n          I-134A, Online Request to be a Supporter and Declaration of Financial Support              \n            \n\n        \n          I-589, Application for Asylum and for Withholding of Removal              \n            \n\n        \n          I-730, Refugee/Asylee Relative Petition              \n            \n\n        \n          I-821, Application for Temporary Protected Status              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n        \n          Newsroom      \n        Newsroom\n        \n                \n    \n        \n          All News                    \n    \n        \n          Alerts              \n            \n\n        \n          Fact Sheets              \n            \n\n        \n          News Releases              \n            \n\n        \n          Stakeholder Messages              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Media Contacts              \n            \n\n        \n          Multimedia Gallery              \n            \n\n        \n          Social Media Directory              \n            \n\n        \n          Speeches, Statements, Testimony              \n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n        \n          Citizenship      \n        Citizenship\n        \n                \n    \n        \n          Learners                    \n    \n        \n          Apply for Citizenship              \n            \n\n        \n          Learn About Citizenship              \n            \n\n        \n          Naturalization Test and Study Resources              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Educators                    \n    \n        \n          Educational Products for Educators              \n            \n\n        \n          Resources for Educational Programs              \n            \n\n        \n          Teacher Training Sessions              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Organizations                    \n    \n        \n          Outreach Tools              \n            \n\n        \n          Civic Integration              \n            \n\n        \n          Interagency Strategy for Promoting Naturalization              \n            \n\n        \n          Naturalization-Related Data and Statistics              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Grants                    \n    \n        \n          Learn About the Citizenship and Integration Grant Program              \n            \n\n        \n          Success Stories from Grant Recipients              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n        \n          Green Card      \n        Green Card\n        \n                \n    \n        \n          Green Card Processes and Procedures                    \n    \n        \n          Adjustment of Status              \n            \n\n        \n          After We Grant Your Green Card              \n            \n\n        \n          Employment Authorization Document              \n            \n\n        \n          Visa Availability and Priority Dates              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Green Card Eligibility Categories              \n            \n\n        \n          How to Apply for a Green Card              \n            \n\n        \n          Replace Your Green Card              \n            \n\n        \n          While Your Green Card Application Is Pending with USCIS              \n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n        \n          Laws      \n        Laws\n        \n                \n    \n        \n          Legislation                    \n    \n        \n          Immigration and Nationality Act              \n            \n\n  \n\n  \n\n\n\n            \n\n        \n          Class Action, Settlement Notices and Agreements              \n            \n\n        \n          Unlawful Presence and Inadmissibility              \n            \n\n        \n          Policy Manual              \n            \n\n  \n\n  \n\n    \n    \n        \n          Regulations              \n            \n\n        \n          Administrative Appeals              \n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n        \n          Tools      \n        Tools\n        \n                \n    \n        \n          Self-Help Tools                    \n    \n        \n          Check Case Processing Times              \n            \n\n        \n          Case Status Online              \n            \n\n        \n          Change of Address              \n            \n\n        \n          E-Request              \n            \n\n        \n          Password Resets and Technical Support              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Website Resources                    \n    \n        \n          Archive              \n            \n\n        \n          A-Z Index              \n            \n\n        \n          Website Policies              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Additional Resources                    \n    \n        \n          Explore my Options              \n            \n\n        \n          Immigration and Citizenship Data              \n            \n\n        \n          Multilingual Resource Center              \n            \n\n        \n          USCIS Tools and Resources              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n  \n\n\n  \n    \n        \n                      Contact us\n\tMultilingual Resources\n\t\n\n      \n      \n\n  \n\n      \n\n              \n          \n  \n\n      \n  \n  \n                    \n    \n\n  \n\n            \n\n      \n              \n                      \n                  \n            \n                  \n        \n                  \n                            \n    \n  \n\n                      \n        \n                  \n        \n        \n                                    \n                  \n    \n            \n  Main navigation\n  \n\n        \nSkip to main content\n\n      \n          Working in the United StatesInternational Entrepreneur RuleTemporary WorkersCW-1: CNMI-Only Transitional WorkerE-1 Treaty TradersE-2 CNMI InvestorE-2 Treaty InvestorsE-3 Certain Specialty Occupation Professionals from AustraliaH-1B Specialty OccupationsH-1B Cap SeasonFAQs for Individuals in H-1B Nonimmigrant StatusH-1B Electronic Registration ProcessOrganizational Accounts Frequently Asked QuestionsExtension of Post Completion Optional Practical Training (OPT) and F-1 Status for Eligible Students under the H-1B Cap-Gap RegulationsEmployment Authorization for Certain H-4 Dependent SpousesH-2A Agricultural WorkersH-2B Non-Agricultural WorkersH-3 Nonimmigrant TraineeI Representatives of Foreign MediaL-1A Intracompany Transferee Executive or ManagerL-1B Intracompany Transferee Specialized KnowledgeO-1 Individuals with Extraordinary Ability or AchievementO Nonimmigrant Classifications: Question and AnswersP-1A Internationally Recognized AthleteP-1B Member of Internationally Recognized Entertainment GroupP-2 Performer or Group Performing under Reciprocal Exchange ProgramP-3 Artist or Entertainer Part of a Culturally Unique ProgramQ Cultural ExchangeR-1 Temporary Religious WorkersTN NAFTA ProfessionalsPermanent WorkersEmployment-Based Immigration: First Preference EB-1Employment-Based Immigration: Second Preference EB-2Employment-Based Immigration: Third Preference EB-3Employment-Based Immigration: Fourth Preference EB-4Special Immigrant JuvenilesSpecial Immigrant Juvenile (SIJ) Frequently Asked QuestionsReligious WorkersEmployment-Based Immigration: Fifth Preference EB-5EB-5 Immigrant Investor Regional CentersEB-5 Integrity FundAbout the EB-5 Visa ClassificationEB-5 Immigrant Investor ProcessSTEM Employment PathwaysImmigrant Pathways for STEM Employment in the United StatesNonimmigrant Pathways for STEM Employment in the United StatesEntrepreneur Employment PathwaysImmigrant Pathways for Entrepreneur Employment in the United StatesNonimmigrant or Parole Pathways for Entrepreneur Employment in the United StatesStudents and Exchange VisitorsConrad 30 Waiver ProgramExchange VisitorsStudents and EmploymentTemporary Visitors for BusinessB-1 Temporary Business VisitorGB Temporary Business Visitor to GuamWB Temporary Business Visitor under Visa Waiver ProgramInformation for Employers and EmployeesAutomatic Employment Authorization Document (EAD) ExtensionDHS Support of the Enforcement of Labor and Employment LawsEmployer InformationEmployment AuthorizationVIBEEmployment Authorization in Compelling CircumstancesOptions for Nonimmigrant Workers Following Termination of EmploymentReport Labor AbusesPetition Process OverviewImportant Information About Working Legally in the United States    \n    \n  \n\n\n  \n\n  \n\n              \n                      \n          \n                            \n      \n    \n        \n            \n    Breadcrumb\n    \n              \n          Home        \n              \n          Working in the United States        \n              \n          Temporary Workers        \n              \n          H-1B Specialty Occupations        \n          \n  \n\n      \n\n  \n\n            \n            \n            \n                              \n              \n              \n                                    \n      \n    \n        \n          \n\n      \n                \n\n                        \n            \n              H-1B Specialty Occupations\n            \n          \n              \n                    \n      \n  \n                      \n\n\n\n  \n  Alert Type info\n    \n              ALERT: USCIS has extended the initial registration period for the fiscal year (FY) 2025 H-1B cap. The initial registration period, which opened at noon Eastern on March 6, 2024, and was originally scheduled to run through noon Eastern on March 22, will now run through noon Eastern on March 25, 2024. USCIS is aware of a temporary system outage experienced by some registrants, and is extending the registration period to provide additional time due to this issue. Read more here: USCIS Extends Initial Registration Period for FY 2025 H-1B Cap.\n          \n      \n\n\n\n\n\n  \n  Alert Type info\n    \n              ALERT: On April 1, 2024, USCIS service centers will no longer accept Form I-129 petitions requesting H-1B or H-1B1 (HSC) classification.We will reject H-1B or H-1B1 (HSC) petitions received at a USCIS service center on or after April 1, 2024. There will be no grace period provided.Beginning on April 1, 2024, all paper-filed Form I-129 petitions requesting H-1B1 (HSC), or H-1B classification, including those with a concurrent Form I-907, Request for Premium Processing Service, and those with concurrently filed Form I-539 and/or Form I-765, must be filed at a USCIS lockbox facility. If you are filing Form I-129 alone or with Form I-907, you may also file online. On March 25, USCIS launched online filing of Form I-129 and associated Form I-907 for non-cap H-1B petitions. On April 1, USCIS will begin accepting online filing for H-1B cap petitions and associated Forms I-907 for petitioners whose registrations have been selected. You can find the lockbox filing addresses for paper filed forms on our Form I-129 Direct Filing Addresses page. \n          \n      \n\n\n\n\n\n  \n  Alert Type info\n    \n              ALERT: On March 25, USCIS launched online filing of Form I-129 and associated Form I-907 for non-cap H-1B petitions. On April 1, USCIS will begin accepting online filing for H-1B cap petitions and associated Forms I-907 for petitioners whose registrations have been selected.On Feb. 28, 2024, we launched new USCIS organizational accounts that will allow multiple people within a company and their legal representatives to collaborate and prepare H-1B registrations, H-1B petitions, and associated requests for premium processing. Petitioners will continue to have the option of filing a paper Form I-129 H-1B petition and any associated Form I-907 if they prefer. However, during the initial launch of organizational accounts, users will not be able to link paper-filed Forms I-129 and I-907 to their online accounts. \n          \n      \n\n\n\n\n\n  \n  Alert Type info\n    \n              Alert: H-1B petitions can be portable from one job to another. For information about petitioning for a beneficiary in valid H-1B nonimmigrant status and when they may begin new H-1B employment, regardless of whether they are currently employed or have been terminated, click on “Changing Employers or Employment Terms with the Same Employer (Portability)” below. For more information, including options for H-1B beneficiaries who have been terminated, visit Options for Nonimmigrant Workers Following Termination of Employment.\n          \n      \n\nThis nonimmigrant classification applies to people who wish to perform services in a specialty occupation, services of exceptional merit and ability relating to a Department of Defense (DOD) cooperative research and development project, or services as a fashion model of distinguished merit or ability.Eligibility CriteriaClassificationGeneral Requirements (among others)Labor Condition Application Required?H-1B Specialty OccupationsThe occupation requires:Theoretical and practical application of a body of highly specialized knowledge; andAttainment of a bachelor's or higher degree in the specific specialty (or its equivalent) as a minimum for entry into the occupation in the United States.The position must also meet one of the following criteria to qualify as a specialty occupation:Bachelor’s or higher degree or its equivalent is normally the minimum entry requirement for the particular positionThe degree requirement is common to the industry in parallel positions among similar organizations or, in the alternative, the job is so complex or unique that it can be performed only by an individual with a degreeThe employer normally requires a degree or its equivalent for the positionThe nature of the specific duties is so specialized and complex that the knowledge required to perform the duties is usually associated with the attainment of a bachelor’s or higher degree.*For you to qualify to perform services in a specialty occupation you must meet one of the following criteria:Hold a U.S. bachelor’s or higher degree required by the specialty occupation from an accredited college or universityHold a foreign degree that is the equivalent to a U.S. bachelor’s or higher degree required by the specialty occupation from an accredited college or universityHold an unrestricted state license, registration, or certification that authorizes you to fully practice the specialty occupation and be immediately engaged in that specialty in the state of intended employmentHave education, specialized training, and/or progressively responsible experience that is equivalent to the completion of a U.S. bachelor’s or higher degree in the specialty occupation, and have recognition of expertise in the specialty through progressively responsible positions directly related to the specialty.**Yes. The prospective petitioner must include a Form ETA-9035/9035E, Labor Condition Application (LCA) certified by the Department of Labor (DOL), with the Form I-129, Petition for a Nonimmigrant Worker. See the DOL’s Office of Foreign Labor Certification.For more information see the Information for Employers and Employees page.H-1B2DOD Researcher and Development Project WorkerThe job must require a bachelor’s or higher degree, or its equivalent, to perform the duties. The petition must be accompanied by:A verification letter from the DOD project manager for the particular project stating that the beneficiary will be working on a cooperative research and development project or a coproduction project under a reciprocal Government-to-Government agreement administered by DOD. Details about the specific project are not required.A general description of the beneficiary's duties on the particular project and the actual dates of the beneficiary's employment on the project.A statement indicating the names of noncitizens currently employed on the project in the United States and their dates of employment and the names of noncitizens whose employment on the project ended within the past year.To be eligible for this classification you must have a bachelor's or higher degree or its equivalent in the occupational field in which you will be performing services. This requirement can be met based on one of the following criteria:Hold a U.S. bachelor’s or higher degree required by the duties from an accredited college or universityHold a foreign degree that is the equivalent to a U.S. bachelor’s or higher degree from an accredited college or universityHold an unrestricted state license, registration, or certification that authorizes you to fully practice the duties of the job and be immediately engaged in that specialty in the state of intended employmentHave education, specialized training, or progressively responsible experience in the specialty that is equivalent to the completion a U.S. bachelor’s or higher degree, and have recognition of expertise in the specialty through progressively responsible positions directly related to the specialty.**No.H-1B3Fashion ModelThe position/services must require a fashion model of prominence.To be eligible for this visa category you must be a fashion model of distinguished merit and ability.Yes. The prospective petitioner must include a Form ETA-9035/9035E, Labor Condition Application (LCA) certified by the Department of Labor (DOL), with the Form I-129. See the links to the Department of Labor’s Office of Foreign Labor Certification.*For more information, see 8 CFR §214.2(h)(4)(iii)(A). “Normally,” “common,” and “usually” are interpreted based on their plain language, dictionary definitions. They are not interpreted to mean “always.” **For more information see 8 CFR §214.2(h)(4)(iii)(C).H-1B LicensingSome professions require an H-1B beneficiary to hold a state or local license authorizing the beneficiary to fully practice the specialty occupation.If an occupation in the state of intended employment requires such a license, an H-1B beneficiary seeking classification in that occupation generally must have that license before the petition is approved, rather than at the time of filing the petition. See 8 CFR 214.2(h)(4)(v)(A)–(B). When a license is required, but there is no evidence of the beneficiary holding one, USCIS will generally issue a request for evidence of the required license.H-1B Electronic Registration ProcessIn 2020, we implemented an electronic registration process for the H-1B cap. A cap-subject H-1B petition will not be considered to be properly filed unless it is based on a valid, selected registration for the same beneficiary and the appropriate fiscal year, unless the registration requirement is suspended. For more information about the H-1B registration process, visit our H-1B Electronic Registration Process webpage.Petition Filing ProcessStep 1: (only required for specialty occupation and fashion model petitions): Employer/Agent Submits LCA to DOL for Certification.The employer/agent must apply for and receive DOL certification of an LCA. For further information regarding LCA requirements and DOL's process, see the Foreign Labor Certification, Department of Labor page.Step 2: Employer/Agent Submits Completed Form I-129 to USCIS.The employer/agent should file Form I-129, Petition for a Nonimmigrant Worker, at the correct location or online.  Please see our I-129 Direct Filing Chart page. The DOL-certified LCA should be submitted with the Form I-129 (only for specialty occupation and fashion models). See the instructions to the Form I-129 (PDF, 549.11 KB) for additional filing requirements.Step 3: Prospective Workers Outside the United States Apply for Visa and/or Admission.Once the Form I-129 petition has been approved, the prospective H-1B worker who is outside the United States may apply with the U.S. Department of State (DOS) at a U.S. embassy or consulate abroad for an H-1B visa (if a visa is required). Regardless of whether a visa is required, the prospective H-1B worker must then apply to U.S. Customs and Border Protection (CBP) for admission to the United States in H-1B classification.Labor Condition Application (LCA)Prospective specialty occupation and distinguished fashion model employers/agents must obtain a certification of an LCA from the DOL. This application includes certain attestations, a violation of which can result in fines, bars on sponsoring nonimmigrant or immigrant petitions, and other sanctions to the employer/agent. The application requires the employer/agent to attest that it will comply with the following labor requirements:The employer/agent will pay the H-1B worker a wage which is no less than the wage paid to similarly qualified workers or, if greater, the prevailing wage for the position in the geographic area in which the H-1B worker will be working.The employer/agent will provide working conditions that will not adversely affect other similarly employed workers.At the time of the labor condition application there is no strike or lockout at the place of employment.Notice of the filing of the labor condition application with the DOL has been given to the union bargaining representative or has been posted at the place of employment.Period of StayAs an H-1B specialty occupation worker, you may be admitted for a period of up to 3 years. Your time period may be extended, but generally cannot go beyond a total of 6 years.However, you may be eligible for an H-1B extension beyond the sixth year under 8 CFR 214.2(h)(13)(iii)(E) if you are the beneficiary of an approved immigrant visa petition under the EB-1, EB-2, or EB-3 classifications, and are eligible to be granted that immigrant status but for application of the per country or worldwide limitations on immigrant visas. Petitioners must demonstrate the visa is not available as of the date they file an H-1B petition with USCIS. We may grant extensions on this basis in up to 3-year increments until we make a final decision to revoke the approval of the immigrant visa petition or to approve or deny your application for an immigrant visa or application to adjust status to lawful permanent residence.Alternatively, under 8 CFR 214.2(h)(13)(iii)(D), you may be eligible for an H-1B extension beyond the sixth year if at least 365 days have passed since a labor certification was filed with the Department of Labor on your behalf (if such certification is required) or an immigrant visa petition was filed with USCIS on your behalf. You are ineligible for this extension beyond the sixth year if you fail to file an adjustment of status application or apply for an immigrant visa within 1 year of an immigrant visa being available. If the accrual of such 1-year period is interrupted by the unavailability of an immigrant visa, you will have a new 1-year period after an immigrant visa again becomes immediately available, during which you generally must file an adjustment of status application or apply for an immigrant visa. We may, in our discretion, excuse a failure to file an adjustment of status application or apply for an immigrant visa within 1 year of an immigrant visa being available if your employer establishes that the failure to apply was due to circumstances beyond your control. When considering whether to excuse a failure to timely file within 1 year, we will look at the totality of the circumstances, which may include:whether there was a change of employment;whether the change of employment was voluntary;when and why the employment with the original employer ended; andwhat steps you and your new employer took after the change of employment to file an adjustment of status application or apply for an immigrant visa.We may excuse a failure to timely file in cases of both voluntary and involuntary change of employment when considering the totality of the circumstances. We may grant extensions under this provision in up to 1-year increments until the approved permanent labor certification expires or  a final decision has been made to:deny the application for permanent labor certification, or, if approved, to revoke or invalidate the approval;deny the immigrant visa petition, or, if approved, revoke the approval;deny or approve your application for an immigrant visa or application to adjust status to lawful permanent residence; oradministratively or otherwise close the application for permanent labor certification, immigrant visa petition, or application to adjust status.       Your employer will be liable for the reasonable costs of your return transportation if they terminate your employment before the end of your period of authorized stay. Your employer is not responsible for the costs of your return transportation if you voluntarily resign from your position. For more information, please see Options for Nonimmigrant Workers Following Termination of Employment.H-1B CapThe H-1B classification has an annual numerical limit (cap) of 65,000 new statuses/visas each fiscal year. An additional 20,000 petitions filed on behalf of beneficiaries with a master’s degree or higher from a U.S. institution of higher education are exempt from the cap. Additionally, H-1B workers who are petitioned for or employed at an institution of higher education or its affiliated or related nonprofit entities, a nonprofit research organization, or a government research organization, are not subject to this numerical cap.For further information about the numerical cap, see our H-1B Cap Season page.Changing Employers or Employment Terms with the Same Employer (Portability)Changing EmployersWhen can I begin working for a new H-1B employer if I change employers?If you are changing H-1B employers, you may begin working for the new employer as soon as they properly file a non-frivolous Form I-129 petition on your behalf, or as of the requested start date on that petition, whichever is later.To  be eligible for portability, you must not have been employed without authorization from the time of your last admission into the United States, and your new employer must properly file a new, non-frivolous petition before your H-1B period of authorized stay expires.Will I still have employment authorization if I change employers?If you are eligible for H-1B portability, your employment is authorized until USCIS has made a decision on the Form I-129.If the new I-129 petition is approved, you may continue working for the new employer for the period of time indicated on the new petition approval.If the new petition is denied, you may continue working for your previous employer if your prior period of authorized employment is still valid, but your authorization to work based on portability ceases upon denial of the petition.If you are laid off, fired, quit, or otherwise cease employment with your previous employer, you may have up to 60 consecutive days or until the end of your authorized validity period, whichever is shorter, to find new employment, change status, or depart the country.Can I move from cap-exempt to cap-subject employment?If you are moving from cap-exempt to cap-subject employment, your new employer’s H‑1B petition will be subject to the H-1B cap. If subject to the cap, your new employer must first submit an electronic registration when registration period opens. This is typically in March.If more unique beneficiaries are registered than projected as needed to meet the cap for a given fiscal year, unique beneficiaries of properly submitted registrations will be randomly selected. All registrants of selected beneficiaries will be notified of selection and selection notices will be uploaded to their account informing them that they may file a petition for the beneficiary named in the selection notice during the applicable filing period.  H-1B cap petitions must have a start date of Oct. 1 (or later) of the applicable fiscal year and may not be filed more than 6 months before the requested start date on the petition.If you are currently employed in a cap-exempt position, you may engage in concurrent employment in a cap-subject position as long as you will continue to be employed in the cap-exempt position. You may begin working concurrently for the cap-subject employer as soon as they properly file a non-frivolous Form I-129 petition on your behalf, or as of the requested start date on that petition, whichever is later. As long as you continue your cap-exempt employment, were previously counted toward the cap, or otherwise remain cap exempt, you will not become subject to the H-1B cap again during the same H-1B validity period.Changing Employment Terms with the Same EmployerWhat if I want to start new employment or change employment terms with my current employer?Form I-129 is also used to request new employment or a change of employment with the same employer.If your current H-1B employer properly files a non-frivolous Form I-129 requesting new employment or a change of employment on your behalf, you are authorized to work according to the terms of the new or changed employment once that petition is filed, or as of the requested start date on that petition, whichever is later.Family of H-1B Visa HoldersYour spouse and unmarried children under 21 years of age may seek admission in the H-4 nonimmigrant classification. Certain H-4 dependent spouses of H-1B nonimmigrants can file Form I-765, Application for Employment Authorization, as long as the H-1B nonimmigrant has already started the process of seeking employment-based lawful permanent resident status. Please visit our Employment Authorization for Certain H-4 Dependent Spouses page to learn more.More InformationH-1B Cap SeasonEmployment Authorization for Certain H-4 Dependent SpousesFee Increase for Certain H-1B and L-1 Petitions (Public Law 114-113)Combating Fraud and Abuse in the H-1B Visa ProgramH-1B Electronic Registration ProcessQuestions about Same or Similar Occupational Classifications Under the American Competitiveness in the Twenty-first Century Act of 2000 (AC21)Frequently Asked Questions about Part 6 of Form I-129, Petition for a Nonimmigrant WorkerFAQs for Individuals in H-1B Nonimmigrant Status\n      \n      \n\n                \n  \n  \n    \n              \n    Last Reviewed/Updated:\n                07/18/2024\n\n      \n  \n\n      \n\n      \n\n  \n\n                              \n\n                                \n      \n    \n        \n          \n\n  \n      \n    Was this page helpful?\n  \n  \n                \n          \n          Yes\n    \n\n          \n          No\n    \n\n\n          \n\n\n        This page was not helpful because the content:\n          Select a reasonhas too little informationhas too much informationis confusingis out of dateother\n      \n\n        How can the content be improved?\n          \n  \n\n\n      0 / 2000To protect your privacy, please do not include any personal information in your feedback. Review our Privacy Policy.\n      \n\n\n\n\n      \n\n  \n\n              \n                \n            \n          \n        \n\n              \n    \n                                \n  \n    \n\n  \n    \n      Return to top\n    \n\n           \n         \n           \n                                         \n                 \n\n                      \n                          \n        Topics\n              \n                      \n        Forms\n              \n                      \n        Newsroom\n              \n                      \n        Citizenship\n              \n                      \n        Green Card\n              \n                      \n        Laws\n              \n                      \n        Tools\n              \n        \n  \n\n\n\n\n\n                 \n               \n             \n                     \n                               \n       \n                            \n        \n          \n\n                      \n              \n                \n                  \n              \n                              \n                                                              \n                  \n                                                                  \n                                                      \n                              Facebook\n                            \n                                                  \n                                                                                        \n                                                      \n                              Twitter\n                            \n                                                  \n                                                                                        \n                                                      \n                              YouTube\n                            \n                                                  \n                                                                                                                                                                            \n                                                      \n                              Instagram\n                            \n                                                  \n                                                                                        \n                                                      \n                              LinkedIn\n                            \n                                                  \n                                                                                        \n                                                      \n                              Email\n                            \n                                                  \n                                                            \n\n                                  \n                                          Contact USCIS\n                                      \n                                  \n                    \n                                                                \n                  \n                \n                          \n          \n          \n        \n      \n    \n      \n        \n          \n            \n              \n                \n                  \n                    \n                  \n                Agency description\n                \n                  USCIS.gov\n                  \n                    An official website of the U.S. Department of Homeland Security\n                  \n                \n              \n            \n              \n    \n\n\n            \n  Important links\n  \n\n        \n  \n    \n                                                                                                                                About USCIS                                                  \n                                                Accessibility                                                  \n                                                Budget and Performance                                                  \n                                                DHS Components                                                  \n                                    \n                                                                                                                            Freedom of Information Act                                                  \n                                                No FEAR Act Data                                                  \n                                                Privacy and Legal Disclaimers                                                  \n                                                Site Map                                                  \n                                    \n                                                                                                                            Office of the Inspector General                                                  \n                                                The White House                                                  \n                                                USA.gov                                                  \n                                    \n                                                \n\n          \n  \n\n\n  \n\n\n  \n\n                        \n              \n                Looking for U.S. government information and services?\n                Visit USA.gov\n              \n            \n          \n                      \n                \n            \n                  \n      \n    \n  \n\n\n  \n\n    \n      \n    \n        \n                      \n//<![CDATA[\n\n(function(){var g=function(e,h,f,g){\nthis.get=function(a){for(var a=a+\"=\",c=document.cookie.split(\";\"),b=0,e=c.length;b<e;b++){for(var d=c[b];\" \"==d.charAt(0);)d=d.substring(1,d.length);if(0==d.indexOf(a))return d.substring(a.length,d.length)}return null};\nthis.set=function(a,c){var b=\"\",b=new Date;b.setTime(b.getTime()+6048E5);b=\"; expires=\"+b.toGMTString();document.cookie=a+\"=\"+c+b+\"; path=/; \"};\nthis.check=function(){var a=this.get(f);if(a)a=a.split(\":\");else if(100!=e)\"v\"==h&&(e=Math.random()>=e/100?0:100),a=[h,e,0],this.set(f,a.join(\":\"));else return!0;var c=a[1];if(100==c)return!0;switch(a[0]){case \"v\":return!1;case \"r\":return c=a[2]%Math.floor(100/c),a[2]++,this.set(f,a.join(\":\")),!c}return!0};\nthis.go=function(){if(this.check()){var a=document.createElement(\"script\");a.type=\"text/javascript\";a.src=g;document.body&&document.body.appendChild(a)}};\nthis.start=function(){var t=this;\"complete\"!==document.readyState?window.addEventListener?window.addEventListener(\"load\",function(){t.go()},!1):window.attachEvent&&window.attachEvent(\"onload\",function(){t.go()}):t.go()};};\ntry{(new g(100,\"r\",\"QSI_S_ZN_3WrTsyl9WWQdlxb\",\"https://zn3wrtsyl9wwqdlxb-uscisomnichannel.gov1.siteintercept.qualtrics.com/SIE/?Q_ZID=ZN_3WrTsyl9WWQdlxb\")).start()}catch(i){}})();\n\n//]]>\n\n\n      \n      \n  \n    \n        \n                      \n  /*<![CDATA[*/\n  (function() {\n    var sz = document.createElement('script'); sz.type = 'text/javascript'; sz.async = true;\n    sz.src = '//siteimproveanalytics.com/js/siteanalyze_10709.js';\n    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(sz, s);\n  })();\n  /*]]>*/\n\n      \n      \n\n  \n\n\n\n  \n\n    \n    {\"path\":{\"baseUrl\":\"\\/\",\"scriptPath\":null,\"pathPrefix\":\"\",\"currentPath\":\"node\\/47603\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\"},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"gtm\":{\"tagId\":null,\"settings\":{\"data_layer\":\"dataLayer\",\"include_classes\":false,\"allowlist_classes\":\"google\\nnonGooglePixels\\nnonGoogleScripts\\nnonGoogleIframes\",\"blocklist_classes\":\"customScripts\\ncustomPixels\",\"include_environment\":false,\"environment_id\":\"\",\"environment_token\":\"\"},\"tagIds\":[\"GTM-WK8MXNN\"]},\"gtag\":{\"tagId\":\"\",\"otherIds\":[],\"events\":[],\"additionalConfigInfo\":[]},\"ajaxPageState\":{\"libraries\":\"admin_feedback\\/admin_feedback_block,admin_feedback\\/admin_feedback_css,admin_feedback_extended\\/feedback_extended,asset_injector\\/css\\/qualtrics_popup_dialog,asset_injector\\/css\\/rtl_table_heading,asset_injector\\/js\\/force_enable_reset,asset_injector\\/js\\/preview_message_bar,asset_injector\\/js\\/translation_helper,calendar\\/calendar.theme,ckeditor_accordion\\/accordion.frontend,ckeditor_indentblock\\/indentblock,classy\\/base,classy\\/messages,clientside_validation_jquery\\/cv.jquery.ife,core\\/normalize,dhs_uswds\\/global,dhs_uswds\\/uswds,extlink\\/drupal.extlink,google_tag\\/gtag,google_tag\\/gtag.ajax,google_tag\\/gtm,system\\/base,tb_megamenu\\/theme.tb_megamenu,uscis_design\\/global-styling,uscis_design\\/select-component,usfedgov_google_analytics\\/load-analytics-cdn,uswds\\/drupal\",\"theme\":\"uscis_design\",\"theme_token\":null},\"ajaxTrustedUrl\":{\"form_action_p_pvdeGsVG5zNF_XLGPTvYSKCf43t8qZYSwcfZl2uzM\":true},\"clientside_validation_jquery\":{\"validate_all_ajax_forms\":2,\"force_validate_on_blur\":false,\"messages\":{\"required\":\"This field is required.\",\"remote\":\"Please fix this field.\",\"email\":\"Please enter a valid email address.\",\"url\":\"Please enter a valid URL.\",\"date\":\"Please enter a valid date.\",\"dateISO\":\"Please enter a valid date (ISO).\",\"number\":\"Please enter a valid number.\",\"digits\":\"Please enter only digits.\",\"equalTo\":\"Please enter the same value again.\",\"maxlength\":\"Please enter no more than {0} characters.\",\"minlength\":\"Please enter at least {0} characters.\",\"rangelength\":\"Please enter a value between {0} and {1} characters long.\",\"range\":\"Please enter a value between {0} and {1}.\",\"max\":\"Please enter a value less than or equal to {0}.\",\"min\":\"Please enter a value greater than or equal to {0}.\",\"step\":\"Please enter a multiple of {0}.\"}},\"data\":{\"extlink\":{\"extTarget\":false,\"extTargetNoOverride\":false,\"extNofollow\":false,\"extNoreferrer\":false,\"extFollowNoOverride\":false,\"extClass\":\"ext\",\"extLabel\":\"(link is external)\",\"extImgClass\":false,\"extSubdomains\":true,\"extExclude\":\"\\\\.gov|\\\\.mil\",\"extInclude\":\"web\\\\.archive\\\\.org\",\"extCssExclude\":\".footer-social-media__links,.usa-footer__contact-links\",\"extCssExplicit\":\"\",\"extAlert\":true,\"extAlertText\":\"You are now leaving an official website of U.S. Citizenship and Immigration Services. Links to non-USCIS sites are provided for the visitor\\u2018s convenience and do not represent an endorsement by USCIS of any commercial or private issues, products or services. Note that the privacy policy of the linked site may differ from that of USCIS.\",\"mailtoClass\":\"0\",\"mailtoLabel\":\"(link sends email)\",\"extUseFontAwesome\":true,\"extIconPlacement\":\"append\",\"extFaLinkClasses\":\"far fa-external-link-alt\",\"extFaMailtoClasses\":\"fa fa-envelope-o\",\"whitelistedDomains\":[]}},\"ckeditorAccordion\":{\"accordionStyle\":{\"collapseAll\":0,\"keepRowsOpen\":0,\"animateAccordionOpenAndClose\":0,\"openTabsWithHash\":0}},\"admin_feedback\":{\"yes_response\":\"Unused\",\"no_response\":\"This page was not helpful because the content:\",\"custom_text_response_on_no\":{\"value\":\"\",\"format\":\"full_html\"},\"feedback_prompt_on_yes\":true,\"feedback_prompt_on_no\":true,\"feedback_enable_predefined_answers\":true,\"feedback_prompt\":\"Great!  Any other feedback? (Optional)\",\"feedback_allow_cancel\":{\"active\":false,\"timeout\":3},\"final_response\":\"Thank you for your feedback.\"},\"TBMegaMenu\":{\"TBElementsCounter\":{\"column\":15},\"theme\":\"uscis_design\"},\"user\":{\"uid\":0,\"permissionsHash\":\"3b6956a260aed539487495a59fc0d31d7bc833a987b30b49c2e3df9582097b29\"}}\n\n\n\n\n\n\n\n\n\n  \n\n"
}