{
    "content": "\n    <iframe src=\"https://www.googletagmanager.com/ns.html?id=GTM-WK8MXNN\"\n                  height=\"0\" width=\"0\" style=\"display:none;visibility:hidden\"></iframe>\n\n      \n    \n\n\n\n\n\n  \n\n  \n        \n      Skip to main content\n    \n\n    \n          \n        \n            \n      \n    \n        \n                      \n\n\nAn official website of the United States government    Here's how you know\n\n\n      \n      \n\n  \n\n            \n      \n    \n        \n          Español\n      \n  \n    \n        \n                      \n  \n  \n   Multilingual Resources\n\n\n      \n      \n\n  \n\n        \n      \n    \n          \n        \n            \n      \n    \n        \n                      \n\n\n\nOfficial websites use .gov\nA .gov website belongs to an official government organization in the United States.\n\n\n\n\n\n\n\nSecure .gov websites use HTTPS\nA lock ( A locked padlock  ) or https:// means you've safely connected to the .gov website. Share sensitive information only on official, secure websites.\n\n\n\n      \n      \n\n  \n\n        \n      \n    \n    \n              \n      \n      \n          \n      \n    \n        \n          \n      \n        \n      \n    \n      \n  \n  \n    \n        \n                      \n\n//<![CDATA[\n\n    \n//]]>\n \n\n\n\n\n\n\n\nSign In  \n\n\n\n\nAccess USCIS online services.\n\n\nSign In\n\tCreate Account\n\n\n\n\n\n      \n      \n\n  \n\n        Menu\n      \n\n      \n        \n          \n        \n          \n      \n    \n        \n                      Sign In \n\nCreate Account\n\n      \n      \n\n\n        \n          Topics      \n        Topics\n        \n                \n    \n        \n          Family                    \n    \n        \n          Family of Green Card Holders (Permanent Residents)              \n            \n\n        \n          Family of Refugees and Asylees              \n            \n\n        \n          Family of U.S. Citizens              \n            \n\n  \n\n  \n\n\n\n            \n\n        \n          Adoption                    \n    \n        \n          Before You Start              \n            \n\n        \n          Immigration through Adoption              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Military                    \n    \n        \n          Citizenship for Military Family Members              \n            \n\n        \n          Naturalization Through Military Service              \n            \n\n  \n\n  \n\n\n\n            \n\n        \n          Humanitarian                    \n    \n        \n          Humanitarian Parole              \n            \n\n        \n          Refugees and Asylum              \n            \n\n        \n          Temporary Protected Status              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Visit the U.S.                    \n    \n        \n          Change My Nonimmigrant Status              \n            \n\n        \n          Extend Your Stay              \n            \n\n  \n\n  \n\n\n\n            \n\n        \n          Working in the United States                    \n    \n        \n          Permanent Workers              \n            \n\n        \n          Temporary (Nonimmigrant) Workers              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Avoid Scams                    \n    \n        \n          Common Scams              \n            \n\n        \n          Find Legal Services              \n            \n\n        \n          Report Immigration Scams              \n            \n\n  \n\n  \n\n\n\n            \n\n        \n          Careers at USCIS                    \n    \n        \n          Career Opportunities              \n            \n\n        \n          Special Hiring Programs              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n        \n          Forms      \n        Forms\n        \n                \n    \n        \n          Most Accessed Forms                    \n    \n        \n          I-485, Application to Register Permanent Residence or Adjust Status              \n            \n\n        \n          I-765, Application for Employment Authorization              \n            \n\n        \n          I-90, Application to Replace Permanent Resident Card (Green Card)              \n            \n\n        \n          N-400, Application for Naturalization              \n            \n\n  \n\n  \n\n\n\n            \n\n        \n          All Forms              \n            \n\n        \n          File Online              \n            \n\n  \n\n  \n\n    \n    \n        \n          Family Based Forms                    \n    \n        \n          I-129F, Petition for Alien Fiancé(e)              \n            \n\n        \n          I-130, Petition for Alien Relative              \n            \n\n        \n          I-360, Petition for Amerasian, Widow(er), or Special Immigrant              \n            \n\n        \n          I-600, Petition to Classify Orphan as an Immediate Relative              \n            \n\n        \n          I-751, Petition to Remove Conditions on Residence              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Employment Based Forms                    \n    \n        \n          I-9, Employment Eligibility Verification              \n            \n\n        \n          I-129, Petition for a Nonimmigrant Worker              \n            \n\n        \n          I-140, Immigrant Petition for Alien Workers              \n            \n\n        \n          I-526, Immigrant Petition by Standalone Investor              \n            \n\n        \n          I-539, Application to Extend/Change Nonimmigrant Status              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Humanitarian Based Forms                    \n    \n        \n          I-134A, Online Request to be a Supporter and Declaration of Financial Support              \n            \n\n        \n          I-589, Application for Asylum and for Withholding of Removal              \n            \n\n        \n          I-730, Refugee/Asylee Relative Petition              \n            \n\n        \n          I-821, Application for Temporary Protected Status              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n        \n          Newsroom      \n        Newsroom\n        \n                \n    \n        \n          All News                    \n    \n        \n          Alerts              \n            \n\n        \n          Fact Sheets              \n            \n\n        \n          News Releases              \n            \n\n        \n          Stakeholder Messages              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Media Contacts              \n            \n\n        \n          Multimedia Gallery              \n            \n\n        \n          Social Media Directory              \n            \n\n        \n          Speeches, Statements, Testimony              \n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n        \n          Citizenship      \n        Citizenship\n        \n                \n    \n        \n          Learners                    \n    \n        \n          Apply for Citizenship              \n            \n\n        \n          Learn About Citizenship              \n            \n\n        \n          Naturalization Test and Study Resources              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Educators                    \n    \n        \n          Educational Products for Educators              \n            \n\n        \n          Resources for Educational Programs              \n            \n\n        \n          Teacher Training Sessions              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Organizations                    \n    \n        \n          Outreach Tools              \n            \n\n        \n          Civic Integration              \n            \n\n        \n          Interagency Strategy for Promoting Naturalization              \n            \n\n        \n          Naturalization-Related Data and Statistics              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Grants                    \n    \n        \n          Learn About the Citizenship and Integration Grant Program              \n            \n\n        \n          Success Stories from Grant Recipients              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n        \n          Green Card      \n        Green Card\n        \n                \n    \n        \n          Green Card Processes and Procedures                    \n    \n        \n          Adjustment of Status              \n            \n\n        \n          After We Grant Your Green Card              \n            \n\n        \n          Employment Authorization Document              \n            \n\n        \n          Visa Availability and Priority Dates              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Green Card Eligibility Categories              \n            \n\n        \n          How to Apply for a Green Card              \n            \n\n        \n          Replace Your Green Card              \n            \n\n        \n          While Your Green Card Application Is Pending with USCIS              \n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n        \n          Laws      \n        Laws\n        \n                \n    \n        \n          Legislation                    \n    \n        \n          Immigration and Nationality Act              \n            \n\n  \n\n  \n\n\n\n            \n\n        \n          Class Action, Settlement Notices and Agreements              \n            \n\n        \n          Unlawful Presence and Inadmissibility              \n            \n\n        \n          Policy Manual              \n            \n\n  \n\n  \n\n    \n    \n        \n          Regulations              \n            \n\n        \n          Administrative Appeals              \n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n        \n          Tools      \n        Tools\n        \n                \n    \n        \n          Self-Help Tools                    \n    \n        \n          Check Case Processing Times              \n            \n\n        \n          Case Status Online              \n            \n\n        \n          Change of Address              \n            \n\n        \n          E-Request              \n            \n\n        \n          Password Resets and Technical Support              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Website Resources                    \n    \n        \n          Archive              \n            \n\n        \n          A-Z Index              \n            \n\n        \n          Website Policies              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n    \n    \n        \n          Additional Resources                    \n    \n        \n          Explore my Options              \n            \n\n        \n          Immigration and Citizenship Data              \n            \n\n        \n          Multilingual Resource Center              \n            \n\n        \n          USCIS Tools and Resources              \n            \n\n  \n\n  \n\n\n\n            \n\n  \n\n  \n\n\n\n        \n      \n      \n\n  \n\n\n  \n    \n        \n                      Contact us\n\tMultilingual Resources\n\t\n\n      \n      \n\n  \n\n      \n\n              \n          \n  \n\n      \n  \n  \n                    \n    \n\n  \n\n            \n\n      \n              \n                      \n                  \n            \n                  \n        \n                  \n                            \n    \n  \n\n                      \n        \n                  \n        \n        \n                                    \n                  \n    \n            \n  Main navigation\n  \n\n        \nSkip to main content\n\n      \n          Working in the United StatesInternational Entrepreneur RuleTemporary WorkersCW-1: CNMI-Only Transitional WorkerE-1 Treaty TradersE-2 CNMI InvestorE-2 Treaty InvestorsE-3 Certain Specialty Occupation Professionals from AustraliaH-1B Specialty OccupationsH-1B Cap SeasonFAQs for Individuals in H-1B Nonimmigrant StatusH-1B Electronic Registration ProcessOrganizational Accounts Frequently Asked QuestionsExtension of Post Completion Optional Practical Training (OPT) and F-1 Status for Eligible Students under the H-1B Cap-Gap RegulationsEmployment Authorization for Certain H-4 Dependent SpousesH-2A Agricultural WorkersH-2B Non-Agricultural WorkersH-3 Nonimmigrant TraineeI Representatives of Foreign MediaL-1A Intracompany Transferee Executive or ManagerL-1B Intracompany Transferee Specialized KnowledgeO-1 Individuals with Extraordinary Ability or AchievementO Nonimmigrant Classifications: Question and AnswersP-1A Internationally Recognized AthleteP-1B Member of Internationally Recognized Entertainment GroupP-2 Performer or Group Performing under Reciprocal Exchange ProgramP-3 Artist or Entertainer Part of a Culturally Unique ProgramQ Cultural ExchangeR-1 Temporary Religious WorkersTN NAFTA ProfessionalsPermanent WorkersEmployment-Based Immigration: First Preference EB-1Employment-Based Immigration: Second Preference EB-2Employment-Based Immigration: Third Preference EB-3Employment-Based Immigration: Fourth Preference EB-4Special Immigrant JuvenilesSpecial Immigrant Juvenile (SIJ) Frequently Asked QuestionsReligious WorkersEmployment-Based Immigration: Fifth Preference EB-5EB-5 Immigrant Investor Regional CentersEB-5 Integrity FundAbout the EB-5 Visa ClassificationEB-5 Immigrant Investor ProcessSTEM Employment PathwaysImmigrant Pathways for STEM Employment in the United StatesNonimmigrant Pathways for STEM Employment in the United StatesEntrepreneur Employment PathwaysImmigrant Pathways for Entrepreneur Employment in the United StatesNonimmigrant or Parole Pathways for Entrepreneur Employment in the United StatesStudents and Exchange VisitorsConrad 30 Waiver ProgramExchange VisitorsStudents and EmploymentTemporary Visitors for BusinessB-1 Temporary Business VisitorGB Temporary Business Visitor to GuamWB Temporary Business Visitor under Visa Waiver ProgramInformation for Employers and EmployeesAutomatic Employment Authorization Document (EAD) ExtensionDHS Support of the Enforcement of Labor and Employment LawsEmployer InformationEmployment AuthorizationVIBEEmployment Authorization in Compelling CircumstancesOptions for Nonimmigrant Workers Following Termination of EmploymentReport Labor AbusesPetition Process OverviewImportant Information About Working Legally in the United States    \n    \n  \n\n\n  \n\n  \n\n              \n                      \n          \n                            \n      \n    \n        \n            \n    Breadcrumb\n    \n              \n          Home        \n              \n          Working in the United States        \n              \n          Information for Employers and Employees        \n              \n          Options for Nonimmigrant Workers Following Termination of Employment        \n          \n  \n\n      \n\n  \n\n            \n            \n            \n                              \n              \n              \n                                    \n      \n    \n        \n          \n\n      \n                \n\n                        \n            \n              Options for Nonimmigrant Workers Following Termination of Employment\n            \n          \n              \n                    \n      \n  \n                      When nonimmigrant workers are laid off, they may not be aware of their options and, in some instances, may wrongly assume that they have no option but to leave the country within 60 days.When a nonimmigrant worker’s employment ends, either voluntarily or involuntarily, they typically may take one of the following actions, if eligible, to remain in a period of authorized stay in the United States:File an application for a change of nonimmigrant status;File an application for adjustment of status;File an application for a “compelling circumstances” employment authorization document; orBe the beneficiary of a nonfrivolous petition to change employer.If one of these actions occurs within the up to 60-day grace period, the nonimmigrant’s period of authorized stay in the United States can exceed 60 days, even if they lose their previous nonimmigrant status. If the worker takes no action within the grace period, they and their dependents may then need to depart the United States within 60 days, or when their authorized validity period ends, whichever is shorter.Nonimmigrant status is typically based on an approved Form I-129, Petition for a Nonimmigrant Worker, or after admission, a subsequently approved Form I-539, Application to Extend/Change Nonimmigrant Status. A period of authorized stay typically includes the period when a timely filed nonfrivolous petition or application requesting an extension of stay or change of status is pending with USCIS, as described in detail below.Maximum 60-Day Grace PeriodRegulations permit a discretionary grace period that allows workers in E-1, E-2, E-3, H-1B, H-1B1, L-1, O-1, or TN classifications (and their dependents) to be considered as having maintained status in that same classification after the end of employment for up to 60 consecutive calendar days or until the end of the authorized nonimmigrant validity period, whichever is shorter (the “maximum 60-day grace period”). See 8 CFR 214.1(l)(2).The worker can preserve their period of authorized stay in the United States, however, as long as the worker timely files, if eligible, an application for a change of nonimmigrant status, an application for adjustment of status, or an application for a compelling circumstances employment authorization document, or if the worker is the beneficiary of a nonfrivolous petition to change employer before their nonimmigrant status expires.If the worker is an eligible H-1B nonimmigrant and an employer files a new nonfrivolous H-1B petition on their behalf, the worker can begin work immediately after USCIS receives the petition and continue to maintain their H-1B status.Please see the additional sections below for a detailed overview of these options.Q: Why is the 60-day grace period important?A. Before a regulatory change in 2016, there was no grace period for a terminated nonimmigrant worker. The maximum 60-day grace period provides time for a nonimmigrant worker to retain their nonimmigrant status. Alternatively, the 60-grace period provides time for the worker to request a change of status, which may allow the worker to continue their job search from within the United States, even if the grace period and the worker’s current nonimmigrant status expire. This is because a worker may remain in an authorized period of stay based on a timely filed nonfrivolous application to change to a new nonimmigrant status.The grace period also provides time for certain spouses of nonimmigrant workers to continue their own employment if they have an Employment Authorization Document or are employment-authorized incident to status.Within the grace period, eligible H-1B nonimmigrant workers may also begin employment again as soon as a new employer properly files a new H-1B petition, rather than waiting for the new petition to be approved. A worker filing for employment in another classification must wait to begin employment until the new petition is approved, but given the availability of premium processing, the wait for petition adjudication is often less than 15 business days.Q: When does the 60-day grace period start?A: The maximum 60-day grace period starts the day after termination of employment, which is typically determined based on the last day for which a salary or wage is paid.Q: How do I apply for the grace period?A: We will determine whether the grace period applies to your case during the adjudication of a subsequent extension of stay petition, change of status application, adjustment of status application, or compelling circumstances employment authorization application. Petitioners and applicants should state in a cover letter that they are requesting that we favorably exercise our discretion to grant the up to 60-day grace period.Q: Does the 60-day grace period apply to me if I voluntarily leave my job?A: Yes, the up to 60-day grace period may apply to voluntary and involuntary cessation of employment.Q: How many times can I use the grace period?A: You are eligible for the maximum 60-day grace period once during each authorized employer petition validity period. For example, if you are terminated from Employer A, we may favorably exercise our discretion to grant the grace period and consider you to have maintained status for up to 60 days. If you have a new employer petition approval with a new validity period with Employer B and are subsequently terminated, you may be eligible for another 60-day maximum grace period during the petition validity period with Employer B.Q: What is my status during the grace period?A: When favorably exercising its discretion, we would consider you to be maintaining nonimmigrant status during the maximum 60-day grace period.Q: Can I work during the grace period?A: As during any period of authorized stay, employment is prohibited during the up to 60-day grace period unless otherwise authorized. As long as you remain in a period of authorized stay, which can last beyond the grace period, you remain eligible for the same options to obtain work authorization in the United States as you did during the grace period. (For more details, please see the sections below on portability, change of status, adjustment of status, and compelling circumstances Employment Authorization Documents.)Q: What if my employer rehires me during the grace period?A: If your petition with that employer remains valid and you are rehired in the same position, you may resume work with no further action. If you are rehired in a new or changed position, your employer may be required to file an amended or new petition to notify us of any material change. If your employer notified us of the termination, thus automatically revoking the petition approval, the employer would need to file a new petition with us.Q: Can I travel during the grace period?A: The grace period ends upon any departure from the United States. If you depart the United States during the maximum 60-day grace period, you must seek another immigration status that would permit reentry.Q. What happens if my employment is terminated while I am outside of the United States?A: If a nonimmigrant worker is outside the United States and terminated with no notice period, or the notice period ends before the worker is able to return, then the grace period does not apply, and the worker must seek another immigration status that would permit reentry. If the worker can, and, in fact, does return to the United States before the notice period ends (that is, before the effective date of termination), the discretionary grace period may apply.Q: Is my dependent spouse’s Employment Authorization Document (EAD) valid during the grace period?A: Yes, if your spouse has an EAD or employment authorization incident to status, this authorization to work will remain valid during the maximum 60-day grace period.Q: What happens to my post-completion Optional Practical Training (OPT) EAD if my employment is terminated?A: The maximum 60-day grace period only applies to workers in E-1, E-2, E-3, H-1B, H-1B1, L-1, O-1, or TN classifications (and their dependents). During post-completion OPT, F-1 status is dependent upon employment. Students may not accrue an aggregate of more than 90 days of unemployment during any post-completion OPT. Students granted 24-month Science, Technology, Engineering, and Math (STEM) OPT may not accrue an aggregate of more than 150 days of unemployment during a total OPT period, including any post-completion OPT period and any subsequent 24-month extension period. See 8 CFR 214.2(f)(10)(ii)(E).Portability of Employer PetitionsThere are two kinds of job portability, or “porting,” available based on two different kinds of employer petitions:Eligible H-1B nonimmigrants may begin working for a new employer as soon as the employer properly files a new H-1B petition (Form I-129) requesting to amend or extend H-1B status with USCIS, without waiting for the petition to be approved. More information about H-1B portability can be found on our H-1B Specialty Occupations page.A worker with an adjustment of status application (Form I-485) that has been pending for at least 180 days with an underlying valid immigrant visa petition (Form I-140) can transfer the underlying immigrant visa petition to a qualifying new offer of employment in the same or similar occupational classification with the same or a new employer. More information about this kind of porting can be found in the USCIS Policy Manual.Q: Can I port to a new H-1B employer during the grace period?A: H-1B portability allows eligible H-1B nonimmigrants to change employers, or “port,” to a new H-1B employer and begin working for the new employer as soon as a nonfrivolous H-1B petition with a request to amend or extend H-1B status is properly filed with USCIS, without waiting for the new petition to be approved. For additional information please see our H-1B Specialty Occupations webpage.If you are in another status apart from H-1B or use the grace period to change your status from H-1B to another status, you must wait for the petition with the new employer to be approved before beginning employment under the new status. As described below, however, if the petition or application for change of status is non-frivolous and filed before the end of the grace period (or your authorized validity period, whichever is shorter), you may remain in the United States in an authorized period of stay.Also note that premium processing can considerably reduce the wait time for adjudication of Form I-129, Petition for Nonimmigrant Worker.Q: If I find a new H-1B employer, can my new employer file the new H-1B petition without a certified Labor Condition Application (LCA)?A: No, a certified LCA is required initial evidence that must accompany a properly filed H-1B petition. LCAs are generally reviewed and certified by the Department of Labor within seven working days.Change of StatusThe timely filing of a non-frivolous application to change status will “toll,” or stop, the accrual of unlawful presence until the application is adjudicated, if the applicant did not work without authorization, either before the application was filed or while it was pending, and the applicant maintained their status prior to the filing of the request for change of status.For example, if an individual files a non-frivolous application to change status before the end of the applicant’s maximum 60-day grace period, they will not accrue unlawful presence while the application remains pending, even after the maximum 60-day grace period has elapsed (again, as long as they did not work without authorization either before the application was filed or while it was pending). If the application is ultimately approved, then the individual’s status is changed, and the individual is considered to have been in a period of authorized stay for the entire time the application was pending.  If the application is denied, then the individual starts to accrue unlawful presence the day after the denial decision. Please see our Unlawful Presence and Inadmissibility page for more information.Workers may use the maximum 60-day grace period to apply to change their nonimmigrant status, which, depending on eligibility, may include:Changing status to become the dependent of a spouse (for example, H-4, L-2). Some individuals in a dependent nonimmigrant status may be eligible for employment authorization incident to status, including spouses of E-1, E-2, E-3, or L-1 nonimmigrants (see the USCIS Policy Manual). In addition, some spouses of H-1B workers may be eligible for employment authorization if certain requirements are met.Changing status to student status (for example, F-1) or visitor status (B-1 or B-2). Note that, by statute, B-1 and B-2 nonimmigrant visitors are specifically precluded from “performing skilled or unskilled labor” in the United States. Certain F-1 students, by regulation, may engage in limited employment. For more information, please see our Change My Nonimmigrant Status page.Seeking a new employer-sponsored nonimmigrant status in the same or different status. For example, depending on the specific facts presented, an L-1 worker may be eligible for new employment under the TN, E-3, or H-1B1 classifications. The timely filing of a non-frivolous change of status petition by a prospective employer will prevent the accrual of unlawful presence until the petition is adjudicated (see above), if the worker did not engage in employment without authorization either before the petition was filed or while it was pending. Such a filing alone will not, however, confer employment authorization in the new position while the petition is pending, and will not extend employment authorization if the original classification is no longer valid. Some petitions may be eligible for premium processing for an additional fee. Potential pathways for noncitizen STEM professionals can be found on our Options for Noncitizen STEM Professionals to Work in the United States page.Q: Can my change of status petition or application be expedited?A: You may ask that we expedite the adjudication of your pending Form I-539 application. We will consider all expedite requests on a case-by-case basis and has the discretion to approve an expedite request if one of the prescribed USCIS expedite criteria has been met. Generally, we do not consider expedite requests for petitions and applications if premium processing service is available (as are all I-129 petitions).Q: How soon can I start working if I change my status to an employment-authorized dependent status?A: Employment is authorized incident to status for certain E and L nonimmigrant spouses; those individuals may begin working as soon as the change of status, if granted, takes effect (typically upon approval of the change of status application). Individuals in other dependent statuses, if eligible for employment authorization, will need to apply for employment authorization by filing Form I-765, Application for Employment Authorization, and may begin working after approval.Q: Will my pending I-539 change of status application to B-1 or B-2 be prioritized if I find a new employer who files an I-129 petition with a request for premium processing service?A: If an employer files a Form I-129 petition on your behalf, along with a request for premium processing service, we generally will process the pending I-539 and the I-129 together during the premium processing timeframe and issue concurrent decisions. This means there should be no delay in adjudication of the I-129 because of the pending I-539. No formal request is required for the pending I-539 to be prioritized. If we approve the I-129 petition, including any requested change of status, then you generally will obtain the nonimmigrant status requested on the I-129 petition (not the I-539), and may begin working. You generally would not need to depart the United States to obtain the requested nonimmigrant status in this scenario.Q: Can I file a change of status to B-1 or B-2 if I have a pending or approved I-140?A: Yes, having a pending or approved I-140 should have no impact on your change of status request, so long as you maintain an intent to depart after any approved temporary period of stay and continue to maintain a residence abroad that you do not intend to abandon.Q: Can I look for a new job while in B-1 or B-2 status?A: Yes, searching for employment and interviewing for a position are permissible B-1 or B-2 activities. By statute, however, you may not engage in employment within the domestic labor market (also known as “local labor for hire”) while in B-1 status or engage in any employment while in B-2 status. Before beginning any new employment, a petition and request for a change of status from B-1 or B-2 to an employment-authorized status must be approved, and the new status must take effect. Alternatively, if the change of status request is denied or the petition for new employment requested consular or port of entry notification, the individual must depart the United States and be admitted in an employment-authorized classification before beginning the new employment.Q: What happens if my prospective employer’s new petition or my application is denied? Can I file an appeal or a motion?A: Denial of a request for change of status or extension of stay may not be appealed. However, your employer may appeal a denial of the underlying petition on your behalf (if that case type is within the appellate jurisdiction of the Administrative Appeals Office. Your employer may also file a motion on a denial of your change or extension request. Both appeals and motions are filed on Form I-290B, Notice of Appeal or Motion. Note that the filing of an appeal or motion will not stop the accrual of unlawful presence – it will continue to accrue. If the motion is granted and the underlying application or petition is approved, the change or extension of status may also be approved if otherwise eligible and you will not have accrued unlawful presence.Adjustment of StatusSome workers may be eligible to file a self-petitioned immigrant visa petition concurrently with an adjustment of status application. Examples of immigrant classifications that are eligible for self-petitioning include EB-1 Extraordinary Ability and EB-5 Immigrant Investor. Workers with a pending adjustment application are generally eligible to remain in the United States in a period of authorized stay and obtain an Employment Authorization Document (EAD).Compelling Circumstances Employment Authorization DocumentWorkers who are the beneficiary of an approved employment-based immigrant visa petition (Form I-140) may be eligible for a compelling circumstances Employment Authorization Document (EAD) for up to one year if they:Do not have an immigrant visa available to them based on the Department of State’s Visa Bulletin; andFace compelling circumstances.A compelling circumstances EAD is a discretionary stopgap measure intended to assist certain individuals on the path to lawful permanent resident status by preventing the need to abruptly leave the United States. Workers who begin employment on a compelling circumstances EAD will no longer be maintaining nonimmigrant status but generally will be in a period of authorized stay and will not accrue unlawful presence in the United States while the EAD is valid. More information about eligibility requirements and the application process can be found on our Employment Authorization in Compelling Circumstances page.Q: What is a compelling circumstances EAD?A: In limited circumstances, USCIS may issue an Employment Authorization Document (EAD) that allows certain noncitizens facing compelling circumstances to work for any U.S. employer. Applying for a compelling circumstances EAD may be an option to remain working in the United States if other options are not available to you. A compelling circumstances EAD may assist certain individuals who already have an approved I-140, and face compelling circumstances, but who are not yet eligible to file an adjustment of status application or apply for an immigrant visa because a visa is not yet available based on their priority date, country of chargeability, and preference category. More information about eligibility requirements and the application process can be found on our Employment Authorization in Compelling Circumstances page.Q: What is my immigration status and work authorization if I’m within the grace period while a compelling circumstances EAD application is pending?A: We may consider you to be maintaining nonimmigrant status during the maximum 60-day grace period. If you file a nonfrivolous application for a compelling circumstances EAD during the grace period you will not accrue unlawful presence, even if the application remains pending after the grace period ends. However, you may not work during this period unless otherwise authorized.Q: What happens if I have a compelling circumstances EAD application approved, but a change of status application is still pending?A: If the compelling circumstances EAD is approved, you are authorized for employment based on compelling circumstances. If your Form I-94 has expired, you will not be in a nonimmigrant status, however you will be considered as being in a period of authorized stay during the EAD validity period. If your compelling circumstances EAD application is approved, and you work using the compelling circumstances EAD or are no longer maintaining your nonimmigrant status, you will not be eligible to change your status in the United States.Q: What will happen if I make an expedite request for my compelling circumstances EAD application?A: The USCIS Contact Center will create and forward a service request for consideration for expeditious handling on your behalf to the office with jurisdiction over your application. The reviewing office will contact you if additional information is required to process your expedite request. You will receive a notice from USCIS with a decision to either approve or deny your expedite request.Q: Can I still file an Adjustment of Status application (Form I-485) if I am working based on a compelling circumstances EAD?A: If you are working in the United States under a compelling circumstances EAD and your immigrant visa priority date becomes current, you generally would not be eligible to file Form I-485, Application to Register Permanent Residence of Adjust Status. Instead, you would need to request USCIS to notify the Department of State’s National Visa Center (NVC) if your immigrant petition is approved so that you may process your immigrant visa application abroad. For more information on immigrant visa processing, please see the NVC Processing webpage.Q: What happens if I am working based on a compelling circumstances EAD and a new employer files a Form I-129 on my behalf?A: If you are working in the United States under a compelling circumstances EAD and a new Form I-129 petition is filed on your behalf, you would not be granted a change of status or extension of stay. After the petition is approved for a new work-authorized classification, you would need to apply for a visa and/or admission from outside the United States to begin working.Q: Are my spouse and children eligible for a compelling circumstances EAD?A: Yes, your spouse and children may be eligible for a compelling circumstances EAD. They must be in valid nonimmigrant status at the time of filing the compelling circumstances EAD application. Your spouse and children may file their applications concurrently with your application, but their applications cannot be approved until after your application is approved. The validity period of employment authorization granted to your spouse and children may not extend beyond the validity of your employment authorization. Expedite CriteriaSome circumstances may warrant expedited adjudication, including applications to change status to a dependent status that includes eligibility for employment authorization. For example, an application to change status from H-1B to L-2 may be eligible for expedited adjudication to prevent severe financial loss. See the How to Make an Expedite Request page for additional information. Please note that USCIS generally does not consider expedite requests for petitions and applications if premium processing service is available.Departure from the United StatesNotwithstanding the above options to extend a period of authorized stay, workers may choose to depart the United States. For H-1B and O workers who chose to depart the United States after involuntary cessation of employment, the H-1B employer or the O employer and O petitioner, as applicable, must pay the reasonable costs of transportation to the worker’s last place of foreign residence. In addition, for O workers, both the employer and the petitioner are jointly and severally liable for the reasonable cost of return transportation. (See 8 CFR 214.2(h)(4)(iii)(E) and 8 CFR 214.2(o)(16).)Once abroad, H-1B holders may seek U.S. employment and readmission to the United States for any remaining period of their H-1B status. Those seeking another classification for which they may be eligible can complete the application or petition process abroad and seek readmission to the United States.\n      \n      \n\n                \n  \n  \n    \n              \n    Last Reviewed/Updated:\n                04/01/2024\n\n      \n  \n\n      \n\n      \n\n  \n\n                              \n\n                                \n      \n    \n        \n          \n\n  \n      \n    Was this page helpful?\n  \n  \n                \n          \n          Yes\n    \n\n          \n          No\n    \n\n\n          \n\n\n        This page was not helpful because the content:\n          Select a reasonhas too little informationhas too much informationis confusingis out of dateother\n      \n\n        How can the content be improved?\n          \n  \n\n\n      0 / 2000To protect your privacy, please do not include any personal information in your feedback. Review our Privacy Policy.\n      \n\n\n\n\n      \n\n  \n\n              \n                \n            \n          \n        \n\n              \n    \n                                \n  \n    \n\n  \n    \n      Return to top\n    \n\n           \n         \n           \n                                         \n                 \n\n                      \n                          \n        Topics\n              \n                      \n        Forms\n              \n                      \n        Newsroom\n              \n                      \n        Citizenship\n              \n                      \n        Green Card\n              \n                      \n        Laws\n              \n                      \n        Tools\n              \n        \n  \n\n\n\n\n\n                 \n               \n             \n                     \n                               \n       \n                            \n        \n          \n\n                      \n              \n                \n                  \n              \n                              \n                                                              \n                  \n                                                                  \n                                                      \n                              Facebook\n                            \n                                                  \n                                                                                        \n                                                      \n                              Twitter\n                            \n                                                  \n                                                                                        \n                                                      \n                              YouTube\n                            \n                                                  \n                                                                                                                                                                            \n                                                      \n                              Instagram\n                            \n                                                  \n                                                                                        \n                                                      \n                              LinkedIn\n                            \n                                                  \n                                                                                        \n                                                      \n                              Email\n                            \n                                                  \n                                                            \n\n                                  \n                                          Contact USCIS\n                                      \n                                  \n                    \n                                                                \n                  \n                \n                          \n          \n          \n        \n      \n    \n      \n        \n          \n            \n              \n                \n                  \n                    \n                  \n                Agency description\n                \n                  USCIS.gov\n                  \n                    An official website of the U.S. Department of Homeland Security\n                  \n                \n              \n            \n              \n    \n\n\n            \n  Important links\n  \n\n        \n  \n    \n                                                                                                                                About USCIS                                                  \n                                                Accessibility                                                  \n                                                Budget and Performance                                                  \n                                                DHS Components                                                  \n                                    \n                                                                                                                            Freedom of Information Act                                                  \n                                                No FEAR Act Data                                                  \n                                                Privacy and Legal Disclaimers                                                  \n                                                Site Map                                                  \n                                    \n                                                                                                                            Office of the Inspector General                                                  \n                                                The White House                                                  \n                                                USA.gov                                                  \n                                    \n                                                \n\n          \n  \n\n\n  \n\n\n  \n\n                        \n              \n                Looking for U.S. government information and services?\n                Visit USA.gov\n              \n            \n          \n                      \n                \n            \n                  \n      \n    \n  \n\n\n  \n\n    \n      \n    \n        \n                      \n//<![CDATA[\n\n(function(){var g=function(e,h,f,g){\nthis.get=function(a){for(var a=a+\"=\",c=document.cookie.split(\";\"),b=0,e=c.length;b<e;b++){for(var d=c[b];\" \"==d.charAt(0);)d=d.substring(1,d.length);if(0==d.indexOf(a))return d.substring(a.length,d.length)}return null};\nthis.set=function(a,c){var b=\"\",b=new Date;b.setTime(b.getTime()+6048E5);b=\"; expires=\"+b.toGMTString();document.cookie=a+\"=\"+c+b+\"; path=/; \"};\nthis.check=function(){var a=this.get(f);if(a)a=a.split(\":\");else if(100!=e)\"v\"==h&&(e=Math.random()>=e/100?0:100),a=[h,e,0],this.set(f,a.join(\":\"));else return!0;var c=a[1];if(100==c)return!0;switch(a[0]){case \"v\":return!1;case \"r\":return c=a[2]%Math.floor(100/c),a[2]++,this.set(f,a.join(\":\")),!c}return!0};\nthis.go=function(){if(this.check()){var a=document.createElement(\"script\");a.type=\"text/javascript\";a.src=g;document.body&&document.body.appendChild(a)}};\nthis.start=function(){var t=this;\"complete\"!==document.readyState?window.addEventListener?window.addEventListener(\"load\",function(){t.go()},!1):window.attachEvent&&window.attachEvent(\"onload\",function(){t.go()}):t.go()};};\ntry{(new g(100,\"r\",\"QSI_S_ZN_3WrTsyl9WWQdlxb\",\"https://zn3wrtsyl9wwqdlxb-uscisomnichannel.gov1.siteintercept.qualtrics.com/SIE/?Q_ZID=ZN_3WrTsyl9WWQdlxb\")).start()}catch(i){}})();\n\n//]]>\n\n\n      \n      \n  \n    \n        \n                      \n  /*<![CDATA[*/\n  (function() {\n    var sz = document.createElement('script'); sz.type = 'text/javascript'; sz.async = true;\n    sz.src = '//siteimproveanalytics.com/js/siteanalyze_10709.js';\n    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(sz, s);\n  })();\n  /*]]>*/\n\n      \n      \n\n  \n\n\n\n  \n\n    \n    {\"path\":{\"baseUrl\":\"\\/\",\"scriptPath\":null,\"pathPrefix\":\"\",\"currentPath\":\"node\\/95129\",\"currentPathIsAdmin\":false,\"isFront\":false,\"currentLanguage\":\"en\"},\"pluralDelimiter\":\"\\u0003\",\"suppressDeprecationErrors\":true,\"gtm\":{\"tagId\":null,\"settings\":{\"data_layer\":\"dataLayer\",\"include_classes\":false,\"allowlist_classes\":\"google\\nnonGooglePixels\\nnonGoogleScripts\\nnonGoogleIframes\",\"blocklist_classes\":\"customScripts\\ncustomPixels\",\"include_environment\":false,\"environment_id\":\"\",\"environment_token\":\"\"},\"tagIds\":[\"GTM-WK8MXNN\"]},\"gtag\":{\"tagId\":\"\",\"otherIds\":[],\"events\":[],\"additionalConfigInfo\":[]},\"ajaxPageState\":{\"libraries\":\"admin_feedback\\/admin_feedback_block,admin_feedback\\/admin_feedback_css,admin_feedback_extended\\/feedback_extended,asset_injector\\/css\\/qualtrics_popup_dialog,asset_injector\\/css\\/rtl_table_heading,asset_injector\\/js\\/force_enable_reset,asset_injector\\/js\\/preview_message_bar,asset_injector\\/js\\/translation_helper,calendar\\/calendar.theme,ckeditor_accordion\\/accordion.frontend,ckeditor_indentblock\\/indentblock,classy\\/base,classy\\/messages,clientside_validation_jquery\\/cv.jquery.ife,core\\/normalize,dhs_uswds\\/global,dhs_uswds\\/uswds,extlink\\/drupal.extlink,google_tag\\/gtag,google_tag\\/gtag.ajax,google_tag\\/gtm,system\\/base,tb_megamenu\\/theme.tb_megamenu,uscis_design\\/global-styling,uscis_design\\/select-component,usfedgov_google_analytics\\/load-analytics-cdn,uswds\\/drupal\",\"theme\":\"uscis_design\",\"theme_token\":null},\"ajaxTrustedUrl\":{\"form_action_p_pvdeGsVG5zNF_XLGPTvYSKCf43t8qZYSwcfZl2uzM\":true},\"clientside_validation_jquery\":{\"validate_all_ajax_forms\":2,\"force_validate_on_blur\":false,\"messages\":{\"required\":\"This field is required.\",\"remote\":\"Please fix this field.\",\"email\":\"Please enter a valid email address.\",\"url\":\"Please enter a valid URL.\",\"date\":\"Please enter a valid date.\",\"dateISO\":\"Please enter a valid date (ISO).\",\"number\":\"Please enter a valid number.\",\"digits\":\"Please enter only digits.\",\"equalTo\":\"Please enter the same value again.\",\"maxlength\":\"Please enter no more than {0} characters.\",\"minlength\":\"Please enter at least {0} characters.\",\"rangelength\":\"Please enter a value between {0} and {1} characters long.\",\"range\":\"Please enter a value between {0} and {1}.\",\"max\":\"Please enter a value less than or equal to {0}.\",\"min\":\"Please enter a value greater than or equal to {0}.\",\"step\":\"Please enter a multiple of {0}.\"}},\"data\":{\"extlink\":{\"extTarget\":false,\"extTargetNoOverride\":false,\"extNofollow\":false,\"extNoreferrer\":false,\"extFollowNoOverride\":false,\"extClass\":\"ext\",\"extLabel\":\"(link is external)\",\"extImgClass\":false,\"extSubdomains\":true,\"extExclude\":\"\\\\.gov|\\\\.mil\",\"extInclude\":\"web\\\\.archive\\\\.org\",\"extCssExclude\":\".footer-social-media__links,.usa-footer__contact-links\",\"extCssExplicit\":\"\",\"extAlert\":true,\"extAlertText\":\"You are now leaving an official website of U.S. Citizenship and Immigration Services. Links to non-USCIS sites are provided for the visitor\\u2018s convenience and do not represent an endorsement by USCIS of any commercial or private issues, products or services. Note that the privacy policy of the linked site may differ from that of USCIS.\",\"mailtoClass\":\"0\",\"mailtoLabel\":\"(link sends email)\",\"extUseFontAwesome\":true,\"extIconPlacement\":\"append\",\"extFaLinkClasses\":\"far fa-external-link-alt\",\"extFaMailtoClasses\":\"fa fa-envelope-o\",\"whitelistedDomains\":[]}},\"ckeditorAccordion\":{\"accordionStyle\":{\"collapseAll\":0,\"keepRowsOpen\":0,\"animateAccordionOpenAndClose\":0,\"openTabsWithHash\":0}},\"admin_feedback\":{\"yes_response\":\"Unused\",\"no_response\":\"This page was not helpful because the content:\",\"custom_text_response_on_no\":{\"value\":\"\",\"format\":\"full_html\"},\"feedback_prompt_on_yes\":true,\"feedback_prompt_on_no\":true,\"feedback_enable_predefined_answers\":true,\"feedback_prompt\":\"Great!  Any other feedback? (Optional)\",\"feedback_allow_cancel\":{\"active\":false,\"timeout\":3},\"final_response\":\"Thank you for your feedback.\"},\"TBMegaMenu\":{\"TBElementsCounter\":{\"column\":15},\"theme\":\"uscis_design\"},\"user\":{\"uid\":0,\"permissionsHash\":\"3b6956a260aed539487495a59fc0d31d7bc833a987b30b49c2e3df9582097b29\"}}\n\n\n\n\n\n\n\n\n\n  \n\n"
}